Repository: c-fst/gb-asm-tutorial
Catalog: po/*.po
Languages: it

source: 1. `rgbasm -L -o hello world.o hello world.asm` won't work 2. `rgbasm -L -o "hello world.o" "hello world.asm"` will work
it: 1. `rgbasm -L -o hello world.o hello world.asm` non funzionerà 2. `rgbasm -L -o "hello world.o" "hello world.asm"` funzionerà

source: It should look like this: <script id="asciicast-weljUlcp1KC5GqS9jqV62dy5m" src="https://asciinema.celforyon.fr/a/weljUlcp1KC5GqS9jqV62dy5m.js" async></script>
it: E dunque il processo sarà il seguente: <script id="asciicast-weljUlcp1KC5GqS9jqV62dy5m" src="https://asciinema.celforyon.fr/a/weljUlcp1KC5GqS9jqV62dy5m.js" async></script>

source: (If you encounter an error you can't figure out by yourself, don't be afraid to [ask us](../index.md#feedback)! We'll sort it out.)
it: (Se riscontrate un errore che non riuscite a risolvere da soli, non abbiate paura di [chiedere](../index.md#feedback)! Lo risolveremo insieme)

source: Congrats! You just assembled your first Game Boy ROM! Now, we just need to run it; open BGB, right-click the window that opened, and load `hello-world.gb`.
it: Congratulazioni! Avete appena "assemblato" la vostra prima ROM per Game Boy! Ora dobbiamo solo eseguirla: aprite BGB, fate clic con il pulsante destro del mouse sulla finestra che si è aperta e caricate `hello-world.gb`.

source: If you are using Wine and BGB is failing to start (or gives a blank/black screen), [try these troubleshooting tips](https://eldred.fr/bgb#getting-started-on-wine).
it: Se state usando Wine e BGB non si avvia (o dà una schermata bianca/nera), [provate questi suggerimenti per la risoluzione dei problemi](https://eldred.fr/bgb#getting-started-on-wine).

source: And in any case, don't hesitate to ask for help!
it: E in ogni caso, non esitate a chiedere aiuto!

source: You could also take a flash cart (I use the [EverDrive GB X5](https://krikzz.com/store/home/47-everdrive-gb.html), but there are plenty of alternatives), load up your ROM onto it, and run it on an actual console!
it: Potreste anche prendere una flash cart (cartuccia flash) (io uso l'[EverDrive GB X5](https://krikzz.com/store/home/47-everdrive-gb.html), ma ci sono molte alternative), caricarci la vostra ROM e farla girare su una console vera e propria!

source: ![Picture of the Hello World running on a physical DMG](../assets/img/hello_dmg.jpg)
it: ![Immagine di Hello World in esecuzione su una console DMG reale](../assets/img/hello_dmg.jpg)

source: Well, now that we have something working, it's time to peel back the curtains...
it: Bene, ora che abbiamo qualcosa che funziona, è il momento di togliere le tende per scoprire cosa c'è sotto...

source: # The toolchain
it: # Strumenti di lavoro

source: So, in the previous lesson, we built a nice little "Hello World!" ROM. Now, let's find out exactly what we did.
it: Dunque, nella lezione precedente abbiamo scritto una piccola ROM "Hello World!". Ora è il momento di capire meglio cosa abbiamo fatto.

source: ## RGBASM and RGBLINK
it: ## RGBASM e RGBLINK

source: Let's begin by explaining what `rgbasm` and `rgblink` do.
it: Iniziamo spiegando cosa fanno `rgbasm` e `rgblink`.

source: RGBASM is an *assembler*. It is responsible for reading the source code (in our case, `hello-world.asm` and `hardware.inc`), and generating blocks of code with some "holes". RGBASM does not always have enough information to produce a full ROM, so it does most of the work, and stores its intermediary results in what's known as *object files* (hence the `.o` extension).
it: RGBASM è un *assembler* (compilatore). Il suo compito è leggere il codice sorgente (nel nostro caso `hello-world.asm` e `hardware.inc`) e generare un file di codice che però è incompleto: RGBASM non sempre ha tutte le informazioni che gli servono a generare una ROM, quindi produce dei *file oggetto* che fanno da intermediari (con estensione `.o`).

source: RGBLINK is a *linker*. Its job is taking object files (or, like in our case, just one), and "linking" them into a ROM, which is to say: filling the aforementioned "holes". RGBLINK's purpose may not be obvious with programs as simple as this Hello World, but it will become much clearer in Part Ⅱ.
it: RGBLINK è un *linker*. Il suo compito è usare le informazioni dei file oggetto (che nel nostro caso è solo uno) ed unirli (in inglese "link") in una ROM. RGBLINK potrebbe sembrare superfluo, ma è solo perché la ROM che abbiamo guardato è davvero piccola: quando nella seconda parte il nostro progetto crescerà, la sua utilità sarà più apparente.

source: So: Source code → `rgbasm` → Object files → `rgblink` → ROM, right? Well, not exactly.
it: Quindi: Codice sorgente → `rgbasm` → File oggetto → `rgblink` → ROM, giusto? Beh, non esattamente.

source: RGBLINK does produces a ROM, but it's not quite usable yet. See, actual ROMs have what's called a *header*. It's a special area of the ROM that contains [metadata about the ROM](https://gbdev.io/pandocs/The_Cartridge_Header.html); for example, the game's name, Game Boy Color compatibility, and more. For simplicity, we defaulted a lot of these values to 0 for the time being; we'll come back to them in Part Ⅱ.
it: RGBLINK produce sì una ROM, ma se la provassimo su un GameBoy non funzionerebbe. Nelle ROM deve sempre essere presente qualcosa chiamato *header*: questa sezione contiene [informazioni sulla ROM](https://gbdev.io/pandocs/The_Cartridge_Header.html), come il nome del gioco, il nome dell'autore, se sia compatibile con il GameBoy Color ed altro. Per il momento abbiamo impostato tutti i valori a zero nel programma per semplicità, ma ne riparleremo nella seconda parte del tutorial.

source: However, the header contains three crucial fields: - The [Nintendo logo](https://gbdev.io/pandocs/The_Cartridge_Header.html#0104-0133--nintendo-logo), - the [ROM's size](https://gbdev.io/pandocs/The_Cartridge_Header.html#0148--rom-size), - and [two checksums](https://gbdev.io/pandocs/The_Cartridge_Header.html#014d--header-checksum).
it: Ma nell'header ci sono anche delle componenti importantissime: - il [logo Nintendo](https://gbdev.io/pandocs/The_Cartridge_Header.html#0104-0133--nintendo-logo), - la [dimensione della ROM](https://gbdev.io/pandocs/The_Cartridge_Header.html#0148--rom-size), - e [due valori di controllo](https://gbdev.io/pandocs/The_Cartridge_Header.html#014d--header-checksum) ([checksum](https://it.wikipedia.org/wiki/Checksum)).

source: When the console first starts up, it runs [a little program](https://github.com/ISSOtm/gb-bootroms) known as the *boot ROM*, which reads and draws the logo from the cartridge, and displays the little boot animation. When the animation is finished, the console checks if the logo matches a copy that it stores internally; if there is a mismatch, **it locks up!** And, since it locks up, our game never gets to run... 😦 This was meant as an anti-piracy measure; however, that measure [has since then been ruled as invalid](https://en.wikipedia.org/wiki/Sega_v._Accolade), so don't worry, we are clear! 😄
it: Quando la console viene accesa viene eseguito [un programma](https://github.com/ISSOtm/gb-bootroms) chiamato *ROM di avvio* (boot ROM) responsabile, tra l'altro, dell'animazione di avvio leggendo il logo di Nintendo dalla ROM. Alla fine dell'animazione, però, la ROM di avvio controlla che il logo di Nintendo sia corretto, e interrompe l'esecuzione se non lo è: in pratica, se non azzecchiamo il logo il nostro gioco non partirà mai... 😦 Questo meccanismo era per evitare la pirateria; per nostra fortuna, però, [non è più valida](https://en.wikipedia.org/wiki/Sega_v._Accolade) perciò non dobbiamo preoccuparci! 😄

source: Similarly, the boot ROM also computes a *[checksum](https://en.wikipedia.org/wiki/Checksum)* of the header, supposedly to ensure that it isn't corrupted. The header also contains a copy of this checksum; if it doesn't match what the boot ROM computed, then the boot ROM **also locks up!**
it: Allo stesso modo, la ROM di avvio calcola anche un *[checksum](https://en.wikipedia.org/wiki/Checksum)* dell'intestazione, presumibilmente per garantire che non sia corrotta. L'intestazione contiene anche una copia di questo checksum; se non corrisponde a quello calcolato dalla ROM di avvio, la ROM di avvio **si blocca!**

source: The header also contains a checksum over the whole ROM, but nothing ever uses it. It doesn't hurt to get it right, though.
it: L'header contiene anche un checksum dell'intera ROM, ma non viene mai utilizzato. Non costa niente ed è una buona idea, comunque, farlo bene.

source: Finally, the header also contains the ROM's size, which is required by emulators and flash carts.
it: Infine, l'header contiene anche la dimensione della ROM, necessaria per emulatori e dalle flash cart.

source: RGBFIX's role is to fill in the header, especially these 3 fields, which are required for our ROM to be guaranteed to run fine. The `-v` option instructs RGBFIX to make the header **v**alid, by injecting the Nintendo logo and computing the two checksums. The `-p 0xFF` option instructs it to **p**ad the ROM to a valid size, and set the corresponding value in the "ROM size" header field.
it: RGBFIX serve proprio a compilare l'header in automatico, in particolare questi tre campi senza i quali il GameBoy non farà funzionare il gioco. L'opzione `-v` dice a RGBFIX di rendere **v**alido l'header, inserendo il logo e calcolando le checksum. L'opzione `-p 0xFF` invece aggiunge dei byte alla ROM finché non raggiunge una dimensione valida (in inglese **p**adding), per poi scriverla nell'header.

source: Alright! So the full story is: Source code → `rgbasm` → Object files → `rgblink` → "Raw" ROM → `rgbfix` → "Fixed" ROM. Good.
it: Perfetto! Quindi, per riassumere: <br> codice sorgente → `rgbasm` → file oggetto → `rgblink` → ROM "vera" → `rgbfix` → ROM funzionante

source: You might be wondering why RGBFIX's functionality hasn't been included directly in RGBLINK. There are some historical reasons, but RGBLINK can also be used to produce things other than ROMs (especially via the `-x` option), and RGBFIX is sometimes used without RGBLINK anywhere in sight.
it: A questo punto ti potresti chiedere: perché non si uniscono tutti questi programmi in uno solo? Ci sono ragioni nella storia di questi programmi, ma soprattutto RGBLINK può fare altro (per esempio usando `-x`), e a volte RGBFIX è usato senza che RGBLINK sia minimamente necessario.

source: ## File names
it: ## Nomi dei file

source: Note that RGBDS does not care at all about the files' extensions. Some people call their source code `.s`, for example, or their object files `.obj`. The file names don't matter, either; it's just practical to keep the same name.
it: A RGBDS, come alla maggior parte dei programmi, non importa come chiami i file né l'estensione che gli dai: l'importante è il contenuto. Per esempio molti usano l'estensione `.s` per il sorgente, oppure `.obj` per gli oggetti.

source: # Binary and hexadecimal
it: # Binario ed esadecimale

source: Before we talk about the code, a bit of background knowledge is in order. When programming at a low level, understanding of *[binary](https://en.wikipedia.org/wiki/Binary_number)* and *[hexadecimal](https://en.wikipedia.org/wiki/Hexadecimal)* is mandatory. Since you may already know about both of these, a summary of the RGBDS-specific information is available at the end of this lesson.
it: Prima di passare al codice dobbiamo introdurre alcuni concetti. Quando si programma ad un basso livello è fondamentale capire bene i sistemi *[binario](https://it.wikipedia.org/wiki/Sistema_numerico_binario)* ed *[esadecimale](https://it.wikipedia.org/wiki/esadecimale)*. Se già conoscessi questi concetti, in fondo alla pagina ci sono delle informazioni specifiche all'uso di RGDBS.

source: So, what's binary? It's a different way to represent numbers, in what's called *base 2*. We're used to counting in [base 10](https://en.wikipedia.org/wiki/Decimal), so we have 10 digits: 0, 1, 2, 3, 4, 5, 6, 7, 8, and 9. Here's how digits work:
it: Cos'è il binario? È semplicemente un modo alternativo di rappresentare i numeri, in _base 2_. Noi contiamo in [base 10](https://it.wikipedia.org/wiki/decimale), ovvero con 10 cifre: 0, 1, 2, 3, 4, 5, 6, 7, 8, e 9. Le cifre hanno una funzione ben specifica:

source: ``` 42 = 4 × 10 + 2 = 4 × 10^1 + 2 × 10^0 ↑ ↑ These tens come from us counting in base 10!
it: ``` 42 = 4 × 10 + 2 = 4 × 10^1 + 2 × 10^0 ↑ ↑ qui usiamo 10 perché contiamo in base 10!

source: 1024 = 1 × 1000 + 0 × 100 + 2 × 10 + 4 = 1 × 10^3 + 0 × 10^2 + 2 × 10^1 + 4 × 10^0 ↑ ↑ ↑ ↑ And here we can see the digits that make up the number! ```
it: 1024 = 1 × 1000 + 0 × 100 + 2 × 10 + 4 = 1 × 10^3 + 0 × 10^2 + 2 × 10^1 + 4 × 10^0 ↑ ↑ ↑ ↑ e qui vediamo le cifre che compongono il numero! ```

source: `^` here means "to the power of", where `X^N` is equal to multiplying `X` with itself `N` times, and `X ^ 0 = 1`.
it: `^` qui significa "alla potenza di", dove `X^N` è uguale a moltiplicare `X` con se stesso `N` volte, e `X ^ 0 = 1`.

source: Decimal digits form a unique *decomposition* of numbers in powers of 10 (*deci*mal is base 10, remember?). But why stop at powers of 10? We could use other bases instead, such as base 2. (Why base 2 specifically will be explained later.)
it: Con le cifre decimali ogni numero viene *scomposto* in maniera univoca in potenze di 10 (il *deci*male è la base 10, ricordi?). Ma perché fermarsi alle potenze di 10? Potremmo invece usare altre basi, come la base 2 (il perché della base 2 sarà spiegato più avanti).

source: Binary is base 2, so there are only two digits, called *bits*: 0 and 1. Thus, we can generalize the principle outlined above, and write these two numbers in a similar way:
it: Il sistema binario è in base 2, quindi ha solo due cifre (chiamate *bit*): 0 e 1. Possiamo quindi generalizzare il principio descritto sopra e riscrivere i due numeri di prima in modo simile:

source: ``` 42 = 1 × 32 + 0 × 16 + 1 × 8 + 0 × 4 + 1 × 2 + 0 = 1 × 2^5 + 0 × 2^4 + 1 × 2^3 + 0 × 2^2 + 1 × 2^1 + 0 × 2^0 ↑ ↑ ↑ ↑ ↑ ↑ And since now we're counting in base 2, we're seeing twos instead of tens!
it: ``` 42 = 1 × 32 + 0 × 16 + 1 × 8 + 0 × 4 + 1 × 2 + 0 = 1 × 2^5 + 0 × 2^4 + 1 × 2^3 + 0 × 2^2 + 1 × 2^1 + 0 × 2^0 ↑ ↑ ↑ ↑ ↑ ↑ E visto che stiamo contando in base 2, vediamo dei due invece dei dieci!

source: So, by applying the same principle, we can say that in base 2, 42 is written as `101010`, and 1024 as `10000000000`. Since you can't tell ten (decimal 10) and two (binary 10) apart, RGBDS assembly has binary numbers prefixed by a percent sign: 10 is ten, and %10 is two.
it: Quindi, applicando lo stesso principio, possiamo dire che in base 2, 42 si scrive come `101010` e 1024 come `10000000000`. Poiché non è possibile distinguere tra dieci (10 decimale) e due (10 binario), l'assemblaggio RGBDS prevede numeri binari preceduti da un segno di percentuale: 10 è dieci e %10 è due.

source: Okay, but why base 2 specifically? Rather conveniently, a bit can only be 0 or 1, which are easy to represent as "ON" or "OFF", empty or full, etc! If you want, at home, to create a one-bit memory, just take a box. If it's empty, it stores a 0; if it contains *something*, it stores a 1. Computers thus primarily manipulate binary numbers, and this has a *slew* of implications, as we will see throughout this entire tutorial.
it: Ok, ma perché proprio la base 2? Visto che un bit può essere solo 0 o 1, è molto facile rappresentarlo: può essere "ON" o "OFF", vuoto o pieno, ecc! Se ad esempio si vuole creare una memoria da un bit basta prendere una scatola: se è vuota allora simboleggia uno 0; se contiene *qualcosa*, allora è un 1. I computer manipolano quindi principalmente numeri binari e questo ha *molte* implicazioni, come vedremo nel corso di questo tutorial.

source: ## Hexadecimal
it: ## Esadecimale

source: To recap, decimal isn't practical for a computer to work with, instead relying on binary (base 2) numbers. Okay, but binary is really impractical to work with. Take %10000000000, aka 2048; when in decimal only 4 digits are required, binary instead needs 12! And, did you notice that I actually wrote one zero too few? Fortunately, hexadecimal is here to save the day! 🦸
it: Ricapitolando: il decimale non è pratico per i computer, che si affidano invece ai numeri binari (base 2). Ok, ma il binario è davvero difficile da usare per noi programmatori. Prendiamo %10000000000, ovvero 2048; mentre per scriverlo in decimale bastano solo 4 cifre, in binario ne servono 12! E probabilmente non avete neanche notato che ho scritto uno zero di troppo! Per fortuna arriva l'esadecimale a salvare la situazione! 🦸

source: Base 16 works just the same as every other base, but with 16 digits, called *nibbles*: 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, A, B, C, D, E, and F.
it: La base 16 funziona esattamente come tutte le altre basi, ma con 16 cifre (chiamate "*nibbles*" in inglese): 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, A, B, C, D, E, ed F.

source: Like binary, we will use a prefix to denote hexadecimal, namely `$`. So, 42 = $2A, and 1024 = $400. This is *much* more compact than binary, and slightly more than decimal, too; but what makes hexadecimal very interesting is that one nibble corresponds *exactly* to 4 bits!
it: Come per il binario useremo un prefisso per indicare l'esadecimale, cioè `$`. Quindi, 42 = $2A e 1024 = $400. Questo è *molto* più compatto del binario, e anche un po' più del decimale; ma ciò che rende l'esadecimale molto interessante è che una sua cifra corrisponde *esattamente* a 4 bit!

source: Nibble | Bits :------:|:----: $0 | %0000 $1 | %0001 $2 | %0010 $3 | %0011 $4 | %0100 $5 | %0101 $6 | %0110 $7 | %0111 $8 | %1000 $9 | %1001 $A | %1010 $B | %1011 $C | %1100 $D | %1101 $E | %1110 $F | %1111
it: Hex | Bin :------:|:----: $0 | %0000 $1 | %0001 $2 | %0010 $3 | %0011 $4 | %0100 $5 | %0101 $6 | %0110 $7 | %0111 $8 | %1000 $9 | %1001 $A | %1010 $B | %1011 $C | %1100 $D | %1101 $E | %1110 $F | %1111

source: This makes it very easy to convert between binary and hexadecimal, while retaining a compact enough notation. Thus, hexadecimal is used a lot more than binary. And, don't worry, decimal can still be used 😜
it: Ciò rende facilissimo convertire tra binario ed esadecimale, e mantenere una notazione sufficientemente compatta. Per questo, l'esadecimale è molto più utilizzato del binario. E non preoccuparti, puoi ancora usare il decimale 😜

source: (Side note: one could point that octal, i.e. base 8, would also work for this; however, we will primarily deal with units of 8 bits, for which hexadecimal works much better than octal. RGBDS supports octal via the `&` prefix, but I have yet to see it used.)
it: (Nota: si potrebbe pensare che anche l'ottale, cioè la base 8, funzioni altrettanto bene; tuttavia avremo a che fare perlopiù con unità di 8 bit, per le quali l'esadecimale funziona molto meglio dell'ottale. Volendo, RGBDS permette di usare l'ottale tramite il prefisso `&`, ma non l'ho mai visto usare nella pratica)

source: If you're having trouble converting between decimal and binary/hexadecimal, check if your favorite calculator program doesn't have a "programmer" mode, or a way to convert between bases.
it: Se vi è difficile convertire i numeri tra le diverse basi, controllate se la vostra calcolatrice ha una modalità "programmatore" o un altro modo per convertire i numeri: la maggior parte delle calcolatrici lo ha.

source: ## Summary
it: ## Riepilogo

source: - In RGBDS assembly, the hexadecimal prefix is `$`, and the binary prefix is `%`. - Hexadecimal can be used as a "compact binary" notation. - Using binary or hexadecimal is useful when individual bits matter; otherwise, decimal works just as well. - For when numbers get a bit too long, RGBASM allows underscores between digits (`123_465`, `%10_1010`, `$DE_AD_BE_EF`, etc.)
it: - Nell'assembly RGBDS, il prefisso esadecimale è `$`, mentre il prefisso binario è `%`. - L'esadecimale può essere usato come notazione "binaria compatta". - L'uso del binario o dell'esadecimale è utile quando i singoli bit sono importanti; altrimenti, il decimale va comunque bene. - Nei casi in cui i numeri iniziano a diventare troppo lunghi, RGBASM consente di inserire dei trattini bassi tra le cifre (`123_465`, `%10_1010`, `$DE_AD_BE_EF`, ecc.).

source: # Registers
it: # Registri

source: Alright! Now that we know what bits are, let's talk about how they're used. Don't worry, this is mostly prep work for the next section, where we will—finally!—look at the code 👀
it: Bene! Ora che sappiamo cosa sono i bit, cerchiamo di capire come si usano. Non ti preoccupare, tutto questo è per lo più in preparazione alla prossima parte, dove ci butteremo finalmente nel codice vero e proprio 👀

source: First, if you opened BGB, you have been greeted with just the Game Boy screen. So, it's time we pop the debugger open! Right-click the screen, select "Other", and click "Debugger". Oh, and while we're at this, we might as well increase the screen size a little.
it: Per iniziare, se hai già provato ad aprire BGB ti sarà comparso solo lo schermo del GameBoy. È ora di aprire il debugger! Apri il menu facendo clic destro sullo schermo, vai su "Other", e scegli "Debugger". Ah, e già che ci siamo potremmo anche aumentare un po' le dimensioni della finestra.

source: <img src="../assets/vid/debugger.gif" alt="Video demonstration in BGB"> </video>
it: <img src="../assets/vid/debugger.gif" alt="Video di dimostrazione in BGB"> </video>

source: The debugger may look intimidating at first, but don't worry, soon we'll be very familiar with it! For now, let's focus on this small box near the top-right, the *register viewer*.
it: Il debugger potrebbe sembrare incomprensibile all'inizio, ma non ti preoccupare: ti ci abituerai in fretta! Per il momento guarda in alto a destra, dove c'è un piccolo spazio intitolato _register viewer_ (visualizzatore dei registri).

source: ![Picture of the register viewer's location](../assets/img/reg_viewer.png)
it: ![Immagine della posizione del visualizzatore di registri](../assets/img/reg_viewer.png)

source: The register viewer shows both *CPU registers* and some *hardware registers*. This lesson will only deal with CPU registers, so that's why we will be ignoring some of these entries here.
it: Il visualizzatore mostra sia i _registri della CPU_ che alcuni _registri hardware_. In questa lezione parleremo solo dei registri della CPU, perciò non ti preoccupare se salteremo alcuni nomi.

source: What are CPU registers? Well, imagine you're preparing a cake. You will be following a recipe, whose instructions may be "melt 125g of chocolate and 125g of butter, blend with 2 eggs" and so on. You will fetch some ingredients from the fridge as needed, but you don't cook inside the fridge; for that, you have a small workspace.
it: Ma cosa sono questi registri della CPU? Ti faccio un esempio: immagina di star preparando una torta. Ovviamente avrai una ricetta da seguire, come ad esempio "sciogli 125g di cioccolato e 125g di burro, mescola il tutto con due uova" e così via. Dopo aver preso gli ingredienti, non li usi direttamente nel frigo; per comodità, li prenderai e li metterai su un banco da lavoro o un tavolo dove lavorarci più facilmente.
