Repository: c-fst/gb-asm-tutorial
Catalog: po/*.po
Languages: it

source: Unlike with the tilemap, there's no position conversions to do here, just straight comparisons. However, for these, we will need [the *carry* flag](../part1/operations.md#flags). The carry flag is notated as `C`, like how the zero flag is notated as `Z`, but don't confuse it with the `c` register!
it: A differenza di quanto accade con la mappa di piastrelle, qui non è necessario effettuare conversioni di posizione, ma solo confronti diretti. Tuttavia, per questi ultimi, avremo bisogno [del flag *carry*](../part1/operations.md#flags). Il flag di riporto è indicato con `C`, come il flag di zero è indicato con `Z`, ma non bisogna confonderlo con il registro `c`!

source: ::: tip A refresher on comparisons
it: ::: consiglio Un ripasso sui confronti

source: Just like `Z`, you can use the carry flag to jump conditionally. However, while `Z` is used to check if two numbers are equal, `C` can be used to check if a number is greater than or smaller than another one. For example, `cp a, b` sets `C` if `a < b`, and clears it if `a >= b`. (If you want to check `a <= b` or `a > b`, you can use `Z` and `C` in tandem with two `jp` instructions.)
it: Proprio come `Z`, è possibile utilizzare il flag di riporto per saltare in modo condizionato. Tuttavia, mentre `Z` viene utilizzato per verificare se due numeri sono uguali, `C` può essere utilizzato per verificare se un numero è maggiore o minore di un altro. Per esempio, `cp a, b` imposta `C` se `a < b`, and clears it if `a >= b`. (Se si vuole verificare `a <= b` or `a > b`, si possono usare `Z` e `C` in tandem con due istruzioni `jp`).

source: Armed with this knowledge, let's work through the paddle bounce code: ```rgbasm,linenos,start=171 ; First, check if the ball is low enough to bounce off the paddle. ld a, [_OAMRAM] ld b, a ld a, [_OAMRAM + 4] cp a, b jp nz, PaddleBounceDone ; If the ball isn't at the same Y position as the paddle, it can't bounce. ; Now let's compare the X positions of the objects to see if they're touching. ld a, [_OAMRAM + 5] ; Ball's X position. ld b, a ld a, [_OAMRAM + 1] ; Paddle's X position. sub a, 8 cp a, b jp c, PaddleBounceDone add a, 8 + 16 ; 8 to undo, 16 as the width. cp a, b jp nc, PaddleBounceDone
it: Armati di queste conoscenze, analizziamo il codice del rimbalzo della racchetta: ``rgbasm,linenos,start=171 ; Per prima cosa, si controlla se la palla è abbastanza bassa da rimbalzare sulla racchetta. ld a, [_OAMRAM] ld b, a ld a, [_OAMRAM + 4] cp a, b jp nz, PaddleBounceDone ; Se la palla non si trova nella stessa posizione Y della paletta, non può rimbalzare. Ora confrontiamo le posizioni X degli oggetti per vedere se si toccano. ld a, [_OAMRAM + 5] ; Posizione X della palla. ld b, a ld a, [_OAMRAM + 1] ; Posizione X della pagaia. sub a, 8 cp a, b jp c, PaddleBounceDone add a, 8 + 16 ; 8 da annullare, 16 come larghezza. cp a, b jp nc, PaddleBounceDone

source: The Y position's check is simple, since our paddle is flat. However, the X position has two checks which widen the area the ball can bounce on. First we add 16 to the ball's position; if the ball is more than 16 pixels to the right of the paddle, it shouldn't bounce. Then we undo this by subtracting 16, and while we're at it, subtract another 8 pixels; if the ball is more than 8 pixels to the left of the paddle, it shouldn't bounce.
it: Il controllo della posizione Y è semplice, poiché la nostra racchetta è piatta. Tuttavia, la posizione X ha due controlli che ampliano l'area in cui la palla può rimbalzare. Innanzitutto aggiungiamo 16 alla posizione della pallina; se la pallina si trova a più di 16 pixel a destra della racchetta, non dovrebbe rimbalzare. Poi annulliamo questa operazione sottraendo 16 e, già che ci siamo, sottraiamo altri 8 pixel; se la palla si trova a più di 8 pixel a sinistra della racchetta, non dovrebbe rimbalzare.

source: <svg viewBox="-10 -10 860 520"> <style> text { text-anchor: middle; fill: var(--fg); font-size: 20px; } .left { text-anchor: start; } .right { text-anchor: end; } .grid { stroke: var(--fg); opacity: 0.7; } .ball { stroke: teal; } .paddle { stroke: orange; } .excl { stroke: red; } text.excl { stroke: initial; fill: red; font-family: "Source Code Pro", Consolas, "Ubuntu Mono", Menlo, "DejaVu Sans Mono", monospace, monospace !important; } /* Overlays */ rect, polyline { opacity: 0.5; stroke-width: 3; } /* Arrow */ polygon { stroke: inherit; fill: var(--bg); } use + line { stroke-dasharray: 0 32 999; stroke-width: 2; } </style> <defs> <polygon id="arrow-head" points="0,0 -40,-16 -32,0 -40,16" stroke="context-stroke"/> <pattern id="ball-hatched" viewBox="0 0 4 4" width="8" height="8" patternUnits="userSpaceOnUse"> <line x1="5" y1="-1" x2="-1" y2="5" class="ball"/> <line x1="5" y1="3" x2="3" y2="5" class="ball"/> <line x1="1" y1="-1" x2="-1" y2="1" class="ball"/> </pattern> <pattern id="paddle-hatched" viewBox="0 0 4 4" width="8" height="8" patternUnits="userSpaceOnUse"> <line x1="5" y1="-1" x2="-1" y2="5" class="paddle"/> <line x1="5" y1="3" x2="3" y2="5" class="paddle"/> <line x1="1" y1="-1" x2="-1" y2="1" class="paddle"/> </pattern> <pattern id="excl-hatched" viewBox="0 0 4 4" width="8" height="8" patternUnits="userSpaceOnUse"> <line x1="5" y1="-1" x2="-1" y2="5" class="excl"/> <line x1="5" y1="3" x2="3" y2="5" class="excl"/> <line x1="1" y1="-1" x2="-1" y2="1" class="excl"/> </pattern> </defs> <image x="128" y="0" width="256" height="256" href="../assets/part2/img/ball.png"/> <rect x="128" y="0" width="32" height="32" fill="url(#ball-hatched)"/> <image x="288" y="256" width="256" height="256" href="../assets/part2/img/paddle.png"/> <rect x="288" y="256" width="32" height="32" fill="url(#paddle-hatched)"/> <line class="grid" x1="-10" y1="0" x2="850" y2="0"/> <line class="grid" x1="-10" y1="32" x2="850" y2="32"/> <line class="grid" x1="-10" y1="64" x2="850" y2="64"/> <line class="grid" x1="-10" y1="96" x2="850" y2="96"/> <line class="grid" x1="-10" y1="128" x2="850" y2="128"/> <line class="grid" x1="-10" y1="160" x2="850" y2="160"/> <line class="grid" x1="-10" y1="192" x2="850" y2="192"/> <line class="grid" x1="-10" y1="224" x2="850" y2="224"/> <line class="grid" x1="-10" y1="256" x2="850" y2="256"/> <line class="grid" x1="-10" y1="288" x2="850" y2="288"/> <line class="grid" x1="-10" y1="320" x2="850" y2="320"/> <line class="grid" x1="-10" y1="352" x2="850" y2="352"/> <line class="grid" x1="0" y1="-20" x2="0" y2="351"/> <line class="grid" x1="32" y1="-20" x2="32" y2="351"/> <line class="grid" x1="64" y1="-20" x2="64" y2="351"/> <line class="grid" x1="96" y1="-20" x2="96" y2="351"/> <line class="grid" x1="128" y1="-20" x2="128" y2="351"/> <line class="grid" x1="160" y1="-20" x2="160" y2="351"/> <line class="grid" x1="192" y1="-20" x2="192" y2="351"/> <line class="grid" x1="224" y1="-20" x2="224" y2="351"/> <line class="grid" x1="256" y1="-20" x2="256" y2="351"/> <line class="grid" x1="288" y1="-20" x2="288" y2="351"/> <line class="grid" x1="320" y1="-20" x2="320" y2="351"/> <line class="grid" x1="352" y1="-20" x2="352" y2="351"/> <line class="grid" x1="384" y1="-20" x2="384" y2="351"/> <line class="grid" x1="416" y1="-20" x2="416" y2="351"/> <line class="grid" x1="448" y1="-20" x2="448" y2="351"/> <line class="grid" x1="480" y1="-20" x2="480" y2="351"/> <line class="grid" x1="512" y1="-20" x2="512" y2="351"/> <line class="grid" x1="544" y1="-20" x2="544" y2="351"/> <line class="grid" x1="576" y1="-20" x2="576" y2="351"/> <line class="grid" x1="608" y1="-20" x2="608" y2="351"/> <line class="grid" x1="640" y1="-20" x2="640" y2="351"/> <line class="grid" x1="672" y1="-20" x2="672" y2="351"/> <line class="grid" x1="704" y1="-20" x2="704" y2="351"/> <line class="grid" x1="736" y1="-20" x2="736" y2="351"/> <line class="grid" x1="768" y1="-20" x2="768" y2="351"/> <line class="grid" x1="800" y1="-20" x2="800" y2="351"/> <line class="grid" x1="832" y1="-20" x2="832" y2="351"/> <rect x="128" y="0" width="256" height="256" class="ball" style="fill: none;"/> <polyline points="288,352 288,256 544,256 544,352" class="paddle" style="fill: none;"/> <rect x="-15" y="-15" width="47" height="440" class="excl" fill="url(#excl-hatched)"/> <text x="40" y="430" class="excl left">jp c, DoNotBounce</text> <rect x="800" y="-15" width="52" height="510" class="excl" fill="url(#excl-hatched)"/> <text x="790" y="500" class="excl right">jp nc, DoNotBounce</text> <use href="#arrow-head" x="48" y="380" transform="rotate(-180,48,380)" class="paddle"/><line x1="48" y1="380" x2="304" y2="380" class="paddle"/> <text x="176" y="400">- 8</text> <use href="#arrow-head" x="304" y="450" class="paddle"/><line x1="304" y1="450" x2="48" y2="450" class="paddle"/> <use href="#arrow-head" x="816" y="450" class="paddle"/><line x1="816" y1="450" x2="304" y2="450" class="paddle"/> <text x="432" y="470">+ 8 + 16</text> </svg>
it: <svg viewBox="-10 -10 860 520"> <style> text { text-anchor: middle; fill: var(--fg); font-size: 20px; } .left { text-anchor: start; } .right { text-anchor: end; } .grid { stroke: var(--fg); opacity: 0.7; } .ball { stroke: verde acqua; } .paddle { stroke: orange; } .excl { stroke: red; } text.excl { stroke: initial; fill: red; font-family: "Source Code Pro", Consolas, "Ubuntu Mono", Menlo, "DejaVu Sans Mono", monospace, monospace !important; } /* Sovrapposizioni */ rect, polyline { opacity: 0.5; stroke-width: 3; } /* Freccia */ poligono { stroke: inherit; fill: var(--bg); } uso + linea { stroke-dasharray: 0 32 999; larghezza tratto: 2; } </style> <defs> <polygon id="arrow-head" points="0,0 -40,-16 -32,0 -40,16" stroke="context-stroke"/> <pattern id="ball-hatched" viewBox="0 0 4 4" width="8" height="8" patternUnits="userSpaceOnUse"> <line x1="5" y1="-1" x2="-1" y2="5" class="ball"/> <line x1="5" y1="3" x2="3" y2="5" class="ball"/> <line x1="1" y1="-1" x2="-1" y2="1" class="ball"/> </pattern> <pattern id="paddle-hatched" viewBox="0 0 4 4" width="8" height="8" patternUnits="userSpaceOnUse"> <line x1="5" y1="-1" x2="-1" y2="5" class="paddle"/> <line x1="5" y1="3" x2="3" y2="5" class="paddle"/> <line x1="1" y1="-1" x2="-1" y2="1" class="paddle"/> </pattern> <pattern id="excl-hatched" viewBox="0 0 4 4" width="8" height="8" patternUnits="userSpaceOnUse"> <line x1="5" y1="-1" x2="-1" y2="5" class="excl"/> <line x1="5" y1="3" x2="3" y2="5" class="excl"/> <line x1="1" y1="-1" x2="-1" y2="1" class="excl"/> </pattern> </defs> <image x="128" y="0" width="256" height="256" href="../assets/part2/img/ball.png"/> <rect x="128" y="0" width="32" height="32" fill="url(#ball-hatched)"/> <image x="288" y="256" width="256" height="256" href="../assets/part2/img/paddle.png"/> <rect x="288" y="256" width="32" height="32" fill="url(#paddle-hatched)"/> <line class="grid" x1="-10" y1="0" x2="850" y2="0"/> <line class="grid" x1="-10" y1="32" x2="850" y2="32"/> <line class="grid" x1="-10" y1="64" x2="850" y2="64"/> <line class="grid" x1="-10" y1="96" x2="850" y2="96"/> <line class="grid" x1="-10" y1="128" x2="850" y2="128"/> <line class="grid" x1="-10" y1="160" x2="850" y2="160"/> <line class="grid" x1="-10" y1="192" x2="850" y2="192"/> <line class="grid" x1="-10" y1="224" x2="850" y2="224"/> <line class="grid" x1="-10" y1="256" x2="850" y2="256"/> <line class="grid" x1="-10" y1="288" x2="850" y2="288"/> <line class="grid" x1="-10" y1="320" x2="850" y2="320"/> <line class="grid" x1="-10" y1="352" x2="850" y2="352"/> <line class="grid" x1="0" y1="-20" x2="0" y2="351"/> <line class="grid" x1="32" y1="-20" x2="32" y2="351"/> <line class="grid" x1="64" y1="-20" x2="64" y2="351"/> <line class="grid" x1="96" y1="-20" x2="96" y2="351"/> <line class="grid" x1="128" y1="-20" x2="128" y2="351"/> <line class="grid" x1="160" y1="-20" x2="160" y2="351"/> <line class="grid" x1="192" y1="-20" x2="192" y2="351"/> <line class="grid" x1="224" y1="-20" x2="224" y2="351"/> <line class="grid" x1="256" y1="-20" x2="256" y2="351"/> <line class="grid" x1="288" y1="-20" x2="288" y2="351"/> <line class="grid" x1="320" y1="-20" x2="320" y2="351"/> <line class="grid" x1="352" y1="-20" x2="352" y2="351"/> <line class="grid" x1="384" y1="-20" x2="384" y2="351"/> <line class="grid" x1="416" y1="-20" x2="416" y2="351"/> <line class="grid" x1="448" y1="-20" x2="448" y2="351"/> <line class="grid" x1="480" y1="-20" x2="480" y2="351"/> <line class="grid" x1="512" y1="-20" x2="512" y2="351"/> <line class="grid" x1="544" y1="-20" x2="544" y2="351"/> <line class="grid" x1="576" y1="-20" x2="576" y2="351"/> <line class="grid" x1="608" y1="-20" x2="608" y2="351"/> <line class="grid" x1="640" y1="-20" x2="640" y2="351"/> <line class="grid" x1="672" y1="-20" x2="672" y2="351"/> <line class="grid" x1="704" y1="-20" x2="704" y2="351"/> <line class="grid" x1="736" y1="-20" x2="736" y2="351"/> <line class="grid" x1="768" y1="-20" x2="768" y2="351"/> <line class="grid" x1="800" y1="-20" x2="800" y2="351"/> <line class="grid" x1="832" y1="-20" x2="832" y2="351"/> <rect x="128" y="0" width="256" height="256" class="ball" style="fill: none;"/> <polyline points="288,352 288,256 544,256 544,352" class="paddle" style="fill: none;"/> <rect x="-15" y="-15" width="47" height="440" class="excl" fill="url(#excl-hatched)"/> <text x="40" y="430" class="excl left">jp c, DoNotBounce</text> <rect x="800" y="-15" width="52" height="510" class="excl" fill="url(#excl-hatched)"/> <text x="790" y="500" class="excl right">jp nc, DoNotBounce</text> <use href="#arrow-head" x="48" y="380" transform="rotate(-180,48,380)" class="paddle"/><line x1="48" y1="380" x2="304" y2="380" class="paddle"/> <text x="176" y="400">- 8</text> <use href="#arrow-head" x="304" y="450" class="paddle"/><line x1="304" y1="450" x2="48" y2="450" class="paddle"/> <use href="#arrow-head" x="816" y="450" class="paddle"/><line x1="816" y1="450" x2="304" y2="450" class="paddle"/> <text x="432" y="470">+ 8 + 16</text> </svg>

source: ::: tip Paddle width
it: ::: punta Larghezza della paletta

source: You might be wondering why we checked 16 pixels to the right but only 8 pixels to the left. Remember that OAM positions represent the upper-*left* corner of a sprite, so the center of our paddle is actually 4 pixels to the right of the position in OAM. When you consider this, we're actually checking 12 pixels out on either side from the center of the paddle.
it: Ci si potrebbe chiedere perché abbiamo controllato 16 pixel a destra ma solo 8 pixel a sinistra. Ricordate che le posizioni OAM rappresentano l'angolo superiore*sinistro* di uno sprite, quindi il centro della nostra paletta è in realtà 4 pixel a destra della posizione in OAM. Se si considera questo, in realtà stiamo controllando 12 pixel su entrambi i lati dal centro della paletta.

source: 12 pixels might seem like a lot, but it gives some tolerance to the player in case their positioning is off. If you'd prefer to make this easier or more difficult, feel free to adjust the values!
it: 12 pixel possono sembrare molti, ma danno un po' di tolleranza al giocatore nel caso in cui il suo posizionamento sia sbagliato. Se si preferisce rendere il tutto più facile o più difficile, è possibile regolare i valori!

source: ## BONUS: tweaking the bounce height
it: ## BONUS: modifica dell'altezza di rimbalzo

source: You might notice that the ball seems to "sink" into the paddle a bit before bouncing. This is because the ball bounces when its top row of pixels aligns with the paddle's top row (see the image above). If you want, try to adjust this so that the ball bounces when its bottom row of pixels touches the paddle's top.
it: Si può notare che la pallina sembra "affondare" un po' nella paletta prima di rimbalzare. Questo perché la pallina rimbalza quando la sua riga superiore di pixel si allinea con la riga superiore della paletta (si veda l'immagine sopra). Se volete, provate a regolare questo aspetto in modo che la pallina rimbalzi quando la sua fila di pixel inferiore tocca quella superiore della paletta.

source: Hint: you can do this with just a single instruction!
it: Suggerimento: è possibile farlo con una sola istruzione!

source: <details><summary>Answer:</summary>
it: <details><summary>Risposta:</summary>

source: Alternatively, you can add `add a, 6` just after `ld a, [_OAMRAM]`.
it: In alternativa, si può aggiungere `add a, 6` subito dopo `ld a, [_OAMRAM]`.

source: In both cases, try playing with that `6` value; see what feels right!
it: In entrambi i casi, provate a giocare con il valore `6`; vedete cosa vi sembra giusto!

source: # Work in progress
it: # Lavoro in corso

source: As explained in the initial tutorial presentation, Part Ⅱ consists of us building an *Arkanoid* game. However, this is not finished yet; lessons are uploaded as they are made, so the tutorial just abruptly stops at some point. Sorry!
it: Come spiegato nella presentazione iniziale del tutorial, la Parte Ⅱ consiste nella costruzione di un gioco *Arkanoid*. Tuttavia, questo non è ancora finito; le lezioni vengono caricate man mano che vengono realizzate, quindi il tutorial si interrompe bruscamente a un certo punto. Mi dispiace!

source: Please hold tight while we are working on this, [follow us on Twitter](https://twitter.com/gbdev0) for updates, and go to the next page to find out what you can do in the meantime!
it: Tenete duro mentre ci lavoriamo, [seguiteci su Twitter](https://twitter.com/gbdev0) per gli aggiornamenti e andate alla pagina successiva per scoprire cosa potete fare nel frattempo!

source: Thank you for your patience 😊 and see you around on GBDev!
it: Grazie per la vostra pazienza 😊 e ci vediamo su GBDev!

source: # Where to go next
it: # Prossimi passi

source: Oh. Well, you've reached the end of the tutorial... And yes, as you can see, it's not finished *yet*. I'm actively working on fixing that, though, please be a little patient :)
it: Oh. Bene, siete arrivati alla fine del tutorial... E sì, come potete vedere, non è ancora finito. Stiamo lavorando attivamente per risolvere il problema, ma vi preghiamo di avere un po' di pazienza :)

source: In the meantime, the best course of action is to peruse the [resources](resources.html) in the next section, and experiment by yourself. Well, given that, it may be a good idea to [ask around](help-feedback.html) for advice. A lot of the problems and questions you will be encountering have already been solved, so others can—and will!—help you getting started faster. If you enjoyed the tutorial, please consider [contributing](https://github.com/gbdev/gb-asm-tutorial).
it: Nel frattempo, la cosa migliore da fare è consultare le [risorse](resources.html) nella prossima sezione e sperimentare da soli. Dato questo, potrebbe essere una buona idea [chiedere in giro](help-feedback.html) per avere consigli. Molti dei problemi e delle domande che incontrerete sono già stati risolti, quindi altri possono - e lo faranno - aiutarvi a iniziare più velocemente.

source: # Resources
it: # Risorse

source: A.k.a. "where to go from here".
it: Ovvero "dove andare da qui".

source: ## Help channels
it: ## Canali di aiuto

source: - [GBDev community home page](https://gbdev.io) and [chat channels](https://gbdev.io/chat).
it: - [home page della comunità GBDev](https://gbdev.io) e [canali di chat](https://gbdev.io/chat).

source: ## Other tutorials
it: ## Altri tutorial

source: - [evie's interrupts tutorial](https://eievui.ml/resources/interrupts) should help you understand how to use interrupts, and what they are useful for. - [tbsp's "Simple GB ASM examples"](https://github.com/tbsp/simple-gb-asm-examples) is a collection of ROMs, each built from a single, fairly short source file. If you found this tutorial too abstract and/or want to get your feet wet, this is a good place to go to! - [GB assembly by example](https://github.com/daid/gameboy-assembly-by-example), Daid's collection of code snippets. Consider this a continuation of the tutorial, but without explanations; it's still useful to peruse them and ask about it, they are overall good quality.
it: - [evie's interrupts tutorial](https://eievui.ml/resources/interrupts) dovrebbe aiutarvi a capire come usare gli interrupts e a cosa servono. - [Simple GB ASM examples](https://github.com/tbsp/simple-gb-asm-examples) è una raccolta di ROM, ciascuna costruita a partire da un singolo file sorgente piuttosto breve. Se avete trovato questo tutorial troppo astratto e/o volete iniziare a lavorare, questo è un buon posto dove andare! - [GB assembly by example](https://github.com/daid/gameboy-assembly-by-example), la raccolta di frammenti di codice di Daid. Consideratela una continuazione del tutorial, ma senza spiegazioni; è comunque utile consultarli e chiedere informazioni, sono nel complesso di buona qualità.

source: ## Complements
it: ## Complementi

source: Did you enjoy the tutorial or one of the above? The following should prove useful along the rest of your journey!
it: Vi è piaciuto il tutorial o uno dei precedenti? Quanto segue dovrebbe esservi utile per il resto del vostro viaggio!

source: - [RGBDS' online documentation](https://rgbds.gbdev.io/docs/) is always useful! Notably, you'll find [an instruction reference](https://rgbds.gbdev.io/docs/gbz80.7) and [the reference on RGBASM's syntax and features](https://rgbds.gbdev.io/docs/rgbasm.5). - [Pan Docs](https://gbdev.io/pandocs) are *the* reference for all Game Boy hardware. It's a good idea to consult it if you aare unsure how a register works, or if you're wondering how to do something. - [gb-optables](https://gbdev.io/gb-opcodes/optables) is a more compact instruction table, it becomes more useful when you stop needing the instructions' descriptions.
it: - La [documentazione online di RGBDS](https://rgbds.gbdev.io/docs/) è sempre utile! In particolare, troverete [un riferimento alle istruzioni](https://rgbds.gbdev.io/docs/gbz80.7) e [il riferimento alla sintassi e alle caratteristiche di RGBASM](https://rgbds.gbdev.io/docs/rgbasm.5). - I [Pan Docs](https://gbdev.io/pandocs) sono *il riferimento* per tutto l'hardware Game Boy. È una buona idea consultarlo se non si è sicuri del funzionamento di un registro o se ci si chiede come fare qualcosa. - [gb-optables](https://gbdev.io/gb-opcodes/optables) è una tabella di istruzioni più compatta, che diventa più utile quando non si ha più bisogno delle descrizioni delle istruzioni.

source: # Special Thanks
it: # Ringraziamenti speciali

source: Big thank you to [Twoflower/Triad](https://www.pouet.net/user.php?who=21982) for making the Hello World graphic.
it: Un grande ringraziamento a [Twoflower/Triad](https://www.pouet.net/user.php?who=21982) per aver realizzato la grafica di Hello World.

source: I can't thank enough Chloé and many others for their continued support.
it: Non ringrazierò mai abbastanza Chloé e molti altri per il loro continuo sostegno.

source: Thanks to the GBDev community for being so nice throughout the years.
it: Grazie alla comunità GBDev per essere stata così gentile nel corso degli anni.

source: **You are all great. Thank you so very much.**
it: **Siete tutti fantastici. Grazie mille.**

source: Thank you to the [Rust language](https://www.rust-lang.org) team for making [mdBook](https://github.com/rust-lang/mdBook), which powers this book (this honestly slick design is the stock one!!)
it: Si ringrazia il team di [Rust language](https://www.rust-lang.org) per aver realizzato [mdBook](https://github.com/rust-lang/mdBook), che alimenta questo libro (questo design, onestamente elegante, è quello di serie!!!).

source: Greets to AYCE, Phantasy, TPPDevs/RainbowDevs, Plutiedev, lft/kryo :)
it: Un saluto a AYCE, Phantasy, TPPDevs/RainbowDevs, Plutiedev, lft/kryo :)
