Repository: c-fst/gb-asm-tutorial
Catalog: po/*.po
Languages: it

source: Notice the comment above the function, explaining which registers it takes as input. This comment is important so that you know how to interface with the function; assembly has no formal parameters, so comments explaining them are even more important than with other languages. We'll see more of those as we progress.
it: Notate il commento sopra la funzione, che spiega quali registri prende in ingresso. Questo commento è importante per sapere come interfacciarsi con la funzione; l'assembly non ha parametri formali, quindi i commenti che li spiegano sono ancora più importanti che in altri linguaggi. Ne vedremo altri man mano che procediamo.

source: There are three places in the initialization code where we can use the `Memcpy` function. Find each of these copy loops and replace them with a call to `Memcpy`; for this, we use the `call` instruction. The registers serve as parameters to the function, so we'll leave them as-is.
it: Ci sono tre punti nel codice di inizializzazione in cui possiamo usare la funzione `Memcpy`. Trovate ognuno di questi cicli di copia e sostituiteli con una chiamata a `Memcpy`; per questo, utilizziamo l'istruzione `call`. I registri servono come parametri alla funzione, quindi li lasceremo così come sono.

source: <div class="table-wrapper"><table><thead><tr><th>Before</th><th>After</th></tr></thead><tbody><tr><td>
it: <div class="table-wrapper"><table><thead><tr><th>Prima di</th><th>Dopo</th></tr></thead><tbody><tr><td>

source: ```rgbasm,linenos,start=20 ; Copy the tile data ld de, Tiles ld hl, $9000 ld bc, TilesEnd - Tiles call Memcopy ```
it: ``rgbasm,linenos,start=20 ; Copia i dati delle piastrelle ld de, Tiles ld hl, $9000 ld bc, TilesEnd - Tiles call Memcopy ````

source: ```rgbasm,linenos,start=26 ; Copy the tilemap ld de, Tilemap ld hl, $9800 ld bc, TilemapEnd - Tilemap call Memcopy ```
it: ``rgbasm,linenos,start=26 ; Copia il tilemap ld de, Tilemap ld hl, $9800 ld bc, TilemapEnd - Tilemap chiama Memcopy ````

source: ```rgbasm,linenos,start=32 ; Copy the tile data ld de, Paddle ld hl, $8000 ld bc, PaddleEnd - Paddle call Memcopy ```
it: ``rgbasm,linenos,start=32 ; Copia i dati della piastrella ld de, Paddle ld hl, $8000 ld bc, PaddleEnd - Paddle call Memcopy ````

source: In the next chapter, we'll write another function, this time to read player input.
it: Nel prossimo capitolo, scriveremo un'altra funzione, questa volta per leggere gli input del giocatore.

source: # Input
it: # Ingresso

source: We have the building blocks of a game here, but we're still lacking player input. A game that plays itself isn't very much fun, so let's fix that.
it: Abbiamo le fondamenta di un gioco, ma manca ancora l'input del giocatore. Un gioco che si gioca da solo non è molto divertente, quindi cerchiamo di risolvere questo problema.

source: Paste this code below your `Main` loop. Like `Memcpy`, this is a function that can be reused from different places, using the `call` instruction.
it: Incollare questo codice sotto il ciclo `Main`. Come `Memcpy`, questa è una funzione che può essere riutilizzata da diversi punti, utilizzando l'istruzione `call`.

source: ```rgbasm,linenos,start=110 Input: ; Poll half the controller ld a, P1F_GET_BTN call .onenibble ld b, a ; B7-4 = 1; B3-0 = unpressed buttons
it: ``rgbasm,linenos,start=110 Input: ; Polling della metà del controllore ld a, P1F_GET_BTN call .onenibble ld b, a ; B7-4 = 1; B3-0 = pulsanti non premuti

source: ; Poll the other half ld a, P1F_GET_DPAD call .onenibble swap a ; A3-0 = unpressed directions; A7-4 = 1 xor a, b ; A = pressed buttons + directions ld b, a ; B = pressed buttons + directions
it: ; Eseguire il polling dell'altra metà ld a, P1F_GET_DPAD call .onenibble swap a ; A3-0 = direzioni non premute; A7-4 = 1 xor a, b ; A = pulsanti premuti + direzioni ld b, a ; B = pulsanti premuti + direzioni

source: ; And release the controller ld a, P1F_GET_NONE ldh [rP1], a
it: ; E rilasciare il controllore ld a, P1F_GET_NONE ldh [rP1], a

source: ; Combine with previous wCurKeys to make wNewKeys ld a, [wCurKeys] xor a, b ; A = keys that changed state and a, b ; A = keys that changed to pressed ld [wNewKeys], a ld a, b ld [wCurKeys], a ret
it: ; Combinare con i precedenti wCurKeys per creare wNewKeys ld a, [wCurKeys] xor a, b ; A = tasti che hanno cambiato stato e a, b ; A = tasti che sono passati a essere premuti ld [wNewKeys], a ld a, b ld [wCurKeys], a ret

source: .onenibble ldh [rP1], a ; switch the key matrix call .knownret ; burn 10 cycles calling a known ret ldh a, [rP1] ; ignore value while waiting for the key matrix to settle ldh a, [rP1] ldh a, [rP1] ; this read counts or a, $F0 ; A7-4 = 1; A3-0 = unpressed keys .knownret ret ```
it: .onenibble ldh [rP1], a ; commuta la matrice dei tasti call .knownret ; brucia 10 cicli chiamando un noto ret ldh a, [rP1] ; ignora il valore in attesa che la matrice dei tasti si stabilizzi ldh a, [rP1] ldh a, [rP1] ; questa lettura conta o a, $F0 ; A7-4 = 1; A3-0 = tasti non premuti .knownret ret ````

source: Unfortunately, reading input on the Game Boy is fairly involved (as you can see!), and it would be quite difficult to explain what this function does right now. So, I ask that you make an exception, and trust me that this function *does* read input. Alright? Good!
it: Sfortunatamente, la lettura degli input sul Game Boy è piuttosto complessa (come potete vedere!) e sarebbe piuttosto difficile spiegare cosa fa questa funzione in questo momento. Vi chiedo quindi di fare un'eccezione e di fidarvi del fatto che questa funzione legge l'input. Va bene? Bene!

source: Now that we know how to use functions, let's call the `UpdateKeys` function in our main loop to read user input. `UpdateKeys` writes the held buttons to a location in memory that we called `wCurKeys`, which we can read from after the function returns. Because of this, we only need to call `UpdateKeys` once per frame.
it: Ora che sappiamo come usare le funzioni, chiamiamo la funzione `UpdateKeys` nel nostro ciclo principale per leggere l'input dell'utente. La funzione `UpdateKeys` scrive i pulsanti tenuti in una posizione in memoria che abbiamo chiamato `wCurKeys`, da cui possiamo leggere dopo il ritorno della funzione. Per questo motivo, è sufficiente chiamare `UpdateKeys` una sola volta per ogni fotogramma.

source: This is important, because not only is it faster to reload the inputs that we've already processed, but it also means that we will always act on the same inputs, even if the player presses or releases a button mid-frame.
it: Questo è importante, perché non solo è più veloce ricaricare gli input che abbiamo già elaborato, ma significa anche che agiremo sempre sugli stessi input, anche se il giocatore preme o rilascia un pulsante a metà fotogramma.

source: First, let's set aside some room for the two variables that `UpdateKeys` will use; paste this at the end of the `main.asm`:
it: Per prima cosa, mettiamo da parte un po' di spazio per le due variabili che `UpdateKeys` utilizzerà; incollate questo alla fine del file `main.asm`:

source: Each variable must reside in RAM, and not ROM, because ROM is "Read-Only" (so you can't modify it). Additionally, each variable only needs to be one byte large, so we use `db` ("Define Byte") to reserve one byte of RAM for each.
it: Ogni variabile deve risiedere nella RAM e non nella ROM, perché la ROM è "Read-Only" (quindi non può essere modificata). Inoltre, ogni variabile deve essere grande solo un byte, quindi si usa `db` ("Define Byte") per riservare un byte di RAM a ciascuna.

source: We're going to use the `and` opcode, which we can use to set the zero flag (`z`) to the value of the bit. We can use this along with the `PADF` constants in hardware.inc to read a particular key.
it: Utilizzeremo l'opcode `and`, che può essere utilizzato per impostare il flag di zero (`z`) sul valore del bit. Possiamo usare questo insieme alle costanti `PADF` in hardware.inc per leggere un particolare tasto.

source: ```rgbasm,linenos,start=68 Main: ld a, [rLY] cp 144 jp nc, Main WaitVBlank2: ld a, [rLY] cp 144 jp c, WaitVBlank2
it: ``rgbasm,linenos,start=68 Principale: ld a, [rLY] cp 144 jp nc, Principale WaitVBlank2: ld a, [rLY] cp 144 jp c, WaitVBlank2

source: ; Check the current keys every frame and move left or right. call Input
it: ; Controlla i tasti correnti a ogni fotogramma e si sposta a sinistra o a destra. chiama Ingresso

source: ; First, check if the left button is pressed. CheckLeft: ld a, [wCurKeys] and a, PADF_LEFT jp z, CheckRight Left: ; Move the paddle one pixel to the left. ld a, [_OAMRAM + 1] dec a ; If we've already hit the edge of the playfield, don't move. cp a, 15 jp z, Main ld [_OAMRAM + 1], a jp Main
it: ; Per prima cosa, verificare se il pulsante sinistro è premuto. CheckLeft: ld a, [wCurKeys] e a, PADF_LEFT jp z, CheckRight Left: ; Spostare la racchetta di un pixel a sinistra. ld a, [_OAMRAM + 1] dec a ; Se abbiamo già toccato il bordo del campo di gioco, non muoviamoci. cp a, 15 jp z, Main ld [_OAMRAM + 1], a jp Main

source: ; Then check the right button. CheckRight: ld a, [wCurKeys] and a, PADF_RIGHT jp z, Main Right: ; Move the paddle one pixel to the right. ld a, [_OAMRAM + 1] inc a ; If we've already hit the edge of the playfield, don't move. cp a, 105 jp z, Main ld [_OAMRAM + 1], a jp Main ```
it: Quindi controllare il pulsante destro. CheckRight: ld a, [wCurKeys] e a, PADF_RIGHT jp z, Main Right: ; Spostare la racchetta di un pixel a destra. ld a, [_OAMRAM + 1] inc a ; Se abbiamo già toccato il bordo del campo di gioco, non muoviamoci. cp a, 105 jp z, Main ld [_OAMRAM + 1], a jp Main ````

source: Now, if you compile the project, you should be able to move the paddle left and right using the d-pad!! Hooray, we have the beginnings of a game!
it: Ora, se compilate il progetto, dovreste essere in grado di muovere la racchetta a destra e a sinistra usando il d-pad!!! Urrà, abbiamo l'inizio di un gioco!

source: # Collision
it: # Collisione

source: Being able to move around is great, but there's still one object we need for this game: a ball! Just like with the paddle, the first step is to create a tile for the ball and load it into VRAM.
it: Potersi muovere è fantastico, ma c'è ancora un oggetto di cui abbiamo bisogno per questo gioco: una palla! Come per la racchetta, il primo passo è creare un riquadro per la palla e caricarlo nella VRAM.

source: ## Graphics
it: ## Grafica

source: Add this to the bottom of your file along with the other graphics: ```rgbasm,linenos,start=570 Ball: dw `00033000 dw `00322300 dw `03222230 dw `03222230 dw `00322300 dw `00033000 dw `00000000 dw `00000000 BallEnd: ```
it: Aggiungete questo in fondo al file insieme agli altri elementi grafici: ```rgbasm,linenos,start=570 Ball: dw `00033000 dw `00322300 dw `03222230 dw `03222230 dw `00322300 dw `00033000 dw `000000 dw `000000 BallEnd: ```

source: Now copy it to VRAM somewhere in your initialization code, e.g. after copying the paddle's tile. ```rgbasm,linenos,start=38 ; Copy the ball tile ld de, Ball ld hl, $8010 ld bc, BallEnd - Ball call Memcopy ```
it: Ora copiatela nella VRAM da qualche parte nel codice di inizializzazione, ad esempio dopo aver copiato la piastrella della paletta. ``rgbasm,linenos,start=38 ; Copia la piastrella della palla ld de, Ball ld hl, $8010 ld bc, BallEnd - Ball chiama Memcopy ````

source: In addition, we need to initialize an entry in OAM, following the code that initializes the paddle. ```rgbasm,linenos,start=52 ; Initialize the paddle sprite in OAM ld hl, _OAMRAM ld a, 128 + 16 ld [hli], a ld a, 16 + 8 ld [hli], a ld a, 0 ld [hli], a ld [hli], a ; Now initialize the ball sprite ld a, 100 + 16 ld [hli], a ld a, 32 + 8 ld [hli], a ld a, 1 ld [hli], a ld a, 0 ld [hli], a ```
it: Inoltre, dobbiamo inizializzare una voce in OAM, seguendo il codice che inizializza la paletta. ``rgbasm,linenos,start=52 ; Inizializza lo sprite della racchetta in OAM ld hl, _OAMRAM ld a, 128 + 16 ld [hli], a ld a, 16 + 8 ld [hli], a ld a, 0 ld [hli], a ld [hli], a ; Ora inizializziamo lo sprite della palla ld a, 100 + 16 ld [hli], a ld a, 32 + 8 ld [hli], a ld a, 1 ld [hli], a ld a, 0 ld [hli], a ````

source: As the ball bounces around the screen its momentum will change, sending it in different directions. Let's create two new variables to track the ball's momentum in each axis: `wBallMomentumX` and `wBallMomentumY`. ```rgbasm,linenos,start=581 SECTION "Counter", WRAM0 wFrameCounter: db
it: Mentre la palla rimbalza sullo schermo, la sua quantità di moto cambierà, mandandola in direzioni diverse. Creiamo due nuove variabili per tenere traccia del momento della palla su ciascun asse: `wBallMomentumX` e `wBallMomentumY`. ``rgbasm,linenos,start=581 SECTION "Counter", WRAM0 wFrameCounter: db

source: SECTION "Input Variables", WRAM0 wCurKeys: db wNewKeys: db
it: SEZIONE "Variabili di ingresso", WRAM0 wCurKeys: db wNewKeys: db

source: SECTION "Ball Data", WRAM0 wBallMomentumX: db wBallMomentumY: db ```
it: SECTION "Ball Data", WRAM0 wBallMentumX: db wBallMomentumY: db ```

source: We will need to initialize these before entering the game loop, so let's do so right after we write the ball to OAM. By setting the X momentum to 1, and the Y momentum to -1, the ball will start out by going up and to the right. ```rgbasm,linenos,start=61 ; Now initialize the ball sprite ld a, 100 + 16 ld [hli], a ld a, 32 + 8 ld [hli], a ld a, 1 ld [hli], a ld a, 0 ld [hli], a
it: Dovremo inizializzarli prima di entrare nel ciclo di gioco, quindi lo faremo subito dopo aver scritto la palla in OAM. Impostando il momento X a 1 e il momento Y a -1, la palla comincerà ad andare verso l'alto e verso destra. ``rgbasm,linenos,start=61 ; Ora inizializzate lo sprite della palla ld a, 100 + 16 ld [hli], a ld a, 32 + 8 ld [hli], a ld a, 1 ld [hli], a ld a, 0 ld [hli], a

source: ; The ball starts out going up and to the right ld a, 1 ld [wBallMomentumX], a ld a, -1 ld [wBallMomentumY], a ```
it: La palla inizia ad andare verso l'alto e verso destra ld a, 1 ld [wBallMomentumX], a ld a, -1 ld [wBallMomentumY], a ````

source: ## Prep work
it: ## Lavoro di preparazione

source: Now for the fun part! Add a bit of code at the beginning of your main loop that adds the momentum to the OAM positions. Notice that since this is the second OAM entry, we use `+ 4` for Y and `+ 5` for X. This can get pretty confusing, but luckily we only have two objects to keep track of. In the future, we'll go over a much easier way to use OAM. ```rgbasm,linenos,start=90 Main: ld a, [rLY] cp 144 jp nc, Main WaitVBlank2: ld a, [rLY] cp 144 jp c, WaitVBlank2
it: Ora la parte divertente! Aggiungete un po' di codice all'inizio del ciclo principale che aggiunge il momento alle posizioni OAM. Notate che, essendo questa la seconda voce OAM, usiamo `+ 4` per Y e `+ 5` per X. Questo può creare molta confusione, ma per fortuna abbiamo solo due oggetti da tenere sotto controllo. In futuro, vedremo un modo molto più semplice di usare OAM. ``rgbasm,linenos,start=90 Main: ld a, [rLY] cp 144 jp nc, Main WaitVBlank2: ld a, [rLY] cp 144 jp c, WaitVBlank2

source: ; Add the ball's momentum to its position in OAM. ld a, [wBallMomentumX] ld b, a ld a, [_OAMRAM + 5] add a, b ld [_OAMRAM + 5], a
it: Aggiungere la quantità di moto della palla alla sua posizione in OAM. ld a, [wBallMomentumX] ld b, a ld a, [_OAMRAM + 5] add a, b ld [_OAMRAM + 5], a

source: You might want to compile your game again to see what this does. If you do, you should see the ball moving around, but it will just go through the walls and then fly offscreen.
it: Si consiglia di compilare nuovamente il gioco per vedere cosa fa. Se lo fate, dovreste vedere la palla muoversi, ma passerà attraverso i muri e poi volerà fuori dallo schermo.

source: To fix this, we need to add collision detection so that the ball can bounce around. We'll need to repeat the collision check a few times, so we're going to make use of two functions to do this.
it: Per risolvere questo problema, dobbiamo aggiungere il rilevamento delle collisioni, in modo che la palla possa rimbalzare. Dovremo ripetere il controllo delle collisioni un paio di volte, quindi utilizzeremo due funzioni per farlo.

source: Please do not get stuck on the details of this next function, as it uses some techniques and instructions we haven't discussed yet. The basic idea is that it converts the position of the sprite to a location on the tilemap. This way, we can check which tile our ball is touching so that we know when to bounce!
it: Non perdetevi nei dettagli di questa funzione, perché utilizza alcune tecniche e istruzioni che non abbiamo ancora discusso. L'idea di base è che converte la posizione dello sprite in una posizione sulla mappa delle piastrelle. In questo modo, possiamo controllare quale piastrella sta toccando la nostra palla, in modo da sapere quando rimbalzare!

source: ```rgbasm,linenos,start=226 ; Convert a pixel position to a tilemap address ; hl = $9800 + X + Y * 32 ; @param b: X ; @param c: Y ; @return hl: tile address GetTileByPixel: ; First, we need to divide by 8 to convert a pixel position to a tile position. ; After this we want to multiply the Y position by 32. ; These operations effectively cancel out so we only need to mask the Y value. ld a, c and a, %11111000 ld l, a ld h, 0 ; Now we have the position * 8 in hl add hl, hl ; position * 16 add hl, hl ; position * 32 ; Convert the X position to an offset. ld a, b srl a ; a / 2 srl a ; a / 4 srl a ; a / 8 ; Add the two offsets together. add a, l ld l, a adc a, h sub a, l ld h, a ; Add the offset to the tilemap's base address, and we are done! ld bc, $9800 add hl, bc ret ```
it: ``rgbasm,linenos,start=226 ; Converte una posizione pixel in un indirizzo tilemap ; hl = $9800 + X + Y * 32 ; @param b: X ; @param c: Y ; @return hl: indirizzo della piastrella GetTileByPixel: ; Per prima cosa, dobbiamo dividere per 8 per convertire la posizione di un pixel in una posizione di una piastrella. ; Dopo di ciò, vogliamo moltiplicare la posizione Y per 32. Queste operazioni si annullano di fatto, quindi è necessario mascherare solo il valore Y. ld a, c e a, %11111000 ld l, a ld h, 0 ; Ora abbiamo la posizione * 8 in hl add hl, hl ; posizione * 16 add hl, hl ; posizione * 32 ; Convertire la posizione X in un offset. ld a, b srl a ; a / 2 srl a ; a / 4 srl a ; a / 8 ; Sommare i due offset. add a, l ld l, a adc a, h sub a, l ld h, a ; Aggiungete l'offset all'indirizzo base della tilemap e il gioco è fatto! ld bc, $9800 add hl, bc ret ````

source: The next function is called `IsWallTile`, and it's going to contain a list of tiles which the ball can bounce off of. ```rgbasm,linenos,start=258 ; @param a: tile ID ; @return z: set if a is a wall. IsWallTile: cp a, $00 ret z cp a, $01 ret z cp a, $02 ret z cp a, $04 ret z cp a, $05 ret z cp a, $06 ret z cp a, $07 ret ```
it: La prossima funzione si chiama `IsWallTile` e conterrà un elenco di piastrelle su cui la palla può rimbalzare. ``rgbasm,linenos,start=258 ; @param a: ID della piastrella ; @return z: imposta se a è un muro. IsWallTile: cp a, $00 ret z cp a, $01 ret z cp a, $02 ret z cp a, $04 ret z cp a, $05 ret z cp a, $06 ret z cp a, $07 ret ````

source: This function might look a bit strange at first. Instead of returning its result in a *register*, like `a`, it returns it in [a *flag*](../part1/operations.md#flags): `Z`! If at any point a tile matches, the function has found a wall and exits with `Z` set. If the target tile ID (in `a`) matches one of the wall tile IDs, the corresponding `cp` will leave `Z` set; if so, we return immediately (via `ret z`), with `Z` set. But if we reach the last comparison and it still doesn't set `Z`, then we will know that we haven't hit a wall and don't need to bounce.
it: Questa funzione può sembrare un po' strana all'inizio. Invece di restituire il risultato in un *registro*, come `a`, lo restituisce in [un *flag*](../part1/operations.md#flags): `Z`! Se in qualsiasi punto una piastrella corrisponde, la funzione ha trovato un muro ed esce con `Z` impostato. Se l'ID della piastrella di destinazione (in `a`) corrisponde a uno degli ID delle piastrelle del muro, il corrispondente `cp` lascerà `Z` impostato; in tal caso, si ritorna immediatamente (tramite `ret z`), con `Z` impostato. Ma se, dopo aver effettuato l'ultimo confronto, `Z` non viene ancora impostato, sapremo che non abbiamo colpito un muro e non abbiamo bisogno di rimbalzare.

source: ## Putting it together
it: ## Mettere insieme

source: Time to use these new functions to add collision detection! Add the following after the code that updates the ball's position: ```rgbasm,linenos,start=112 BounceOnTop: ; Remember to offset the OAM position! ; (8, 16) in OAM coordinates is (0, 0) on the screen. ld a, [_OAMRAM + 4] sub a, 16 + 1 ld c, a ld a, [_OAMRAM + 5] sub a, 8 ld b, a call GetTileByPixel ; Returns tile address in hl ld a, [hl] call IsWallTile jp nz, BounceOnRight ld a, 1 ld [wBallMomentumY], a ```
it: È ora di usare queste nuove funzioni per aggiungere il rilevamento delle collisioni! Aggiungete quanto segue dopo il codice che aggiorna la posizione della palla: ``rgbasm,linenos,start=112 BounceOnTop: ; Ricordate di sfalsare la posizione OAM! (8, 16) in coordinate OAM è (0, 0) sullo schermo. ld a, [_OAMRAM + 4] sub a, 16 + 1 ld c, a ld a, [_OAMRAM + 5] sub a, 8 ld b, a call GetTileByPixel ; Restituisce l'indirizzo della piastrella in hl ld a, [hl] call IsWallTile jp nz, BounceOnRight ld a, 1 ld [wBallMomentumY], a ````

source: You'll see that when we load the sprite's positions, we subtract from them before calling `GetTileByPixel`. You might remember from the last chapter that OAM positions are slightly offset; that is, (0, 0) in OAM is actually completely offscreen. These `sub` instructions undo this offset.
it: Vedrete che quando carichiamo le posizioni dello sprite, le sottraiamo prima di chiamare `GetTileByPixel`. Forse ricorderete dall'ultimo capitolo che le posizioni OAM sono leggermente sfalsate; cioè, (0, 0) in OAM è in realtà completamente fuori dallo schermo. Queste istruzioni `sub` annullano questo offset.

source: However, there's a bit more to this: you might have noticed that we subtracted an extra pixel from the Y position. That's because (as the label suggests), this code is checking for a tile above the ball. We actually need to check *all four* sides of the ball so we know how to change the momentum according to which side collided, so... let's add the rest!
it: Tuttavia, c'è dell'altro: avrete notato che abbiamo sottratto un pixel in più dalla posizione Y. Questo perché (come suggerisce l'etichetta) questo codice controlla la presenza di una piastrella sopra la palla. Questo perché (come suggerisce l'etichetta), il codice controlla la presenza di una piastrella sopra la palla. In realtà abbiamo bisogno di controllare *tutti e quattro* i lati della palla, in modo da sapere come cambiare la quantità di moto a seconda del lato che si è scontrato, quindi... aggiungiamo il resto!

source: BounceOnBottom: ld a, [_OAMRAM + 4] sub a, 16 - 1 ld c, a ld a, [_OAMRAM + 5] sub a, 8 ld b, a call GetTileByPixel ld a, [hl] call IsWallTile jp nz, BounceDone ld a, -1 ld [wBallMomentumY], a BounceDone: ```
it: Rimbalzo sul fondo: ld a, [_OAMRAM + 4] sub a, 16 - 1 ld c, a ld a, [_OAMRAM + 5] sub a, 8 ld b, a call GetTileByPixel ld a, [hl] call IsWallTile jp nz, BounceDone ld a, -1 ld [wBallMomentumY], a BounceDone: ````

source: That was a lot, but now the ball bounces around your screen! There's just one last thing to do before this chapter is over, and thats ball-to-paddle collision.
it: Era molto, ma ora la palla rimbalza sullo schermo! C'è solo un'ultima cosa da fare prima della fine di questo capitolo: la collisione tra palla e paddle.

source: ## Paddle bounce
it: ## Rimbalzo della pagaia
