Repository: c-fst/gb-asm-tutorial
Catalog: po/*.po
Languages: it

source: Shoutouts to [Eievui](https://eievui.ml), [Rangi](https://github.com/Rangi42), [MarkSixtyFour](https://github.com/MarkSixtyFour), [ax6](https://github.com/aaaaaa123456789), [Baŝto](https://github.com/basxto), [bbbbbr](https://github.com/bbbbbr), and [bitnenfer](https://github.com/bitnenfer)!
it: Un saluto a [Eievui](https://eievui.ml), [Rangi](https://github.com/Rangi42), [MarkSixtyFour](https://github.com/MarkSixtyFour), [ax6](https://github.com/aaaaaa123456789), [Baŝto](https://github.com/basxto), [bbbbbr](https://github.com/bbbbbr) e [bitnenfer](https://github.com/bitnenfer)!
