Repository: c-fst/gb-asm-tutorial
Catalog: po/*.po
Languages: it

source: Finally, let's turn the screen back on, and set a [background palette](../part1/palettes.md). Rather than writing the non-descript number `%10000001` (or $81 or 129, to taste), we make use of two constants graciously provided by `hardware.inc`: `LCDCF_ON` and `LCDCF_BGON`. When written to [`rLCDC`](https://gbdev.io/pandocs/LCDC), the former causes the PPU and screen to turn back on, and the latter enables the background to be drawn. (There are other elements that could be drawn, but we are not enabling them yet.) Combining these constants must be done using `|`, the *binary "or"* operator; we'll see why later.
it: Infine, riaccendiamo lo schermo e impostiamo una [palette di sfondo](../part1/palettes.md). Invece di scrivere il numero non descritto `%10000001` (o $81 o 129, a seconda dei gusti), usiamo due costanti gentilmente fornite da `hardware.inc`: `LCDCF_ON` e `LCDCF_BGON`. Quando vengono scritte su [`rLCDC`](https://gbdev.io/pandocs/LCDC), la prima fa sì che la PPU e lo schermo si riaccendano, mentre la seconda permette di disegnare lo sfondo. (Ci sono altri elementi che potrebbero essere disegnati, ma non li abilitiamo ancora). La combinazione di queste costanti deve essere fatta usando `|`, l'operatore *binario "o "*; vedremo perché più avanti.

source: ```rgbasm,linenos,start=46 ; Turn the LCD on ld a, LCDCF_ON | LCDCF_BGON ld [rLCDC], a
it: ``rgbasm,linenos,start=46 ; Accendere l'LCD ld a, LCDCF_ON | LCDCF_BGON ld [rLCDC], a

source: ; During the first (blank) frame, initialize display registers ld a, %11100100 ld [rBGP], a
it: Durante il primo fotogramma (vuoto), inizializzare i registri del display ld a, %11100100 ld [rBGP], a

source: Done: jp Done ```
it: Fatto: jp Fatto ````

source: There's one last thing we need before we can build the ROM, and that's the graphics. We will draw the following screen:
it: C'è un'ultima cosa di cui abbiamo bisogno prima di costruire la ROM: la grafica. Disegneremo la seguente schermata:

source: ![Layout of unbricked](../assets/part2/img/tilemap.png)
it: ![Layout di unbricked](../assets/part2/img/tilemap.png)

source: In `hello-world.asm`, tile data had been written out by hand in hexadecimal; this was to let you see how the sausage is made at the lowest level, but *boy* is it impractical to write! This time, we will employ a more friendly way, which will let us write each row of pixels more easily. For each row of pixels, instead of writing [the bitplanes](../part1/tiles.md#encoding) directly, we will use a backtick (`` ` ``) followed by 8 characters. Each character defines a single pixel, intuitively from left to right; it must be one of 0, 1, 2, and 3, representing the corresponding color index in [the palette](../part1/palettes.md).
it: In `hello-world.asm', i dati delle mattonelle erano stati scritti a mano in esadecimale; questo per farvi vedere come viene fatta la salsiccia al livello più basso, ma *ragazzo* è poco pratico da scrivere! Questa volta utilizzeremo un metodo più semplice, che ci permetterà di scrivere più facilmente ogni riga di pixel. Per ogni riga di pixel, invece di scrivere direttamente [i bitplanes](../part1/tiles.md#encoding), useremo un backtick (`` ` ``) seguito da 8 caratteri. Ogni carattere definisce un singolo pixel, intuitivamente da sinistra a destra; deve essere uno tra 0, 1, 2 e 3, che rappresenta l'indice di colore corrispondente nella [tavolozza](../part1/palettes.md).

source: If the character selection isn't to your liking, you can use [RGBASM's `-g` option](https://rgbds.gbdev.io/docs/v0.5.2/rgbasm.1#g) or [`OPT g`](https://rgbds.gbdev.io/docs/v0.5.2/rgbasm.5/#Changing_options_while_assembling) to pick others. For example, `rgbasm -g '.xXO' (...)` or `OPT g.xXO` would swap the four characters to `.`, `x`, `X`, and `O` respectively.
it: Se la selezione dei caratteri non è di vostro gradimento, potete usare [l'opzione `-g` di RGBASM](https://rgbds.gbdev.io/docs/v0.5.2/rgbasm.1#g) o [`OPT g`](https://rgbds.gbdev.io/docs/v0.5.2/rgbasm.5/#Changing_options_while_assembling) per sceglierne altri. Per esempio, `rgbasm -g '.xXO' (...)` o `OPT g.xXO` scambiano i quattro caratteri rispettivamente con `.`, `x`, `X` e `O`.

source: For example:
it: Ad esempio:

source: ```rgbasm dw `01230123 ; This is equivalent to `db $55,$33` ```
it: ``rgbasm dw `01230123 ; Questo è equivalente a `db $55,$33` ```

source: You may have noticed that we are using `dw` instead of `db`; the difference between these two will be explained later. We already have tiles made for this project, so you can copy [this premade file](https://github.com/gbdev/gb-asm-tutorial/raw/master/unbricked/getting-started/tileset.asm), and paste it at the end of your code.
it: Avrete notato che stiamo usando `dw` invece di `db`; la differenza tra questi due elementi sarà spiegata più avanti. Abbiamo già delle piastrelle per questo progetto, quindi potete copiare [questo file premade](https://github.com/gbdev/gb-asm-tutorial/raw/master/unbricked/getting-started/tileset.asm) e incollarlo alla fine del vostro codice.

source: Then copy the tilemap from [this file](https://github.com/gbdev/gb-asm-tutorial/raw/master/unbricked/getting-started/tilemap.asm), and paste it after the `TilesEnd` label.
it: Quindi copiare la mappa delle piastrelle da [questo file] (https://github.com/gbdev/gb-asm-tutorial/raw/master/unbricked/getting-started/tilemap.asm) e incollarla dopo l'etichetta `TilesEnd`.

source: You can build the ROM now, by running the following commands in your terminal:
it: È possibile creare la ROM ora, eseguendo i seguenti comandi nel terminale:

source: If you run this in your emulator, you should see the following:
it: Se si esegue questa operazione nell'emulatore, si dovrebbe vedere quanto segue:

source: ![Screenshot of our game](../assets/part2/img/screenshot.png)
it: ![Schermata del nostro gioco](../assets/part2/img/screenshot.png)

source: That white square seems to be missing! You may have noticed this comment earlier, somewhere in the tile data:
it: Quel quadrato bianco sembra essere scomparso! Forse avete notato questo commento in precedenza, da qualche parte nei dati delle piastrelle:

source: ```rgbasm,linenos,start=135 dw `22322232 dw `23232323 dw `33333333 ; Paste your logo here:
it: ``rgbasm,linenos,start=135 dw `22322232 dw `23232323 dw `333333 ; Incollare qui il proprio logo:

source: The logo tiles were left intentionally blank so that you can choose your own. You can use one of the following pre-made logos, or try coming up with your own!
it: Le tessere del logo sono state lasciate intenzionalmente vuote, in modo che possiate scegliere il vostro. Potete utilizzare uno dei seguenti loghi già pronti, oppure provare a crearne uno vostro!

source: - **RGBDS Logo**
it: - Logo RGBDS**

source: ![The RGBDS Logo](../assets/part2/img/rgbds.png)
it: ![Il logo RGBDS](../assets/part2/img/rgbds.png)

source: ![A pixel-art duck](../assets/part2/img/duck.png)
it: ![Un'anatra in pixel-art](../assets/part2/img/duck.png)

source: - **Tail**
it: - **Coda**

source: ![A silhouette of a tail](../assets/part2/img/tail.png)
it: ![Sagoma di una coda](../assets/part2/img/tail.png)

source: Add your chosen logo's data (click one of the "Source" links above) after the comment, build the game again, and you should see your logo of choice in the bottom-right!
it: Aggiungete i dati del logo scelto (cliccate su uno dei link "Source" qui sopra) dopo il commento, create di nuovo il gioco e dovreste vedere il logo scelto in basso a destra!

source: # Objects
it: # Oggetti

source: The background is very useful when the whole screen should move at once, but this is not ideal for everything. For example, a cursor in a menu, NPCs and the player in a RPG, bullets in a shmup, or balls in an *Arkanoid* clone... all need to move independently of the background. Thankfully, the Game Boy has a feature that's perfect for these! In this lesson, we will talk about *objects* (sometimes called "OBJ").
it: Lo sfondo è molto utile quando l'intero schermo deve muoversi contemporaneamente, ma non è l'ideale per tutto. Ad esempio, il cursore in un menu, i PNG e il giocatore in un RPG, i proiettili in uno shmup o le palline in un clone di *Arkanoid*... devono tutti muoversi indipendentemente dallo sfondo. Fortunatamente, il Game Boy ha una funzione perfetta per queste situazioni! In questa lezione parleremo di *oggetti* (talvolta chiamati "OBJ").

source: The above description may have made you think of the term "sprite" instead of "object". The term "sprite" has a *lot* of meanings depending on context, so, to avoid confusion, this tutorial tries to use specific alternatives instead, such as *object*, *metasprite*, *actor*, etc.
it: La descrizione precedente potrebbe avervi fatto pensare al termine "sprite" invece che a "oggetto". Il termine "sprite" ha *molti* significati a seconda del contesto, quindi, per evitare confusione, questo tutorial cerca di usare alternative specifiche, come *oggetto*, *metasprite*, *attore*, ecc.

source: Each object allows drawing one or two tiles (so 8×8 or 8×16 pixels, respectively) at any on-screen position—unlike the background, where all the tiles are drawn in a grid. Therefore, an object consists of its on-screen position, a tile ID (like [with the tilemap](../part1/tilemap.md)), and some extra properties called "attributes". These extra properties allow, for example, to display the tile flipped. We'll see more about them later.
it: Ogni oggetto permette di disegnare una o due piastrelle (rispettivamente 8×8 o 8×16 pixel) in qualsiasi posizione sullo schermo, a differenza dello sfondo, dove tutte le piastrelle sono disegnate in una griglia. Pertanto, un oggetto è composto dalla sua posizione sullo schermo, da un ID tile (come [con la tilemap](../part1/tilemap.md)) e da alcune proprietà extra chiamate "attributi". Queste proprietà extra consentono, ad esempio, di visualizzare la piastrella capovolta. Ne parleremo più avanti.

source: Just like how the tilemap is stored in VRAM, objects live in a region of memory called OAM, meaning **Object Attribute Memory**. Recall from above that an object consists of: - Its on-screen position - A tile ID - The "attributes"
it: Proprio come la tilemap è memorizzata nella VRAM, gli oggetti vivono in una regione di memoria chiamata OAM, ovvero **Object Attribute Memory**. Ricordiamo che un oggetto è composto da: - La sua posizione sullo schermo - Un ID tile - Gli "attributi"

source: These are stored in 4 bytes: one for the Y coordinate, one for the X coordinate, one for the tile ID, and one for the attributes. OAM is 160 bytes long, and since 160 ∕ 4 = 40, the Game Boy stores a total of **40** objects at any given time.
it: Questi sono memorizzati in 4 byte: uno per la coordinata Y, uno per la coordinata X, uno per l'ID della piastrella e uno per gli attributi. L'OAM è lungo 160 byte e poiché 160 ∕ 4 = 40, il Game Boy memorizza un totale di **40** oggetti in qualsiasi momento.

source: There is a catch, though: an object's Y and X coordinate bytes in OAM do *not* store its on-screen position! Instead, the *on-screen* X position is the *stored* X position **minus 8**, and the *on-screen* Y position is the *stored* Y position **minus 16**. To stop displaying an object, we can simply put it off-screen, e.g. by setting its Y position to 0.
it: C'è però un problema: i byte delle coordinate Y e X di un oggetto in OAM non memorizzano la sua posizione sullo schermo! Invece, la posizione X *sullo schermo* è la posizione X *memorizzata* **meno 8**, e la posizione Y *sullo schermo* è la posizione Y *memorizzata* **meno 16**. Per interrompere la visualizzazione di un oggetto, è sufficiente metterlo fuori dallo schermo, ad esempio impostando la sua posizione Y a 0.

source: These offsets are not arbitrary! Consider an object's maximum size: 8 by 16 pixels. These offsets allow objects to be clipped by the left and top edges of the screen. The NES, for example, lacks such offsets, so you will notice that objects always disappear after hitting the left or top edge of the screen.
it: Questi offset non sono arbitrari! Si consideri la dimensione massima di un oggetto: 8 x 16 pixel. Questi offset consentono agli oggetti di essere tagliati dai bordi sinistro e superiore dello schermo. Il NES, ad esempio, non dispone di tali offset, per cui si noterà che gli oggetti scompaiono sempre dopo aver toccato il bordo sinistro o superiore dello schermo.

source: Let's discover objects by experimenting with them!
it: Scopriamo gli oggetti sperimentandoli!

source: First off, when the Game Boy is powered on, OAM is filled with a bunch of semi-random values, which may cover the screen with some random garbage. Let's fix that by first clearing OAM before enabling objects for the first time. Let's add the following just after the `CopyTilemap` loop:
it: Innanzitutto, all'accensione del Game Boy, l'OAM si riempie di valori semicasuali, che possono coprire lo schermo di spazzatura casuale. Risolviamo questo problema cancellando l'OAM prima di attivare gli oggetti per la prima volta. Aggiungiamo quanto segue subito dopo il ciclo `CopyTilemap`:

source: This is a good time to do that, since just like VRAM, the screen must be off to safely access OAM.
it: Questo è un buon momento per farlo, poiché proprio come la VRAM, lo schermo deve essere spento per accedere in modo sicuro alla OAM.

source: Once OAM is clear, we can draw an object by writing its properties.
it: Una volta che l'OAM è chiaro, possiamo disegnare un oggetto scrivendo le sue proprietà.

source: Remember that each object in OAM is 4 bytes, in the order Y, X, Tile ID, Attributes. So, the object's top-left pixel lies 128 pixels from the top of the screen, and 16 from its left. The tile ID and attributes are both set to 0.
it: Si ricordi che ogni oggetto in OAM è composto da 4 byte, nell'ordine Y, X, Tile ID, Attributi. Quindi, il pixel in alto a sinistra dell'oggetto si trova a 128 pixel dalla parte superiore dello schermo e a 16 da quella sinistra. L'ID tessera e gli attributi sono entrambi impostati a 0.

source: You may remember from the previous lesson that we're already using tile ID 0, as it's the start of our background's graphics. However, by default objects and backgrounds use a different set of tiles, at least for the first 128 IDs. Tiles with IDs 128–255 are shared by both, which is useful if you have a tile that's used both on the background and by an object.
it: Come si ricorderà dalla lezione precedente, stiamo già usando l'ID 0, che è l'inizio della grafica del nostro sfondo. Tuttavia, per impostazione predefinita, gli oggetti e gli sfondi utilizzano un insieme diverso di piastrelle, almeno per i primi 128 ID. Le mattonelle con ID 128-255 sono condivise da entrambi, il che è utile se si ha una mattonella che viene utilizzata sia dallo sfondo che da un oggetto.

source: If you press F5 in BGB to open the VRAM viewer, you should see three distinct sections.
it: Se si preme F5 in BGB per aprire il visualizzatore VRAM, si dovrebbero vedere tre sezioni distinte.

source: Because we need to load this to a different area, we'll use the address $8000 and load a graphic for our game's paddle. Let's do so right after `CopyTilemap`:
it: Poiché dobbiamo caricarla in un'area diversa, useremo l'indirizzo $8000 e caricheremo una grafica per la paletta del gioco. Lo faremo subito dopo `CopyTilemap`:

source: ```rgbasm,linenos,start=46 ; Copy the tile data ld de, Paddle ld hl, $8000 ld bc, PaddleEnd - Paddle CopyPaddle: ld a, [de] ld [hli], a inc de dec bc ld a, b or a, c jp nz, CopyPaddle ```
it: ``rgbasm,linenos,start=46 ; Copia i dati della piastrella ld de, Paddle ld hl, $8000 ld bc, PaddleEnd - Paddle CopyPaddle: ld a, [de] ld [hli], a inc de dec bc ld a, b or a, c jp nz, CopyPaddle ````

source: And don't forget to add `Paddle` to the bottom of your code.
it: E non dimenticate di aggiungere `Paddle` alla fine del codice.

source: Finally, let's enable objects and see the result. Objects must be enabled by the familiar `rLCDC` register, otherwise they just don't show up. (This is why we didn't have to clear OAM in the previous lessons.) We will also need to initialize one of the object palettes, `rOBP0`. There are actually two object palettes, but we're only going to use one.
it: Infine, abilitiamo gli oggetti e vediamo il risultato. Gli oggetti devono essere abilitati dal noto registro `rLCDC`, altrimenti non vengono visualizzati. (Questo è il motivo per cui non abbiamo dovuto cancellare l'OAM nelle lezioni precedenti). Dobbiamo anche inizializzare una delle tavolozze degli oggetti, `rOBP0`. In realtà ci sono due tavolozze di oggetti, ma ne useremo solo una.

source: ```rgbasm,linenos,start=76 ; Turn the LCD on ld a, LCDCF_ON | LCDCF_BGON | LCDCF_OBJON ld [rLCDC], a
it: ``rgbasm,linenos,start=76 ; Accendere l'LCD ld a, LCDCF_ON | LCDCF_BGON | LCDCF_OBJON ld [rLCDC], a

source: ; During the first (blank) frame, initialize display registers ld a, %11100100 ld [rBGP], a ld a, %11100100 ld [rOBP0], a ```
it: ; Durante il primo fotogramma (vuoto), inizializzare i registri di visualizzazione ld a, %11100100 ld [rBGP], a ld a, %11100100 ld [rOBP0], a ```

source: ## Movement
it: ## Movimento

source: Now that you have an object on the screen, let's move it around. Previously, the `Done` loop did nothing; let's rename it to `Main` and use it to move our object. We're going to wait for VBlank before changing OAM, just like we did before turning off the screen.
it: Ora che abbiamo un oggetto sullo schermo, spostiamolo. In precedenza, il ciclo `Done` non faceva nulla; rinominiamolo in `Main` e usiamolo per spostare il nostro oggetto. Aspetteremo VBlank prima di cambiare OAM, proprio come abbiamo fatto prima di spegnere lo schermo.

source: ```rgbasm,linenos,start=89 Main: ; Wait until it's *not* VBlank ld a, [rLY] cp 144 jp nc, Main WaitVBlank2: ld a, [rLY] cp 144 jp c, WaitVBlank2
it: ``rgbasm,linenos,start=89 Main: ; Attendere finché non è *non* VBlank ld a, [rLY] cp 144 jp nc, Main WaitVBlank2: ld a, [rLY] cp 144 jp c, WaitVBlank2

source: ; Move the paddle one pixel to the right. ld a, [_OAMRAM + 1] inc a ld [_OAMRAM + 1], a jp Main ```
it: ; Sposta la paletta di un pixel a destra. ld a, [_OAMRAM + 1] inc a ld [_OAMRAM + 1], a jp Main ````

source: Here, we are accessing OAM without turning the LCD off, but it's still safe. Explaining why requires a more thorough explanation of the Game Boy's rendering, so let's ignore it for now.
it: In questo caso, si accede all'OAM senza spegnere l'LCD, ma è comunque sicuro. Per spiegarne il motivo è necessaria una spiegazione più approfondita del rendering del Game Boy, quindi per ora ignoriamolo.

source: Now you should see the paddle moving... very quickly. Because it moves by a pixel ever frame, it's going at a speed of 60 pixels per second! To slow this down, we'll use a *variable*.
it: Ora si dovrebbe vedere la paletta muoversi... molto velocemente. Poiché si muove di un pixel per fotogramma, la velocità è di 60 pixel al secondo! Per rallentare il movimento, useremo una *variabile*.

source: So far, we have only worked with the CPU registers, but you can create global variables too! To do this, let's create another section, but putting it in `WRAM0` instead of `ROM0`. Unlike ROM ("Read-Only Memory"), RAM ("Random-Access Memory") can be written to; thus, WRAM, or Work RAM, is where we can store our game's variables.
it: Finora abbiamo lavorato solo con i registri della CPU, ma è possibile creare anche variabili globali! Per farlo, creiamo un'altra sezione, ma mettiamola in `WRAM0` invece che in `ROM0`. A differenza della ROM ("Read-Only Memory", memoria di sola lettura), la RAM ("Random-Access Memory", memoria ad accesso casuale) può essere scritta; quindi, la WRAM, o Work RAM, è il luogo in cui possiamo memorizzare le variabili del nostro gioco.

source: Add this to the bottom of your file:
it: Aggiungete questo in fondo al vostro file:

source: Now we'll use the `wFrameCounter` variable to count how many frames have passed since we last moved the paddle. Every 10th frame, we'll move the paddle by one pixel, slowing it down to 6 pixels per second. Don't forget that RAM is filled with garbage values when the Game Boy starts, so we need to initialize our variables before first using them.
it: Ora useremo la variabile `wFrameCounter` per contare quanti fotogrammi sono passati dall'ultimo spostamento della paletta. Ogni 10° fotogramma, sposteremo la racchetta di un pixel, rallentandola a 6 pixel al secondo. Non dimenticate che all'avvio del Game Boy la RAM si riempie di valori spazzatura, quindi è necessario inizializzare le variabili prima di utilizzarle.

source: ld a, [wFrameCounter] inc a ld [wFrameCounter], a cp a, 15 ; Every 15 frames (a quarter of a second), run the following code jp nz, Main
it: ld a, [wFrameCounter] inc a ld [wFrameCounter], a cp a, 15 ; Ogni 15 fotogrammi (un quarto di secondo), eseguire il seguente codice jp nz, Main

source: ; Reset the frame counter back to 0 ld a, 0 ld [wFrameCounter], a
it: ; Azzeramento del contatore di frame a 0 ld a, 0 ld [wFrameCounter], a

source: Alright! Up next is us taking control of that little paddle.
it: Bene! Il prossimo passo è prendere il controllo della paletta.

source: # Functions
it: # Funzioni

source: So far, we have only written a single "flow" of code, but we can already spot some snippets that look redundant. Let's use **functions** to "factor out" code!
it: Finora abbiamo scritto un solo "flusso" di codice, ma possiamo già individuare alcuni frammenti che sembrano ridondanti. Usiamo le **funzioni** per "sfoltire" il codice!

source: For example, in three places, we are copying chunks of memory around. Let's write a function below the `jp Main`, and let's call it `Memcpy`, like [the similar C function](https://man7.org/linux/man-pages/man3/memcpy.3.html):
it: Per esempio, in tre punti stiamo copiando pezzi di memoria. Scriviamo una funzione sotto la `jp Main` e chiamiamola `Memcpy`, come [l'analoga funzione C](https://man7.org/linux/man-pages/man3/memcpy.3.html):

source: ```rgbasm,linenos,start=93 ; Copy bytes from one area to another. ; @param de: Source ; @param hl: Destination ; @param bc: Length Memcopy: ld a, [de] ld [hli], a inc de dec bc ld a, b or a, c jp nz, Memcopy ret ```
it: ``rgbasm,linenos,start=93 ; Copia i byte da un'area all'altra. ; @param de: Sorgente ; @param hl: Destinazione ; @param bc: Lunghezza Memcopia: ld a, [de] ld [hli], a inc de dec bc ld a, b o a, c jp nz, Memcopy ret ````

source: The new `ret` instruction should immediately catch our eye. It is, unsurprisingly, what makes execution *return* to where the function was *called* from. Importantly, many languages have a definite "end" to a function: in C or Rust, that's the closing brace `}`; in Pascal or Lua, the keyword `end`, and so on; the function implicitly returns when execution reaches its end. However, **this is not the case in assembly**, so you must remember to add a `ret` instruction at the end of the function to return from it! Otherwise, the results are unpredictable.
it: La nuova istruzione `ret' dovrebbe catturare immediatamente l'attenzione. È, senza sorpresa, quella che fa sì che l'esecuzione *ritorni* al punto in cui la funzione è stata *chiamata*. È importante notare che molti linguaggi prevedono una "fine" precisa per una funzione: in C o Rust, è la parentesi graffa di chiusura `}`; in Pascal o Lua, la parola chiave `end`, e così via; la funzione ritorna implicitamente quando l'esecuzione raggiunge la sua fine. Tuttavia, **non è così in assembly**, quindi bisogna ricordarsi di aggiungere un'istruzione `ret` alla fine della funzione per ritornare da essa! Altrimenti, i risultati sono imprevedibili.
