Repository: c-fst/gb-asm-tutorial
Catalog: po/*.po
Languages: it

source: Registers are pretty much the CPU's workspace. They are small, tiny chunks of memory embedded directly in the CPU (only 10 bytes for the Game Boy's CPU, and even modern CPUs have less than a kilobyte if you don't count <a href="https://en.wikipedia.org/wiki/SIMD"><abbr title="Single Instruction, Multiple Data">SIMD</abbr></a> registers). Operations are not performed directly on data stored in memory, which would be equivalent to breaking eggs directly inside our fridge, but they are performed on registers.
it: I registri sono questo tavolo, su cui il processore poggia temporaneamente i suoi ingredienti. Più concretamente, sono dei piccoli spazi di memoria (Il GameBoy ne ha solo 10 byte, e anche le CPU moderne hanno meno di un kilobyte se non si contano i registri <a href="https://it.wikipedia.org/wiki/SIMD"><abbr title="Single Instruction, Multiple Data">SIMD</abbr></a>). Eseguire le operazioni direttamente sulla memoria è scomodo, sarebbe come rompere le uova nel frigo: per questo le spostiamo sul tavolo, i registri, prima di romperle.

source: There are exceptions to this rule, like many other "rules" I will give in this tutorial; I will paper over them to keep the mental complexity reasonable, but don't treat my word as gospel either.
it: Ovviamente ci sono eccezioni a questa regola, come un po' tutte le regole che ti spiegheremo nel tutorial; stiamo semplificando di molto le cose per mantenerle ad un livello abbastanza facile da comprendere, perciò non prendere mai queste regole troppo alla lettera.

source: ## General-purpose registers
it: ## Registri Generici

source: CPU registers can be placed into two categories: *general-purpose* and *special-purpose*. A "general-purpose" register (<abbr title="General-Purpose Register">GPR</abbr> for short) can be used for storing arbitrary integer numbers. Some GPRs are special nonetheless, as we will see later; but the distinction is "can I store arbitrary integers in it?".
it: A grandi linee ci sono due tipi di registri: _registri generici_ e _registri speciali_. Un registro generico (abbreviato <abbr title="inglese: General-Purpose Register">GPR</abbr>) può essere usato per dati di qualunque tipo. Qualche GPR ha anche delle funzioni più specifiche, come vedremo più in là; in generale per distinguerli da quelli speciali chiediti "posso inserirci dati arbitrari?".

source: I won't introduce special-purpose registers quite yet, as their purpose wouldn't make sense yet. Rather, they will be discussed as the relevant concepts are introduced.
it: Parleremo poi dei registri speciali; hanno funzioni particolari che non abbiamo ancora spiegato e perciò li spiegheremo quando parleremo della funzione specifica, visto che fino ad allora non ne capiremmo lo scopo.

source: The Game Boy CPU has seven 8-bit GPRs: `a`, `b`, `c`, `d`, `e`, `h`, and `l`. "8-bit" means that, well, they store 8 bits. Thus, they can store integers from 0 to 255 (%1111_1111 aka $FF).
it: La CPU del Game Boy ha sette GPR a 8 bit: `a`, `b`, `c`, `d`, `e`, `h` e `l`. "8 bit" significa che memorizzano 8 bit. Pertanto, possono memorizzare numeri interi da 0 a 255 (%1111_1111 alias $FF).

source: `a` is the *accumulator*, and we will see later that it can be used in special ways.
it: `a' è l'*accumulatore*, e come vedremo più avanti può essere usato in modi particolari.

source: A special feature is that these registers, besides `a`, are *paired up*, and the pairs can be treated as the 16-bit registers `bc`, `de`, and `hl`. The pairs are *not* separate from the individual registers; for example, if `d` contains 192 ($C0) and `e` contains 222 ($DE), then `de` contains 49374 ($C0DE) = 192 × 256 + 222. The other pairs work similarly.
it: Questi registri hanno un'altra caratteristica interessante; sono tutti (tranne `a`) _accoppiati_ ad un altro registro, e queste coppie possono funzionare da registri a 16 bit: `BC`, `DE`, e `HL`. Ma tieni sempre a mente che le coppie _non_ sono indipendenti dai registri che li formano; se, ad esempio, `D` contiene 192 ($C0) ed `E` 222 ($DE) allora `DE` conterrà 49374 ($C0DE) = `D × 0x100 + E`. Tutte le altre coppie funzionano allo stesso modo.

source: Modifying `de` actually modifies both `d` and `e` at the same time, and modifying either individually also affects the pair. How do we modify registers? Let's see how, with our first assembly instructions!
it: Quindi, cambiare il valore di `DE` modifica sia quello di `D` che di `E` allo stesso tempo e modificare `D` o `E` cambierà il valore della coppia `DE`. Ok, ma come facciamo a usare questi registri? È il momento di dare un'occhiata all'Assembly!

source: # Assembly basics
it: # Primi passi in Assembly

source: Alright, now that we know what the tools *do*, let's see what language RGBASM speaks. I will take a short slice of the beginning of `hello-world.asm`, so that we agree on the line numbers, and you can get some syntax highlighting even if your editor doesn't support it.
it: Bene, ora che sappiamo cosa *fanno* gli strumenti, vediamo che lingua parla RGBASM. Prenderò una breve porzione dell'inizio di `hello-world.asm`, in modo da essere d'accordo sui numeri di riga e da avere un'evidenziazione della sintassi anche se il vostro editor non la supporta.

source: ds $150 - @, 0 ; Make room for the header
it: ds $150 - @, 0 ; Lascia spazio per l'intestazione

source: EntryPoint: ; Shut down audio circuitry ld a, 0 ld [rNR52], a ```
it: EntryPoint: ; Spegnimento del circuito audio ld A, 0 ld [rNR52], A ````

source: Let's analyze it. Note that I will be ignoring a *lot* of RGBASM's functionality; if you're curious to know more, you should wait until parts II and III, or [read the docs](https://rgbds.gbdev.io/docs).
it: Analizziamolo insieme. Sappi che per il momento salteremo _molte_ delle funzionalità di RGBASM; se fossi curioso di saperne di più, dovrai aspettare fino alla seconda o terza parte oppure leggere la [documentazione](https://rgbds.gbdev.io/docs).

source: ## Comments
it: ## Commenti

source: We'll start with line 10, which should appear gray above. Semicolons `;` denote *comments*. Everything from a semicolon to the end of the line is *ignored* by RGBASM. As you can see on line 7, comments need not be on an otherwise empty line.
it: Iniziamo dalla riga 10, che dovrebbe essere grigia nel riquadro qui sopra. I punti e virgola `;` indicano un _commento_. I commenti (che finiscono alla fine della riga) sono _ignorati_ dall'assembler, indipendentemente dal contenuto. Come vedi alla riga 7, puoi anche inserire commenti dopo aver scritto altro.

source: Comments are a staple of every good programming language; they are useful to give context as to what code is doing. They're the difference between "Pre-heat the oven at 180 °C" and "Pre-heat the oven at 180 °C, any higher and the cake would burn", basically. In any language, good comments are very useful; in assembly, they play an even more important role, as many common semantic facilities are not available.
it: I commenti sono molto importanti in tutti i linguaggi di programmazione: ti aiutano a descrivere la funzione del tuo codice. È più o meno la differenza tra "scalda il forno fino a 180°C" e "scalda il forno a 180°C, se lo scaldassi di più la torta brucerebbe". I commenti sono utilissimi in ogni linguaggio di programmazione, ma in Assembly sono ancora più importanti: infatti, il codice Assembly è molto più astratto.

source: ## Instructions
it: ## Istruzioni

source: Assembly is a very line-based language. Each line can contain one of two things: - a *directive*, which instructs RGBASM to do something, or - an *instruction*[^instr_directive], which is written directly into the ROM.
it: Il codice Assembly è basato completamente su righe. Ogni riga contiene: - una _direttiva_, che dà istruzioni all'assembler, oppure - un'_istruzione_[^instr_directive], diretta al GameBoy e quindi copiata direttamente in ROM.

source: We will talk about directives later, for now let's focus on instructions: for example, in the snippet above, we will ignore lines 1 (`INCLUDE`), 7 (`ds`), and 3 (`SECTION`).
it: Parleremo delle direttive più avanti, per ora concentriamoci sulle istruzioni: per esempio, nello snippet qui sopra, ignoreremo le righe 1 (`INCLUDE`), 7 (`ds`) e 3 (`SECTION`).

source: To continue the cake-baking analogy even further, instructions are like steps in a recipe. The console's processor (<abbr title="Central Processing Unit">CPU</abbr>) executes instructions one at a time, and that... eventually does something! Like baking a cake, drawing a "Hello World" image, or displaying a Game Boy programming tutorial! \*wink\* \*wink\*
it: Per continuare l'analogia con la preparazione di una torta, le istruzioni sono come i passi di una ricetta. Il processore (<abbr title="Central Processing Unit">CPU</abbr>) esegue un'istruzione alla volta. Istruzione dopo istruzione... dopo un po' si arriva al risultato! Come cuocere una torta, disegnare "Hello World", oppure mostrarti un tutorial sull'Assembly del GameBoy!

source: Instructions have a *mnemonic*, which is a name they are given, and *operands*, which indicate what they should act upon. For example, in "melt the chocolate and butter in a saucepan", *the whole sentence* would be the instruction, *the verb* "melt" would be the mnemonic, and "chocolate", "butter", and "saucepan" the operands, i.e. some kind of parameters to the operation.
it: Le istruzioni sono composte da una _mnemonica_, un nome con cui le puoi invocare, e dei _parametri_, ovvero su cosa va eseguita l'operazione. Ad esempio: in "sciogli il cioccolato ed il burro in una padella" l'istruzione è _tutta la frase_; la mnemonica sarebbe l'_azione_, ovvero sciogli, mentre i parametri sono gli _oggetti_ della frase (cioccolato, burro, padella).

source: Let's discuss the most fundamental instruction, **`ld`**. `ld` stands for "LoaD", and its purpose is simply to copy data from its right operand (["<abbr title="Right-Hand Side">RHS</abbr>"](https://en.wikipedia.org/wiki/Sides_of_an_equation)) into its left operand (["<abbr title="Left-Hand Side">LHS</abbr>"](https://en.wikipedia.org/wiki/Sides_of_an_equation)). For example, take line 11's `ld a, 0`: it copies ("loads") the value 0 into the 8-bit register `a`[^ld_imm_from]. If you look further in the file, line 33 has `ld a, b`, which causes the value in register `b` to be copied into register `a`.
it: Cominciamo dall'istruzione più importante: **`ld`**. `ld` sta per "<abbr title="LoaD in inglese">carica</abbr>", e semplicemente copia i dati contenuti nel secondo parametro ("[<abbr title="Right-Hand Side">RHS</abbr>](https://en.wikipedia.org/wiki/Sides_of_an_equation)") nel primo ("[<abbr title="Left-Hand Side">LHS</abbr>](https://en.wikipedia.org/wiki/Sides_of_an_equation)"). Per esempio, guardiamo la riga 11 del nostro programma, `ld a, 0`: copia ("carica") il numero zero nel registro `a`[^ld_imm_from]. Per fare un altro esempio, a riga 33 troviamo `ld a, b`: significa semplicemente "copia il valore di `b` in `a`.

source: Instruction | Mnemonic | Effect ------------|----------|---------------------- Load | `ld` | Copies values around
it: Istruzione | Mnemonica | Effetto ------------|----------|---------------------- Carica | `ld` | Copia dei valori

source: Due to CPU limitations, not all operand combinations are valid for `ld` and many other instructions; we will talk about this when writing our own code later.
it: Per via delle limitazioni del processore, non tutte le combinazioni di operandi sono valide per `ld` e per molte altre istruzioni; ne parleremo in seguito, quando arriverà il momento di scrivere il nostro codice.

source: RGBDS has an [instruction reference](https://rgbds.gbdev.io/docs/gbz80.7) worth bookmarking, and you can also consult it locally with `man 7 gbz80` if RGBDS is installed on your machine (except Windows...). The descriptions there are more succinct, since they're intended as reminders, not as tutorials.
it: RGBDS ha una [lista delle istruzioni del GameBoy](https://rgbds.gbdev.io/docs/gbz80.7) che vale la pena tenere tra i preferiti, e che si può anche consultare dal terminale scrivendo `man 7 gbz80` se RGBDS è installato sulla propria macchina (tranne su Windows...). Le descrizioni che trovate in quella pagina sono più concise: sono intese come un promemoria, non come un tutorial.

source: ## Directives
it: ## Direttive

source: In a way, instructions are destined to the console's CPU, and comments are destined to the programmer. But some lines are neither, and are instead sort of metadata destined to RGBDS itself. Those are called *directives*, and our Hello World actually contains three of those.
it: Quindi, in un certo senso, le istruzioni sono destinate al processore del GameBoy mentre i commenti sono destinati al programmatore. Ma alcune righe non sono né l'una né l'altra cosa, e sono invece dei metadati destinati a RGBDS stesso. Queste sono chiamate *direttive* e il nostro "Hello World" ne contiene tre.

source: ### Including other files
it: ### Includere un altro file

source: Line 1 *includes* `hardware.inc`[^hw_inc_directives]. Including a file has the same effect as if you copy-pasted it, but without having to actually do that.
it: La riga 1 *include* `hardware.inc`[^hw_inc_directives]. `Include`ndo un file è come se copiassimo il suo contenuto alla riga dove inseriamo la direttiva.

source: It allows sharing code across files easily: for example, if two files `a.asm` and `b.asm` were to include `hardware.inc`, you would only need to modify `hardware.inc` once for the modifications to apply to both `a.asm` and `b.asm`. If you instead copy-pasted the contents manually, you would have to edit both copies in `a.asm` and `b.asm` to apply the changes, which is more tedious and error-prone.
it: Così facendo, si può riciclare facilmente il codice in diversi file: se, ad esempio, due file `a.asm` e `b.asm` includono `hardware.inc` basta modificare il file perché le modifiche si applichino ad `a.asm` e `b.asm`. Se invece copiassi a mano il contenuto di `hardware.inc` in `a.asm` e `b.asm` dovresti modificare il contenuto di entrambi ogni volta che vuoi apportare un cambiamento, che non è solo uno spreco di tempo ma aumenta la possibilità di commettere errori.

source: `hardware.inc` defines a bunch of constants related to interfacing with the hardware. Constants are basically names with a value attached, so when you write out their name, they are replaced with their value. This is useful because, for example, it is easier to remember the address of the **LCD** **C**ontrol register as `rLCDC` than `$FF40`.
it: `hardware.inc` definisce alcune costanti molto utili per interfacciarsi con l'hardware del GameBoy. Le costanti non sono altro che dei nomi a cui è assegnato un valore: scrivere una costante equivale a scrivere il valore che le è assegnato. Questo torna molto utile: è molto più semplice ricordare il registro "**LCD** **C**ontrol" (impostazioni dello schermo) col nome `rLCDC` piuttosto che ricordare l'indirizzo `$FF40`.

source: We will discuss constants in more detail in Part Ⅱ.
it: Parleremo delle costanti in modo più approfondito nella Parte Ⅱ.

source: ### Sections
it: ### Sezioni

source: Let's first explain what a "section" is, then we will see what line 3 does.
it: Spieghiamo innanzitutto che cos'è una "sezione", poi vedremo che cosa fa la riga 3.

source: A section represents a contiguous range of memory, and by default, ends up *somewhere* not known in advance. If you want to see where all the sections end up, you can ask RGBLINK to generate a "map file" with the `-m` flag:
it: Una sezione rappresenta un intervallo contiguo di memoria che, di base, finisce da *qualche* parte non nota in anticipo. Se si vuole vedere dove finisce ogni sezione si può chiedere a RGBLINK di generare un "file mappa" con l'opzione `-m`:

source: ...and we can see, for example, where the `"Tilemap"` section ended up:
it: ...e possiamo vedere, per esempio, dove è finita la sezione `"Tilemap"`:

source: Sections cannot be split by RGBDS, which is useful e.g. for code, since the processor executes instructions one right after the other (except jumps, as we will see later). There is a balance to be struck between too many and not enough sections, but it typically doesn't matter much until banking is introduced into the picture—and it won't be until much, much later.
it: Le sezioni non possono essere divise da RGBDS, che è utile ad esempio per il codice poiché il processore esegue le istruzioni una dopo l'altra (a parte con i salti, che vedremo più avanti). Va trovato il giusto equilibrio per il numero di sezioni: non troppe ma neanche troppo poche, anche se in genere non ha molta importanza fino a quando non si inizia a parlare di banche di memoria.

source: So, for now, let's just assume that one section should contain things that "go together" topically, and let's examine one of ours.
it: Quindi, per ora, assumiamo che una sezione debba contenere cose che "vanno insieme" dal punto di vista topico, ed esaminiamo una delle nostre.

source: So! What's happening here? Well, we are simply declaring a new section; all instructions and data after this line and until the next `SECTION` one will be placed in this newly-created section. Before the first `SECTION` directive, there is no "active" section, and thus generating code or data will be met with a `Cannot output data outside of a SECTION` error.
it: Quindi! Cosa fa questa riga? Altro non è che la dichiarazione di una nuova sezione; tutte le istruzioni e i dati dopo questa riga e fino alla successiva dichiarazione `SECTION` saranno inseriti in questa sezione appena creata. Prima della prima direttiva `SECTION` non c'è una sezione "attiva": scrivere dati o codice al di fuori di una sezione ci darà l'errore `Cannot output data outside of a SECTION`.

source: The new section's name is "`Header`". Section names can contain any characters (and even be empty, if you want), and must be unique[^sect_name]. The `ROM0` keyword indicates which "memory type" the section belongs to ([here is a list](https://rgbds.gbdev.io/docs/v0.5.2/rgbasm.5#SECTIONS)). We will discuss them in Part Ⅱ.
it: Il nome della nuova sezione è "`Header`". I nomi delle sezioni possono contenere qualsiasi carattere (e anche essere vuoti, se si vuole) e devono essere unici[^sect_name]. La parola chiave `ROM0` indica a quale "tipo di memoria" appartiene la sezione ([ecco un elenco](https://rgbds.gbdev.io/docs/v0.5.2/rgbasm.5#SECTIONS)). Ne parleremo nella Parte Ⅱ.

source: The `[$100]` part is more interesting, in that it is unique to this section. See, I said above that:
it: Dove dice `[100$]` invece è più interessante, perché è un'indicazione speciale per questa sezione. Se ricordi, prima abbiamo detto che:

source: > a section \[...\] by default, ends up *somewhere* not known in advance.
it: > Una sezione \[...\], di base, finisce da *qualche* parte non nota in anticipo.

source: However, some memory locations are special, and so sometimes we need a specific section to span a specific range of memory. To enable this, RGBASM provides the `[addr]` syntax, which *forces* the section's starting address to be `addr`.
it: Però alcune parti della memoria sono speciali, e quindi a volte è necessario che una sezione specifica copra un intervallo di memoria specifico. Per permetterlo, RGBASM ha la sintassi `[addr]` che *forza* l'indirizzo iniziale della sezione a essere `addr`.

source: In this case, the memory range $100–$14F is special, as it is the *ROM's header*. We will discuss the header in a couple lessons, but for now, just know that we need not to put any of our code or data in that space. How do we do that? Well, first, we begin a section at address $100, and then we need to reserve some space.
it: In questo caso, l'intervallo di memoria $100-$14F è speciale perché è l'intestazione della ROM. Parleremo dell'intestazione tra un paio di lezioni, ma per il momento basta sapere che **non** dobbiamo inserire né codice né dati in quello spazio. E come facciamo? Innanzitutto, iniziamo una sezione all'indirizzo $100 e poi dobbiamo riservare un po' di spazio.

source: ### Reserving space
it: ### Lasciare spazio

source: ds $150 - @, 0 ; Make room for the header ```
it: ds $150 - @, 0 ; Fa spazio per l'intestazione ```

source: Line 7 claims to "Make room for the header", which I briefly mentioned just above. For now, let's focus on what `ds` actually does.
it: La riga 7 afferma di "fare spazio per l'intestazione", di cui ho parlato brevemente poco sopra. Per ora, concentriamoci su ciò che `ds` fa effettivamente.

source: `ds` is used for *statically* allocating memory. It simply reserves some amount of bytes, which are set to a given value. The first argument to `ds`, here `$150 - @`, is *how many bytes to reserve*. The second (optional) argument, here `0`, is *what value to set each reserved byte to*[^ds_pattern].
it: `ds` è usato per allocare *staticamente* della memoria. Riserva un certo numero di byte, che sono impostati ad un certo valore dato. Il primo argomento di `ds`, in questo caso `$150 - @`, è *quanti byte riservare*. Il secondo argomento (che è opzionale), in questo caso `0`, è *il valore a cui impostare ogni byte riservato*[^ds_pattern].

source: We will see why these bytes must be reserved in a couple of lessons.
it: Vedremo perché questi byte devono essere riservati in un paio di lezioni.

source: It is worth mentioning that this first argument here is an *expression*. RGBDS (thankfully!) supports arbitrary expressions essentially anywhere. This expression is a simple subtraction: $150 minus `@`, which is a special symbol that stands for "the current memory address".
it: È importante notare che il primo argomento è un'*espressione*. RGBDS (fortunatamente!) supporta l'inserimento di espressioni arbitrarie pressoché ovunque. Quest'espressione è una semplice sottrazione: $150 meno `@`, che è un simbolo speciale che sta per "l'indirizzo in memoria attuale".

source: A symbol is essentially "a name attached to a value", usually a number. We will explore the different types of symbols throughout the tutorial, starting with labels in the next section.
it: Un simbolo è essenzialmente "un nome associato a un valore", di solito un numero. Nel corso dell'esercitazione esploreremo i diversi tipi di simboli, a partire dalle etichette nella prossima sezione.

source: A numerical symbol used in an expression evaluates to its value, which must be known when compiling the ROM—in particular, it can't depend on any register's contents.
it: Un simbolo numerico utilizzato in un'espressione viene sostituito dal suo valore, che dev'essere noto al momento della compilazione della ROM; in particolare, non può dipendere dal contenuto di alcun registro.

source: Oh, but you may be wondering what the "memory addresses" I keep mentioning are. Let's see about those!
it: Ma vi potreste stare chiedendo cosa siano questi "indirizzi di memoria" di cui continuo a parlare. Vediamo subito!

source: [^instr_directive]: Technically, instructions in RGBASM are implemented as directives, basically writing their encoded form to the ROM; but the distinction between the instructions in the source code and those in the final ROM is not worth bringing up right now.
it: [^instr_directive]: Tecnicamente le istruzioni in RGBASM sono implementate come direttive, che in pratica scrivono la loro forma codificata nella ROM; ma in questo momento non vale la pena di tirare fuori la distinzione tra le istruzioni nel codice sorgente e quelle nella ROM finale.
