Repository: c-fst/gb-asm-tutorial
Catalog: po/*.po
Languages: it

source: Roadmap
it: Tabella di marcia

source: Help and feedback
it: Aiuto e Suggerimenti

source: Part Ⅰ — Hello World!
it: Parte Ⅰ - Hello World!

source: Setup
it: Configurazione

source: The toolchain
it: Strumenti di lavoro

source: Binary and hexadecimal
it: Binario ed esadecimale

source: Registers
it: Registri

source: Assembly basics
it: Basi di Assembly

source: Memory
it: Memoria

source: Operations & flags
it: Operazioni e flags

source: Jumps
it: Salti

source: Tracing
it: Tracciamento

source: Graphics
it: Grafica

source: Palettes
it: Palette

source: Wrapping up
it: In conclusione

source: Part Ⅱ — Our first game
it: Parte Ⅱ - Il nostro primo gioco

source: Getting started
it: Per iniziare

source: Objects
it: Oggetti

source: Functions
it: Funzioni

source: Collision
it: Collisioni

source: Work in progress
it: Lavori in corso

source: Part Ⅲ — Our second game
it: Parte Ⅲ - Il nostro secondo gioco

source: To be written...
it: Da scrivere...

source: Where to go next
it: Prossimi passi

source: Resources
it: Risorse

source: Thanks
it: Ringraziamenti

source: # Home
it: # Pagina Principale

source: 👋 Welcome to gb-asm-tutorial! This tutorial will teach you how to make games for the Game Boy and Game Boy Color.
it: 👋 Benvenuto in gb-asm-tutorial! Questo tutorial ti insegnerà come programmare giochi per il Game Boy e per il Game Boy Color.

source: While the Game Boy and Game Boy Color are almost the same console, **the Game Boy Advance is entirely different**. However, the GBA is able to run GB and GBC games! If you are looking to program GBC games and run them on a GBA, you're at the right place; however, if you want to make games specifically for the GBA, please check out [Tonc](http://coranac.com/tonc/text) instead.
it: Il Game Boy ed il Game Boy Color sono quasi la stessa console, ma **il Game Boy Advance è un sistema completamente diverso**. Tuttavia, puoi comunque usarlo per giocare a giochi del GB e GBC! Se vuoi imparare a programmare giochi per il GBC e giocarci su di un GBA, puoi comunque seguire questo tutorial; se però volessi creare giochi specificamente per il GameBoy Advance allora [Tonc](http://coranac.com/tonc/text) è il tutorial che fai per te.

source: ## Controls
it: ## Comandi

source: There are some handy icons near the top of your screen!
it: In cima alla pagina puoi vedere alcune icone, sempre presenti se ne dovessi avere bisogno!

source: - The "burger" <i class="fa fa-bars"></i> toggles the navigation side panel; - The brush <i class="fa fa-paint-brush"></i> allows selecting a different color theme; - The magnifying glass <i class="fa fa-search"></i> pops up a search bar; - The world icon <i class="fa fa-globe"></i> lets you change the language of the tutorial; - The printer <i class="fa fa-print"></i> gives a single-page version of the *entire* tutorial, which you can print if you want; - The GitHub icon <i class="fa fa-github"></i> links to the tutorial's source repository; - The edit button <i class="fa fa-edit"></i> allows you to suggest changes to the tutorial, provided that you have a GitHub account.
it: - Il "panino" (le tre linee) <i class="fa fa-bars"></i> mostra il pannello di navigazione; - Il pennello <i class="fa fa-paint-brush"></i> ti permette di cambiare il colore della pagina; - La lente d'ingrandimento <i class="fa fa-search"></i> apre un menù di ricerca; - La stampante <i class="fa fa-print"></i> unisce tutte le pagine del tutorial in una sola, per poterlo stampare più facilmente; - L'icona di GitHub <i class="fa fa-github"></i> apre un collegamento al codice sorgente del tutorial, sul nostro profilo GitHub; - Infine, il pulsante di modifica <i class="fa fa-edit"></i> ti porterà a una pagina di GitHub dove potrai aiutarci suggerendo modifiche (è necessario un account).

source: Additionally, there are arrows to the left and to the right of the page (they are at the bottom instead on mobile) to more easily navigate to the next page.
it: Ci sono anche delle frecce a lato della pagina (o in fondo, se sei su cellulare) per passare alla pagina successiva o precedente.

source: With that said, you can get started by simply navigating to the following page :)
it: E con questo, per iniziare ti basterà premere la freccia a destra :)

source: ## Licensing
it: ## Licenza

source: **In short**:
it: **In breve**:

source: - Code within the tutorial is essentially **public domain**, meaning that you are allowed to copy it freely without restrictions. - You are free to copy the tutorial's contents (prose, diagrams, etc.), modify them, and share that, but you must give credit and license any copies permissively. - This site's *source code* can be freely copied, but you must give a license and copyright notice.
it: - Il codice all'interno del tutorial è essenzialmente di **dominio pubblico**, il che significa che è consentito copiarlo liberamente senza restrizioni. - Siete liberi di copiare i contenuti del tutorial (prosa, diagrammi, ecc.), modificarli e condividerli, ma dovete dare credito e concedere una licenza permissiva a qualsiasi copia. - Il *codice sorgente* di questo sito può essere copiato liberamente, ma è necessario fornire una licenza e una nota di copyright.

source: **Full details**, please follow these links for more information on the respective licenses:
it: **Maggiori Informazioni**, per maggiori informazioni sulle rispettive licenze, seguire questi link:

source: - All the code contained within the tutorial itself is licensed under <a rel="license" href="http://creativecommons.org/publicdomain/zero/1.0/">CC0</a>. *To the extent possible under law, all copyright and related or neighboring rights to code presented within GB ASM Tutorial have been waived. This work is published from France.* - The contents (prose, images, etc.) of this tutorial are licensed under a <a rel="license" href="http://creativecommons.org/licenses/by-sa/4.0/">Creative Commons Attribution-ShareAlike 4.0 International License</a>. - Code used to display and format the site is licensed under the [MIT License](https://github.com/gbdev/gb-asm-tutorial/blob/master/LICENSE) unless otherwise specified.
it: - Tutto il codice contenuto nel tutorial è rilasciato sotto <a rel="license" href="http://creativecommons.org/publicdomain/zero/1.0/">CC0</a>. *Per quanto possibile ai sensi della legge, l'autore rinuncia a tutti i diritti d'autore e i diritti connessi o limitrofi al codice presentato all'interno di GB ASM Tutorial. Questo lavoro è pubblicato dalla Francia.* - I contenuti (prosa, immagini, ecc.) di questo tutorial sono rilasciati sotto una <a rel="license" href="http://creativecommons.org/licenses/by-sa/4.0/">Creative Commons Attribution-ShareAlike 4.0 International License</a>. - Il codice utilizzato per visualizzare e formattare il sito è rilasciato sotto la [MIT License](https://github.com/ISSOtm/gb-asm-tutorial/blob/master/LICENSE), se non diversamente specificato.

source: # Roadmap
it: # Tabella di marcia

source: The tutorial is split into three sections. **I strongly advise you go through the tutorial in order!**
it: Il tutorial è suddiviso in tre sezioni. **Consiglio vivamente di seguirle in ordine!**

source: In Part Ⅰ, we run our first "Hello World!" program, which we then dissect to learn what makes the Game Boy tick.
it: Nella parte Ⅰ, lanciamo il nostro primo programma "Hello World!", per poi analizzarlo al fine di capire come funziona il Game Boy.

source: In Part Ⅱ, we program our first game, a clone of *Arkanoid*; we learn how to prod the hardware into having something we can call a "game". Along the way, we will make plenty of mistakes, so we can learn how to debug our code.
it: Nella parte Ⅱ programmiamo il nostro primo gioco, un clone di *Arkanoid*; impariamo a dare le prime istruzioni all'hardware per ottenere qualcosa che si possa definire "gioco". Lungo il percorso commetteremo molti errori, ma questo servirà anche a imparare a risolvere i problemi del nostro codice.

source: And finally, Part Ⅲ is about "advanced" use of the hardware, where we learn how to make even better-looking games, and we program a Shoot 'Em Up!
it: Infine, la Parte Ⅲ riguarda l'uso "avanzato" dell'hardware, dove impareremo a creare giochi ancora più rifiniti e programmeremo uno "Shoot 'Em Up"!

source: I hope the tutorial will work for you!! But if it doesn't (the format doesn't work well for everyone, and that's okay), I encourage you to look at [some other resources](resources.md), which might work better for you. It's also fine to take a break from time to time; feel free to read at your own pace, and to [ask for clarifications](https://gbdev.io/chat) if anything isn't clear to you.
it: Spero che il tutorial funzioni per voi!!! Ma se così non fosse (questo formato non funziona bene per tutti, e va bene così), vi esorto a guardare [altre risorse](resources.md), che potrebbero fare più al vostro caso. Fa bene anche fare una pausa di tanto in tanto; sentitevi liberi di leggere al vostro ritmo e di [chiedere chiarimenti](https://gbdev.io/chat) se qualcosa non vi è chiaro.

source: Unfortunately, this tutorial is a work in progress. Currently, **Part Ⅱ is being written**, and Part Ⅲ should follow soon after.
it: Purtroppo questa guida non è ancora stata completata. Per adesso stiamo ancora scrivendo la **Parte Ⅱ**, e la Parte Ⅲ verrà subito dopo.

source: # Help and feedback
it: # Aiuto e suggerimenti

source: If you are stuck in a certain part of the tutorial, want some advice, or just wish to chat with us, [the GBDev community chat](https://gbdev.io/chat) is the place to go! I actively participate there, and don't be afraid to ask questions! (The "ASM" channel should be the most appropriate to discuss the tutorial, by the way.)
it: Se avessi problemi con una parte del tutorial, se volessi suggerimenti di qualsiasi tipo o anche solo parlare con noi la [chat della comunità GBDev](https://gbdev.io/chat) è il posto che cerchi! Partecipiamo tutti attivamente sul sito, perciò non aver timore di fare domande di qualunque tipo! (il canale "ASM" è il posto migliore per discutere di questo tutorial.)

source: If you are interested in contributing to or translating the tutorial, thank you! Follow the link above, I'd be happy to work with you.
it: Se sei interessato a contribuire al tutorial o alla sua traduzione, sei il benvenuto! Ti basta seguire il link qui sopra, sarò molto felice di lavorare con te.

source: Noticed a problem with the tutorial? Please [check out our issue tracker](https://github.com/gbdev/gb-asm-tutorial/issues); if there is no open issue about your problem, please create a new one, or reach out to us via the link above.
it: Hai trovato un errore nel tutorial? Faccelo sapere sulla [pagina dei problemi](https://github.com/gbdev/gb-asm-tutorial/issues); se non trovi un post già esistente su ciò che vuoi farci sapere allora creane uno, o contattaci col link che abbiamo citato prima.

source: If you prefer email, my address is `tutorial@<domain>`, where you replace `<domain>` with this website's domain name (it ends with `.fr`). Anti-spam measure, I hope you understand.
it: Se preferisci la posta elettronica, allora scrivi a `tutorial@<dominio>`, sostituendo `<dominio>` con il nome del dominio del sito (che finisce con `.io`). Lo scrivo così per evitare spam, grazie per la comprensione.

source: # Setup
it: # Preparazione

source: First, we should set up our dev environment. We will need:
it: Per prima cosa, dobbiamo configurare il nostro ambiente di sviluppo. Avremo bisogno di:

source: 1. A POSIX environment 2. [RGBDS](https://rgbds.gbdev.io/install) v0.5.1 (though v0.5.0 should be compatible) 3. GNU Make (preferably a recent version) 4. A code editor 5. A debugging emulator
it: 1. Un ambiente POSIX 2. [RGBDS](https://rgbds.gbdev.io/install) v0.5.1 (anche se la v0.5.0 dovrebbe essere comunque compatibile) 3. GNU Make (preferibilmente una versione recente) 4. Un editor di codice 5. Un emulatore per il debug

source: The following install instructions are provided on a "best-effort" basis, but may be outdated, or not work for you for some reason. Don't worry, we're here to help: [ask away in GBDev](../index.md#feedback), and we'll help you with installing everything!
it: Abbiamo fatto del nostro meglio per fornire queste istruzioni per l'installazione, ma potrebbero essere obsolete o non funzionare per qualche motivo. In ogni caso, non preoccupatevi, siamo qui per aiutarvi: [chiedi pure in GBDev](../index.md#feedback), e ti aiuteremo a installare tutto!

source: ## Tools
it: ## Strumenti

source: ### Linux & macOS
it: ### Linux e macOS

source: Good news: you're already fulfilling step 1! You just need to [install RGBDS](https://rgbds.gbdev.io/install), and maybe update GNU Make.
it: Buone notizie: hai già completato il primo passo! Dovete solo [installare RGBDS](https://rgbds.gbdev.io/install) e forse aggiornare GNU Make.

source: At the time of writing this, macOS (up to 11.0, the current latest release) ships a very outdated GNU Make. You can check it by opening a terminal, and running `make --version`, which should indicate "GNU Make" and a date, among other things.
it: Al momento della stesura di questo articolo, macOS (fino alla 11.0, l'ultima release attuale) ha in dotazione un GNU Make molto datato. È possibile verificarlo aprendo un terminale ed eseguendo `make --version`, che dovrebbe indicare "GNU Make" e una data, tra le altre cose.

source: If your Make is too old, you can update it using [Homebrew](https://brew.sh)'s formula [`make`](https://formulae.brew.sh/formula/make#default). At the time of writing, this should print a warning that the updated Make has been installed as `gmake`; you can either follow the suggestion to use it as your "default" `make`, or use `gmake` instead of `make` in this tutorial.
it: Se il vostro Make è troppo vecchio, potete aggiornarlo usando la formula di [Homebrew](https://brew.sh) [`make`](https://formulae.brew.sh/formula/make#default). Al momento in cui scriviamo, dovrebbe essere stampato un avviso che il Make aggiornato è stato installato come `gmake`; si può seguire il suggerimento di usarlo come `make` "predefinito", oppure usare `gmake` invece di `make` in questo tutorial.

source: Once RGBDS is installed, open a terminal and run `make --version` to check your Make version (which is likely GNU Make).
it: Una volta installato RGBDS, aprite il terminale ed eseguite il comando `make --version` per controllare la vostra versione di Make (che probabilmente è GNU Make).

source: If `make` cannot be found, you may need to install your distribution's `build-essentials`.
it: Se `make` non è presente, potrebbe essere necessario installare le `build-essentials` della propria distribuzione.

source: The sad truth is that Windows is a terrible OS for development; however, you can install environments that solve most issues.
it: La triste verità è che Windows è un pessimo sistema operativo per noi sviluppatori; tuttavia, è possibile installare degli strumenti che risolvano la maggior parte dei suoi problemi.

source: On Windows 10, your best bet is [WSL](https://docs.microsoft.com/en-us/windows/wsl), which sort of allows running a Linux distribution within Windows. Install WSL 1 or WSL 2, then a distribution of your choice, and then follow these steps again, but for the Linux distribution you installed.
it: Su Windows 10, la scelta migliore è [WSL](https://docs.microsoft.com/en-us/windows/wsl), che permette di eseguire una distribuzione Linux all'interno di Windows. Installate WSL 1 o WSL 2, poi una distribuzione a vostra scelta e quindi seguite nuovamente questi passaggi per la distribuzione Linux appena installata.

source: If WSL is not an option, you can use [MSYS2](https://www.msys2.org) or [Cygwin](https://www.cygwin.com) instead; then check out [RGBDS' Windows install instructions](https://rgbds.gbdev.io/install). As far as I'm aware, both of these provide a sufficiently up-to-date version of GNU Make.
it: In alternativa a WSL, si può usare [MSYS2](https://www.msys2.org) o [Cygwin](https://www.cygwin.com); per poi consultare le istruzioni per l'installazione di Windows di [RGBDS] (https://rgbds.gbdev.io/install). Per quanto ne so, entrambi dovrebbero fornire una versione sufficientemente aggiornata di GNU Make.

source: If you have programmed for other consoles, such as the GBA, check if MSYS2 isn't already installed on your machine. This is because devkitPro, a popular homebrew development bundle, includes MSYS2.
it: Se avete programmato per altre console, come il GBA, controllate che MSYS2 non sia già installato sul vostro computer. Questo perché devkitPro, un popolare pacchetto di sviluppo homebrew, include MSYS2.

source: ## Code editor
it: ## Editor di codice

source: Any code editor is fine; I personally use [Sublime Text](https://www.sublimetext.com) with its [RGBDS syntax package](https://packagecontrol.io/packages/RGBDS); however, you can use any text editor, including Notepad, if you're crazy enough. Awesome GBDev has [a section on syntax highlighting packages](https://gbdev.io/resources#syntax-highlighting-packages), see there if your favorite editor supports RGBDS.
it: Qualsiasi editor di codice va bene; personalmente uso [Sublime Text](https://www.sublimetext.com) con il suo [pacchetto sintassi RGBDS](https://packagecontrol.io/packages/RGBDS); tuttavia è possibile usare qualsiasi editor di testo, compreso il Blocco Note se si è abbastanza pazzi. Awesome GBDev ha [una sezione sui pacchetti per l'evidenziazione della sintassi](https://gbdev.io/resources#syntax-highlighting-packages) dove potete controllare se il vostro editor preferito supporta RGBDS.

source: ## Emulator
it: ## Emulatore

source: Using an emulator to play games is one thing; using it to program games is another. The two aspects an emulator must fulfill to allow an enjoyable programming experience are: - **Debugging tools**: When your code goes haywire on an actual console, it's very difficult to figure out why or how. There is no console output, no way to `gdb` the program, nothing. However, an emulator can provide debugging tools, allowing you to control execution, inspect memory, etc. These are vital if you want GB dev to be *fun*, trust me! - **Good accuracy**: Accuracy means "how faithful to the original console something is". Using a bad emulator for playing games can work (to some extent, and even then...), but using it for *developing* a game makes it likely to accidentally render your game incompatible with the actual console. For more info, read [this article on Ars Technica](https://arstechnica.com/?post_type=post&p=44524) (especially the <q>An emulator for every game</q> section at the top of page 2). You can compare GB emulator accuracy on [Daid's GB-emulator-shootout](https://daid.github.io/GBEmulatorShootout/).
it: Usare un emulatore per giocare è una cosa; usarlo per programmare giochi è un'altra. I due aspetti che un emulatore deve soddisfare per consentire una piacevole esperienza di programmazione sono: - __Un supporto al debug__: Se il tuo programma va in palla sulla console è pressoché impossibile capire cosa sia andato storto: non puoi controllare gli errori dal terminale, non puoi usare `gdb`, niente. Un emulatore, al contrario, può avere strumenti per aiutare il debug, ad esempio dandoti controllo sull'esecuzione leggere e mdoificare la memoria, e molto altro. Senza di questi strumenti lo sviluppo sarà tutto meno che _divertente_, fidati! - __Emulazione Precisa__: La precisione di un emulatore è quanto questo riproduca bene il comportamento del sistema reale. Un emulatore poco accurato andrà anche bene per giocare (seppur spesso con un esperienza poco fluida...), ma se vuoi _programmare_, hai bisogno di sapere se il tuo gioco sia effettivamente compatibile con il tuo sistema. Se sei interessato puoi leggere di più a riguardo su [questo articolo di Ars Technica](https://arstechnica.com/?post_type=post&p=44524) (in particolare la sezione <q>An emulator for every game</q> in cima alla seconda pagina). Puoi vedere e confrontare la precisione di alcuni degli emulatori GameBoy più popolari sul [GB-emulator-shootout](https://daid.github.io/GBEmulatorShootout/) di Daid. Trovi una tabella con diversi test ed i risultati per emulatore.

source: The emulator I will be using for this tutorial is [BGB](https://bgb.bircd.org) (1.5.9 when I'm writing this). It's Windows-only, but macOS and Linux users can install Wine to be able to run it, and macOS users will additionally have to use the 64-bit version. Other debugging emulators are possible (such as SameBoy on macOS), but I will be giving directives for and including screenshots of BGB.
it: L'emulatore che utilizzerò in questo tutorial è [BGB](https://bgb.bircd.org) (1.5.9 al momento in cui scrivo). È solo per Windows, ma gli utenti di macOS e Linux possono installare Wine per usarlo; gli utenti di macOS dovranno inoltre utilizzare la versione a 64 bit. Potete sempre usare altri emulatori (come [SameBoy](https://sameboy.github.io/) su macOS), ma in questo tutorial spiegherò usando BGB e le sue funzioni.

source: In this lesson, we will begin by assembling our first program. The rest of this chapter will be dedicated to explaining how and why it works.
it: In questa lezione inizieremo ad assemblare il nostro primo programma. Il resto del capitolo sarà dedicato a spiegare come e perché funziona.

source: Note that we will need to type a lot of commands, so open a terminal now. It's a good idea to create a new directory (`mkdir gb_hello_world`, for example, then `cd gb_hello_world` to enter the new directory).
it: Tenete presente che da ora dovremo lanciare molti comandi, quindi è il momento di aprire una finestra del terminale. È buon norma creare una nuova directory (`mkdir gb_hello_world`, per esempio, poi `cd gb_hello_world` per entrare nella nuova directory).

source: Grab the following files (right-click each link, "Save Link As..."), and place them all in this new directory: - [`hello-world.asm`](../assets/hello-world.asm) - [`hardware.inc`](https://raw.githubusercontent.com/gbdev/hardware.inc/v4.0/hardware.inc)
it: Scaricate i seguenti file (cliccate con il tasto destro del mouse su ogni link, "Salva link con nome...") e metteteli tutti in questa nuova directory: - [`hello-world.asm`](../assets/hello-world.asm) - [`hardware.inc`](https://raw.githubusercontent.com/gbdev/hardware.inc/v4.0/hardware.inc)

source: Then, still from a terminal within that directory, run the following three commands.
it: Quindi, sempre dal terminale, all'interno di quella directory, lanciate i tre comandi seguenti.

source: To clarify where each individual command begins, I've added a `$` before each command, but don't type them!
it: Per chiarezza espositiva, all'inizio di ogni comando, ho aggiunto un `$`, ma voi non digitatelo!

source: Be careful with arguments! Some options, such as `-o` here, use the argument after them as a parameter:
it: Fate attenzione agli argomenti! Alcune opzioni, come `-o`, usano l'argomento dopo di esse come parametro:

source: 1. `rgbasm -L -o hello-world.asm hello-world.o` won't work (and may corrupt `hello-world.asm`!) 2. `rgbasm -L hello-world.asm -o hello-world.o` will work 3. `rgbasm hello-world.asm -o hello-world.o -L` will also work
it: 1. `rgbasm -L -o hello-world.asm hello-world.o` non funzionerà (e potrebbe corrompere `hello-world.asm`!) 2. `rgbasm -L hello-world.asm -o hello-world.o` funzionerà 3. `rgbasm hello-world.asm -o hello-world.o -L` funzionerà anche

source: If you need whitespace within an argument, you must quote it:
it: In caso di spazi all'interno di un argomento, è necessario metterlo tra virgolette:
