Repository: c-fst/gb-asm-tutorial
Catalog: po/*.po
Languages: it

source: [^ld_imm_from]: The curious reader may ask where the value is copied *from*. The answer is simply that the \"immediate\" byte ($00 in this example) is stored in ROM just after the instruction's opcode byte, and it's what gets copied to `a`. We will come back to this when we talk about how instructions are encoded later on.
it: [^ld_imm_from]: Il lettore curioso potrebbe chiedersi da *dove* venga copiato il valore. La risposta è semplicemente che il byte cosiddetto \"immediato\" ($00 in questo esempio) è memorizzato nella ROM *immediat*amente dopo il byte del codice dell'istruzione, ed è questo valore che viene copiato in `a`. Torneremo su questo punto più avanti, quando parleremo di come vengono codificate le istruzioni.

source: [^hw_inc_directives]: `hardware.inc` itself contains more directives, in particular to define a lot of symbols. They will be touched upon much later, so we won't look into `hardware.inc` yet.
it: [^hw_inc_directives]: Lo stesso `hardware.inc` contiene altre direttive, in particolare per definire molti simboli. Saranno trattate molto più avanti, quindi non esamineremo ancora `hardware.inc`.

source: [^sect_name]: Section names actually only need to be unique for "plain" sections, and function differently with "unionized" and "fragment" sections, which we will discuss much later.
it: [^sect_name]: I nomi delle sezioni devono essere univoci per le sezioni "semplici", mentre funzionano in modo diverso con le sezioni "unificate" e "a frammenti" di cui parleremo più avanti.

source: [^ds_pattern]: Actually, since RGBASM 0.5.0, `ds` can accept a *list* of bytes, and will repeat the pattern for as many bytes as specified. It just complicates the explanation slightly, so I omitted it for now. Also, if the argument is omitted, it defaults to what is specified using the `-p` option **to RGBASM**.
it: [^ds_pattern]: In realtà, da RGBASM 0.5.0, `ds` si può usare con un *elenco* di byte, e ripeterà la sequenza per il numero di byte necessario. Questo complica un po' la spiegazione, quindi per ora l'ho omesso. Inoltre, se il parametro di `ds` viene omesso il suo valore assume quello predefinito specificato con l'opzione `-p` di RGBASM.

source: # Memory
it: # Memoria

source: Congrats, you have just finished the hardest lessons of the tutorial! Since you have the basics, from now on, we'll be looking at more and more concrete code.
it: Congratulazioni, avete appena finito le lezioni più difficili del tutorial! Dal momento che avete le basi, d'ora in poi vedremo codice sempre più concreto.

source: If we look at line 29, we see `ld a, [de]`. Given what we just learned, this copies a value into register `a`... but where from? What do these brackets mean? To answer that, we need to talk about *memory*.
it: Se guardiamo alla riga 29 leggiamo `ld a, [de]`. Stando a quanto abbiamo appena appreso, questo copia un valore nel registro `a`... ma da dove? Cosa significano queste parentesi? Per rispondere dobbiamo parlare della *memoria*.

source: ## What's a memory?
it: ## Cos'è una memoria?

source: The purpose of memory is to store information. On a piece of paper or a whiteboard, you can write letters to store the grocery list, for example. But what can you store in a computer memory? The answer to that question is *current*[^memory_magnetic]. Computer memory is made of little cells that can store current. But, as we saw in the lesson about binary, the presence or absence of current can be used to encode binary numbers!
it: Lo scopo della memoria è quello di immagazzinare informazioni. Su un foglio di carta o su una lavagna si possono scrivere lettere per memorizzare, ad esempio, la lista della spesa. Ma cosa si può memorizzare nella memoria di un computer? La risposta a questa domanda è *corrente*[^memoria_magnetica]. La memoria del computer è costituita da piccole celle in grado di immagazzinare corrente. Ma, come abbiamo visto nella lezione sul binario, la presenza o l'assenza di corrente può essere utilizzata per codificare i numeri binari!

source: tl;dr: memory **stores numbers**. In fact, memory is a *long* array of numbers, stored in cells. To uniquely identify each cell, it's given a number (what else!) called its *address*. Like street numbers! The first cell has address 0, then address 1, 2, and so on. On the Game Boy, each cell contains *8 bits*, i.e. a *byte*.
it: Per farla breve: la memoria **immagazzina numeri**. Difatti la memoria è una *lunga* lista di numeri, memorizzati in celle. Per identificare in modo univoco ogni cella, le viene assegnato un numero (e che altro!) chiamato *indirizzo*. Come i numeri civici! La prima cella ha l'indirizzo 0, poi l'indirizzo 1, 2 e così via. Sul Game Boy ogni cella contiene *8 bit*, cioè un *byte*.

source: How many cells are there? Well, this is actually a trick question...
it: Quante cellule ci sono? In realtà questa è una domanda trabocchetto...

source: ## The many types of memory
it: ## I tanti tipi di memoria

source: There are several memory chips in the Game Boy, but we can put them into two categories: <abbr title="Read-Only Memory">ROM</abbr> and <abbr title="Random Access Memory">RAM</abbr>[^rom_ram_and]. ROM simply designates memory that cannot be written to[^rom_ro], and RAM memory that can be written to.
it: Nel Game Boy sono presenti diversi circuiti di memoria, ma possiamo suddividerli in due categorie: <abbr title="Read-Only Memory">ROM</abbr> e <abbr title="Random Access Memory">RAM</abbr>[^rom_ram_and]. ROM indica semplicemente la memoria su cui non è possibile scrivere[^rom_ro], e RAM la memoria su cui è possibile scrivere.

source: Due to how they work, the CPU, as well as the memory chips, can only use a single number for addresses. Let's go back to the "street numbers" analogy: each memory chip is a street, with its own set of numbers, but the CPU has no idea what a street is, it only deals with street numbers. To allow the CPU to talk to multiple chips, a sort of "postal service", the *chip selector*, is tasked with translating the CPU's street numbers into a street & street number.
it: Per via del loro funzionamento il processore ed i circuiti di memoria possono utilizzare un solo numero per gli indirizzi. Torniamo all'analogia dei "numeri civici": ogni circuito di memoria è una strada, con la sua serie di numeri, ma il processore non ha idea di cosa sia una strada, si occupa solo di numeri civici. Per consentire al processore di parlare con più circuiti serve una sorta di "servizio postale", il *selezionatore di circuito* ("chip selector" in inglese), che ha il compito di tradurre i numeri civici del processore in una via ed un numero civico effettivi.

source: For example, let's say a convention is established where addresses 0 through 1999 go to chip A's addresses 0&ndash;1999, 2000&ndash;2999 to chip B's 0&ndash;999, and 3000&ndash;3999 to chip C's 0&ndash;999. Then, if the CPU asks for the byte at address 2791, the chip selector will ask chip B for the byte at its *own* address 791, and forward the reply to the CPU.
it: Ad esempio, supponiamo che sia stata stabilita una convenzione per cui gli indirizzi da 0 a 1999 vanno agli indirizzi 0&ndash;1999 del circuito A, 2000&ndash;2999 allo 0&ndash;999 del circuito B e 3000&ndash;3999 allo 0&ndash;999 del circuito C. Quindi, se il processore chiede il byte all'indirizzo 2791, il selettore di chip chiederà al circuito B il byte al *suo* indirizzo 791 ed inoltrerà la risposta al processore.

source: Since addresses dealt with by the CPU do not directly correspond to the chips' addresses, we talk about *logical* addresses (here, the CPU's) versus *physical* addresses (here, the chips'), and the correspondence is called a *memory map*. Since we are programming the CPU, we will only be dealing with **logical** addresses, but it's crucial to keep in mind that different addresses may be backed by different memory chips, since each chip has unique characteristics.
it: Poiché gli indirizzi trattati dal processore non corrispondono direttamente a quelli dei circuiti si parla di indirizzi *logici* (qui, quelli del processore) e di indirizzi *fisici* (qui, quelli dei circuiti), e la corrispondenza è chiamata *mappa di memoria* ("memory map" in inglese). Poiché stiamo programmando il processore ci occuperemo solo di indirizzi **logici**, ma è fondamentale tenere presente che indirizzi diversi possono essere supportati da circuiti di memoria diversi, poiché ogni circuito ha caratteristiche uniche.

source: This may sound complicated, so here is a summary: - Memory stores numbers, each 8-bit on the Game Boy. - Memory is accessed byte by byte, and the cell being accessed is determined by an *address*, which is just a number. - The CPU deals with all memory uniformly, but there are several memory chips each with their own characteristics.
it: Può sembrare complicato, quindi ecco un riassunto: - La memoria contiene numeri, ognuno dei quali sul Game Boy è ad 8 bit. - Si accede alla memoria byte per byte e la cella a cui si accede è determinata da un *indirizzo*, che è semplicemente un numero. - Il processore tratta tutta la memoria come se fosse uniforme, ma esistono diversi circuiti di memoria ognuno con le proprie caratteristiche.

source: ### Game Boy memory map
it: ### Mappa di memoria del Game Boy

source: Let's answer the question that introduced this section: how many memory cells are there on the Game Boy? Well, now, we can reframe this question as "how many logical addresses are there?" or "how many physical addresses are there in total?".
it: Adesso rispondiamo alla domanda che ci aveva portato a questa sezione: quante celle di memoria ci sono sul Game Boy? Ora possiamo riformulare meglio questa domanda come "quanti indirizzi logici ci sono?" o "quanti indirizzi fisici ci sono in totale?".

source: Logical addresses, which again are just numbers, are 16-bit on the Game Boy. Therefore, there are 2^16 = 65536 logical addresses, from $0000 to $FFFF. How many physical addresses, though? Well, here is a memory map [courtesy of Pan Docs](https://gbdev.io/pandocs/Memory_Map.html) (though I will simplify it a bit):
it: Gli indirizzi logici, che sono solo numeri, sono a 16 bit sul Game Boy. Pertanto, ci sono 2^16 = 65536 indirizzi logici, da $0000 a $FFFF. Ma quanti sono gli indirizzi fisici? Ecco una mappa della memoria [per gentile concessione di Pan Docs](https://gbdev.io/pandocs/Memory_Map.html) (anche se la semplificherò un po'):

source: Start | End | Name | Description ------|-------|------|------------------------------------------------------------------------- $0000 | $7FFF | ROM | The game ROM, supplied by the cartridge. $8000 | $9FFF | VRAM | Video RAM, where graphics are stored and arranged. $A000 | $BFFF | SRAM | Save RAM, optionally supplied by the cartridge to save data to. $C000 | $DFFF | WRAM | Work RAM, general-purpose RAM for the game to store things in. $FE00 | $FE9F | OAM | Object Attribute Memory, where "objects" are stored. $FF00 | $FF7F | I/O | Neither ROM nor RAM, but this is where you control the console. $FF80 | $FFFE | HRAM | High RAM, a tiny bit of general-purpose RAM which can be accessed faster. $FFFF | $FFFF | IE | A lone I/O byte that's separated from the rest for some reason.
it: Inizio | Fine | Nome | Descrizione ------|-------|------|------------------------------------------------------------------------- $0000 | $7FFF | ROM | La ROM del gioco, fornita dalla cartuccia. $8000 | $9FFF | VRAM | RAM Video, dove viene memorizzata e organizzata la grafica. $A000 | $BFFF | SRAM | RAM di Salvataggio, fornita opzionalmente da certe cartucce per salvare i dati. $C000 | $DFFF | WRAM | RAM di lavoro, RAM ad uso generico in cui il gioco può memorizzare i dati. $FE00 | $FE9F | OAM | Object Attribute Memory, dove vengono memorizzati gli "oggetti". $FF00 | $FF7F | I/O | Né ROM né RAM, ma è qui che si controlla la console. $FF80 | $FFFE | HRAM | High RAM, una piccola porzione di RAM generica a cui si accede più velocemente. $FFFF | $FFFF | IE | Un solo byte di I/O separato dal resto per qualche motivo.

source: $8000 + $2000 + $2000 + $2000 + $A0 + $80 + $7F + 1 adds up to $E1A0, or 57760 bytes of memory that can be *actually* accessed. The curious reader will naturally ask, "What about the remaining 7776 bytes? What happens when accessing them?"; the answer is: "It depends, it's complicated; avoid accessing them".
it: $8000 + $2000 + $2000 + $2000 + $A0 + $80 + $7F + 1 fanno in totale $E1A0, ovvero 57760 byte di memoria che si possono *effettivamente* usare. E a questo punto potreste chiedervi: "E i restanti 7776 byte? Cosa succede quando provo ad usarli?"; la risposta è: "Dipende, è complicato; evitate di accedervi".

source: ## Labels
it: ## Etichette

source: Okay, memory addresses are nice, but you can't possibly expect me to keep track of all these addresses manually, right?? Well, fear not, for we have labels!
it: Ok, tutto questo è molto bello, ma non vi aspetterete certo che io tenga in mente tutti questi indirizzi per conto mio, giusto?? Beh, non temere, perché abbiamo le etichette!

source: Labels are [symbols](https://rgbds.gbdev.io/docs/v0.5.1/rgbasm.5#SYMBOLS) which basically allow attaching a name to a byte of memory. A label is declared like at line 9 (`EntryPoint:`): at the beginning of the line, write the label's name, followed by a colon, and it will refer to the byte right after itself. So, for example, `EntryPoint` refers to the `ld a, 0` right below it (more accurately, the first byte of that instruction, but we will get there when we get there).
it: Le etichette sono [simboli](https://rgbds.gbdev.io/docs/v0.5.1/rgbasm.5#SYMBOLS) che in pratica permettono di assegnare un nome a un indirizzo di memoria. Un'etichetta viene dichiarata come alla riga 9 (`EntryPoint:`): all'inizio della riga si scrive il nome dell'etichetta, seguito da due punti, ed essa si riferirà al byte immediatamente successivo. Quindi, per esempio, `EntryPoint` si riferisce al `ld a, 0` subito dopo (più precisamente, al primo byte di quell'istruzione, ma ci arriveremo quando ci arriveremo).

source: If you peek inside `hardware.inc`, you will see that for example `rNR52` is not defined as a label. That's because they are *constants*, which we will touch on later; since they can be used mostly like labels, we will conflate the two for now.
it: Se si sbircia all'interno di `hardware.inc`, si vedrà che, per esempio, `rNR52` non è definito come un'etichetta. Questo è perché queste sono *costanti*, di cui parleremo più in là; visto che si usano in modo quasi identico alle etichette, per il momento le considereremo uguali.

source: Writing out a label's name is equivalent to writing the address of the byte it's referencing (with a few exceptions we will see in Part Ⅱ). For example, consider the `ld de, Tiles` at line 25. `Tiles` (line 64) is referring to the first byte of the tile data; if we assume that the tile data ends up being stored starting at $0193, then `ld de, Tiles` is equivalent to `ld de, $0193`!
it: Scrivere il nome di un'etichetta equivale a scrivere l'indirizzo del byte a cui fa riferimento (con alcune eccezioni che vedremo nella Parte Ⅱ). Per esempio, si consideri la `ld de, Tiles` alla riga 25. `Tiles` (riga 64) si riferisce al primo byte dei dati delle mattonelle; se assumiamo che i dati delle mattonelle finiscano per essere memorizzati a partire da $0193, allora `ld de, Tiles` è equivalente a `ld de, $0193`!

source: ## What's with the brackets?
it: ## Cosa sono queste parentesi?

source: Right, we came into this because we wanted to know what the brackets in `ld a, [de]` mean. Well, they can basically be read as "at address...". For example, `ld a, b` can be read as "copy into `a` the value stored in `b`"; `ld a, [$5414]` would be read as "copy into `a` the value stored at address $5414", and `ld a, [de]` would be read as "copy into `a` the value stored at address `de`". Wait, what does that mean? Well, if `de` contains the value $5414, then `ld a, [de]` will do the same thing as `ld a, [$5414]`.
it: Bene, siamo arrivati a questo punto perché volevamo sapere cosa significano le parentesi in `ld a, [de]`. In pratica possono essere lette come "all'indirizzo...". Per esempio, `ld a, b` può essere letto come "copia in `a` il valore memorizzato in `b`"; `ld a, [$5414]` sarebbe letto come "copia in `a` il valore memorizzato all'indirizzo $5414", e `ld a, [de]` sarebbe letto come "copia in `a` il valore memorizzato all'indirizzo `de`". Aspettate, cosa significa? Beh, se `de` contiene il valore $5414, allora `ld a, [de]` farà la stessa cosa di `ld a, [$5414]`.

source: If you're familiar with C, these brackets are basically how the dereference operator is implemented.
it: Se avete familiarità con il C, queste parentesi sono sostanzialmente il modo in cui viene implementato l'operatore di dereferenziazione.

source: An astute reader will have noticed the `ld [hli], a` just below the `ld a, [de]` we have just studied. `[de]` makes sense because it's one of the register pairs we saw a couple lessons ago, but `[hli]`? It's actually a special notation, which can also be written as `[hl+]`. It functions as `[hl]`, but `hl` is *incremented* just after memory is accessed. `[hld]`/`[hl-]` is the mirror of this one, *decrementing* `hl` instead of incrementing it.
it: Un lettore attento avrà notato il `ld [hli], a` appena sotto il `ld a, [de]` che abbiamo appena studiato. `[de]` ha senso perché è una delle coppie di registri che abbiamo visto un paio di lezioni fa, ma `[hli]`? In realtà è una notazione speciale, che può essere scritta anche come `[hl+]`. Funziona come `[hl]`, ma `hl` viene *incrementato* subito dopo l'accesso alla memoria. `[hld]`/`[hl-]` è lo specchio di questa, *decrementando* `hl` invece di incrementarlo.

source: ## An example
it: ## Un esempio

source: So, if we look at the first two instructions of `CopyTiles`:
it: Quindi, se osserviamo le prime due istruzioni di `CopyTiles`:

source: ...we can see that we're copying the byte in memory *pointed to* by `de` (that is, whose address is contained in `de`) into the byte pointed to by `hl`. Here, `a` serves as temporary storage, since the CPU is unable to perform `ld [hl], [de]` directly.
it: ... possiamo vedere che stiamo copiando il byte in memoria *puntato* da `de` (cioè il cui indirizzo è contenuto in `de`) nel byte puntato da `hl`. Qui, `a` serve come memoria temporanea, poiché la CPU non è in grado di eseguire direttamente `ld [hl], [de]`.

source: While we're at this, let's examine the rest of `.copyTiles` in the following lessons!
it: Già che ci siamo, esaminiamo il resto di `.copyTiles` nelle lezioni successive!

source: [^memory_magnetic]: Actually, this depends a lot on the type of memory. A lot of memory nowadays uses magnetic storage, but to keep the explanation simple, and to parallel the explanation of binary given earlier, let's assume that current is being used.
it: [^memory_magnetic]: In realtà, questo dipende molto dal tipo di memoria. Molte memorie oggi utilizzano la memoria magnetica, ma per mantenere la spiegazione semplice e per fare un parallelo con la spiegazione del binario data in precedenza, supponiamo che venga utilizzata la corrente.

source: [^rom_ram_and]: There are other types of memory, such as flash memory or EEPROM, but only Flash has been used on the Game Boy, and for only a handful of games; so we can mostly forget about them.
it: [^rom_ram_e]: Esistono altri tipi di memoria, come la memoria flash o l'EEPROM, ma solo la flash è stata utilizzata sul Game Boy, e solo per una manciata di giochi; quindi possiamo dimenticarci di loro.

source: [^rom_ro]: No, really! Mask ROM is created by literally punching holes into a layer of silicon using acid, and e.g. the console's boot ROM is made of hard-wired transitors within the CPU die. Good luck writing to that! <br> "ROM" is sometimes (mis)used to refer to "persistent memory" chips, such as flash memory, whose write functionality was disabled. Most bootleg / "repro" Game Boy cartridges you can find nowadays actually contain flash; this is why you can reflash them using specialized hardware, but original cartridges cannot be.
it: [^rom_ro]: No, davvero! La ROM a maschera viene creata letteralmente bucando uno strato di silicio con l'acido, e ad esempio la ROM di avvio della console è fatta di transistor cablati all'interno del die della CPU. Buona fortuna a scriverci! <br> Il termine "ROM" viene a volte (erroneamente) utilizzato per indicare i chip di "memoria persistente", come la memoria flash, la cui funzionalità di scrittura è stata disabilitata. La maggior parte delle cartucce Game Boy bootleg / "repro" che si possono trovare al giorno d'oggi contengono effettivamente la flash; questo è il motivo per cui è possibile riflasharle utilizzando hardware specializzato, mentre le cartucce originali non possono esserlo.

source: Let's go back to a certain line near the top of `hello-world.asm`.
it: Torniamo a una certa riga vicino all'inizio di `hello-world.asm`.

source: ```rgbasm,linenos,start=7 ds $150 - @, 0 ; Make room for the header ```
it: ```rgbasm,linenos,start=7 ds $150 - @, 0 ; Fare spazio per l'intestazione ```

source: What is this mysterious header, why are we making room for it, and more questions answered in this lesson!
it: Che cos'è questa misteriosa testata, perché le stiamo facendo spazio e altre domande trovano risposta in questa lezione!

source: ## What is the header?
it: ## Qual è l'intestazione?

source: First order of business is explaining what the header *is*. It's the region of memory from $0104 to $014F (inclusive). It contains metadata about the ROM, such as its title, Game Boy Color compatibility, size, two checksums, and interestingly, the Nintendo logo that is displayed during the power-on animation.
it: La prima cosa da fare è spiegare cos'è l'header. È la regione di memoria da $0104 a $014F (inclusi). Contiene metadati sulla ROM, come il titolo, la compatibilità con il Game Boy Color, le dimensioni, due checksum e, cosa interessante, il logo Nintendo che viene visualizzato durante l'animazione di accensione.

source: You can find this information and more [in the Pan Docs](https://gbdev.io/pandocs/The_Cartridge_Header).
it: Queste e altre informazioni sono disponibili [nei documenti Pan](https://gbdev.io/pandocs/The_Cartridge_Header).

source: Interestingly, most of the information in the header does not matter on real hardware (the ROM's size is determined only by the capacity of the ROM chip in the cartridge, not the header byte). In fact, some prototype ROMs actually have incorrect header info!
it: È interessante notare che la maggior parte delle informazioni contenute nell'header non ha importanza nell'hardware reale (la dimensione della ROM è determinata solo dalla capacità del chip ROM nella cartuccia, non dal byte dell'header). In effetti, alcuni prototipi di ROM hanno informazioni errate sull'intestazione!

source: Most of the header was only used by Nintendo's manufacturing department to know what components to put in the cartridge when publishing a ROM. Thus, only ROMs sent to Nintendo had to have a fully correct header; ROMs used for internal testing only needed to pass the boot ROM's checks, explained further below.
it: La maggior parte dell'intestazione veniva utilizzata solo dal reparto di produzione di Nintendo per sapere quali componenti inserire nella cartuccia quando si pubblicava una ROM. Pertanto, solo le ROM inviate a Nintendo dovevano avere un'intestazione completamente corretta; le ROM utilizzate per i test interni dovevano solo superare i controlli della ROM di avvio, spiegati più avanti.
