Repository: c-fst/gb-asm-tutorial
Catalog: po/*.po
Languages: it

source: However, in our "modern" day and age, the header actually matters a lot. Emulators (including hardware emulators such as flashcarts) must emulate the hardware present in the cartridge. The header being the only source of information about what hardware the ROM's cartridge should contain, they rely on some of the values in the header.
it: Tuttavia, nella nostra epoca "moderna", l'intestazione è molto importante. Gli emulatori (compresi gli emulatori hardware come le flashcard) devono emulare l'hardware presente nella cartuccia. Essendo l'header l'unica fonte di informazioni sull'hardware che la cartuccia della ROM dovrebbe contenere, si basano su alcuni dei valori presenti nell'header.

source: ## Boot ROM
it: ## ROM di avvio

source: The header is intimately tied to what is called the **boot ROM**.
it: L'header è intimamente legato alla cosiddetta ** ROM di avvio**.

source: The most observant and/or nostalgic of you may have noticed the lack of the boot-up animation and the Game Boy's signature "ba-ding!" in BGB. When the console powers up, the CPU does not begin executing instructions at address $0100 (where our ROM's entry point is), but at $0000.
it: I più attenti e/o nostalgici avranno notato la mancanza dell'animazione di avvio e del caratteristico "ba-ding!" del Game Boy in BGB. Quando la console si accende, la CPU non inizia a eseguire le istruzioni all'indirizzo $0100 (dove si trova il punto di ingresso della ROM), ma a $0000.

source: However, at that time, a small program called the *boot ROM*, burned within the CPU's silicon, is "overlaid" on top of our ROM! The boot ROM is responsible for the startup animation, but it also checks the ROM's header! Specifically, it verifies that the Nintendo logo and header checksums are correct; if either check fails, the boot ROM intentionally *locks up*, and our game never gets to run :(
it: Tuttavia, in quel momento, un piccolo programma chiamato *boot ROM*, masterizzato all'interno del silicio della CPU, viene "sovrapposto" alla nostra ROM! La ROM di avvio è responsabile dell'animazione di avvio, ma controlla anche l'intestazione della ROM! In particolare, verifica che i checksum del logo Nintendo e dell'header siano corretti; se uno dei due controlli fallisce, la ROM di avvio si *blocca* intenzionalmente e il nostro gioco non potrà mai essere eseguito :(

source: ::: tip For the curious
it: ::: tip Per i curiosi

source: You can find a more detailed description of what the boot ROM does [in the Pan Docs](https://gbdev.io/pandocs/Power_Up_Sequence), as well as an explanation of the logo check. Beware that it is quite advanced, though.
it: È possibile trovare una descrizione più dettagliata di ciò che fa la ROM di avvio [nei Pan Docs](https://gbdev.io/pandocs/Power_Up_Sequence), nonché una spiegazione del controllo del logo. Attenzione, però, si tratta di un argomento piuttosto avanzato.

source: If you want to enable the boot ROMs in BGB, you must obtain a copy of the boot ROM(s), whose SHA256 checksums can be found [in their disassembly](https://github.com/ISSOtm/gb-bootroms/blob/master/sha256sums.txt) for verification. If you wish, you can also compile [SameBoy's boot ROMs](https://github.com/LIJI32/SameBoy#compilation) and use those instead, as a free-software substitute.
it: Se si desidera abilitare le ROM di avvio in BGB, è necessario ottenere una copia delle ROM di avvio, le cui checksum SHA256 possono essere trovate [nel loro disassemblaggio](https://github.com/ISSOtm/gb-bootroms/blob/master/sha256sums.txt) per la verifica. Se lo si desidera, si possono anche compilare [le ROM di avvio di SameBoy](https://github.com/LIJI32/SameBoy#compilation) e usarle al loro posto, come sostituto del software libero.

source: Then, in BGB's options, go to the `System` tab, set the paths to the boot ROMs you wish to use, tick `Enable bootroms`, select the appropriate system, and click `OK` or `Apply`. Now, just reset the emulator, and voilà!
it: Quindi, nelle opzioni di BGB, andare alla scheda `System`, impostare i percorsi delle ROM di avvio che si desidera utilizzare, spuntare `Enable bootroms`, selezionare il sistema appropriato e fare clic su `OK` o `Apply`. Ora basta resettare l'emulatore e voilà!

source: A header is typically called "valid" if it would pass the boot ROM's checks, and "invalid" otherwise.
it: Un'intestazione viene tipicamente definita "valida" se supera i controlli della ROM di avvio e "non valida" in caso contrario.

source: RGBFIX is the third component of RGBDS, whose purpose is to write a ROM's header. It is separate from RGBLINK so that it can be used as a stand-alone tool. Its name comes from that RGBLINK typically does not produce a ROM with a valid header, so the ROM must be "fixed" before it's production-ready.
it: RGBFIX è il terzo componente di RGBDS, il cui scopo è scrivere l'intestazione di una ROM. È separato da RGBLINK in modo da poter essere usato come strumento indipendente. Il suo nome deriva dal fatto che RGBLINK di solito non produce una ROM con un'intestazione valida, quindi la ROM deve essere "aggiustata" prima di essere pronta per la produzione.

source: RGBFIX has [a bunch of options](https://rgbds.gbdev.io/docs/rgbfix.1) to set various parts of the header; but the only two that we are using here are `-v`, which produces a **v**alid header (so, correct [Nintendo logo](https://gbdev.io/pandocs/The_Cartridge_Header.html#0104-0133---nintendo-logo) and [checksums](https://gbdev.io/pandocs/The_Cartridge_Header.html#014d---header-checksum)), and <code>-p&nbsp;0xFF</code>, which **p**ads the ROM to the next valid size (using $FF as the filler byte), and writes the appropriate value to the [ROM size byte](https://gbdev.io/pandocs/The_Cartridge_Header.html#0148---rom-size).
it: RGBFIX ha [un mucchio di opzioni](https://rgbds.gbdev.io/docs/rgbfix.1) per impostare varie parti dell'intestazione; ma le uniche due che usiamo qui sono `-v`, che produce un'intestazione **v**alida (quindi, [logo Nintendo](https://gbdev.io/pandocs/The_Cartridge_Header.html#0104-0133---nintendo-logo) e [checksums](https://gbdev.io/pandocs/The_Cartridge_Header.html#014d---header-checksum) corretti), e <code>-p&nbsp;0xFF</code>, che **p**a la ROM alla prossima dimensione valida (usando $FF come byte di riempimento), e scrive il valore appropriato nel [byte di dimensione della ROM](https://gbdev.io/pandocs/The_Cartridge_Header.html#0148---rom-size).

source: If you look at other projects, you may find RGBFIX invocations with more options, but these two should almost always be present.
it: Se si guarda ad altri progetti, si possono trovare invocazioni di RGBFIX con più opzioni, ma queste due dovrebbero essere quasi sempre presenti.

source: ## So, what's the deal with that line?
it: ## Allora, qual è il problema di questa linea?

source: Right! This line.
it: Giusto! Questa linea.

source: Well, let's see what happens if we remove it (or comment it out).
it: Vediamo cosa succede se lo rimuoviamo (o lo commentiamo).

source: (I am intentionally not running RGBFIX; we will see why in a minute.)
it: (Non sto intenzionalmente eseguendo RGBFIX; vedremo perché tra poco).

source: Make sure the boot ROMs are not enabled for this! If they are, make sure to disable them (untick their box in the options, click `OK` or `Apply`, and reset the emulator).
it: Assicurarsi che le ROM di avvio non siano abilitate per questo! Se lo sono, assicurarsi di disabilitarle (deselezionare la casella nelle opzioni, fare clic su `OK` o `Apply` e ripristinare l'emulatore).

source: !["This rom would not work on a real gameboy."](../assets/img/bad_warnings.png)
it: !["Questa rom non funzionerebbe su un vero gameboy."](../assets/img/bad_warnings.png)

source: As I explained, RGBFIX is responsible for writing the header, so we should use it to fix these warnings.
it: Come ho spiegato, RGBFIX è responsabile della scrittura dell'intestazione, quindi dovremmo usarlo per correggere questi avvertimenti.

source: ```console $ rgbfix -v -p 0xFF hello-world.gb warning: Overwrote a non-zero byte in the Nintendo logo warning: Overwrote a non-zero byte in the header checksum ```
it: ```console $ rgbfix -v -p 0xFF hello-world.gb warning: Sovrascritto un byte non nullo nel logo Nintendo warning: Sovrascritto un byte non nullo nel checksum dell'intestazione ````

source: *I'm sure these warnings are nothing to be worried about...* (Depending on your version of RGBDS, you may have gotten different warnings, or none at all.)
it: *Sono sicuro che questi avvisi non sono nulla di cui preoccuparsi...* (A seconda della versione di RGBDS in uso, è possibile che siano stati visualizzati avvisi diversi, o addirittura nessuno).

source: Let's run the ROM...
it: Eseguiamo la ROM...

source: ![Screenshot of BGB reporting "Unsupported RAM size"](../assets/img/unsupp_ram_size.png)
it: ![Schermata di BGB che segnala "Dimensione RAM non supportata"](../assets/img/unsupp_ram_size.png)

source: ... dismiss this pesky warning, and...
it: ... eliminare questo fastidioso avviso e...

source: <figure> <img src="../assets/img/invalid_opcode.png" alt="Screenshot of BGB's debugger, the title bar reads &quot;invalid opcode&quot;"> <figcaption> When the debugger pops open on its own, and the title bar reads "invalid opcode", you <em>might</em> have screwed up somewhere. </figcaption> </figure>
it: <figure> <img src="../assets/img/invalid_opcode.png" alt="Screenshot of BGB's debugger, the title bar reads &quot;invalid opcode&quot;"> <figcaption> Quando il debugger si apre da solo e la barra del titolo recita "invalid opcode", <em>potrebbe</em> aver sbagliato da qualche parte. </figcaption> </figure>

source: Okay, so, what happened?
it: Ok, allora, cos'è successo?

source: As we can see from the screenshot, PC is at $0105. What is it doing there?
it: Come si può vedere dallo screenshot, PC si trova a $0105. Cosa sta facendo lì?

source: ...Oh, `EntryPoint` is at $0103. So the `jp` at $0100 went there, and started executing instructions (`3E CE` is the raw form of `ld a, $CE`), but then $ED does not encode any valid instruction, so the CPU locks up.
it: ...Oh, `EntryPoint` è a $0103. Quindi il `jp` a $0100 è andato lì e ha iniziato a eseguire le istruzioni (`3E CE` è la forma grezza di `ld a, $CE`), ma poi $ED non codifica alcuna istruzione valida, quindi la CPU si blocca.

source: But why is `EntryPoint` there? Well, as you may have figured out from the warnings RGBFIX printed, it *overwrites* the header area in the ROM. However, RGBLINK is **not** aware of the header (because RGBLINK is not only used to generate ROMs!), so you must explicitly reserve space for the header area.
it: Ma perché `EntryPoint` è lì? Come avrete capito dagli avvisi stampati da RGBFIX, esso *sovrascrive* l'area dell'intestazione nella ROM. Tuttavia, RGBLINK non è a conoscenza dell'intestazione (perché RGBLINK non è usato solo per generare ROM!), quindi è necessario riservare esplicitamente spazio per l'area dell'intestazione.

source: Forgetting to reserve this space, and having a piece of code or data ending up there then overwritten, is a common beginner mistake that can be quite puzzling. Fortunately, RGBFIX since version 0.5.1 warns when it detects this mistake, as shown above.
it: Dimenticare di riservare questo spazio e far sì che un pezzo di codice o di dati finisca lì e poi venga sovrascritto è un errore comune dei principianti che può lasciare perplessi. Fortunatamente, RGBFIX dalla versione 0.5.1 avverte quando rileva questo errore, come mostrato sopra.

source: So, we prevent disaster like this:
it: Così, preveniamo disastri come questo:

source: The directive `ds` stands for "define space", and allows filling a range of memory. This specific line fills all bytes from $103 to $14F (inclusive) with the value $00. Since different pieces of code and/or data cannot overlap, this ensures that the header's memory range can safely be overwritten by RGBFIX, and that nothing else accidentally gets steamrolled instead.
it: La direttiva `ds` sta per "define space" e consente di riempire un intervallo di memoria. Questa riga specifica riempie tutti i byte da $103 a $14F (inclusi) con il valore $00. Poiché parti diverse di codice e/o di dati non possono sovrapporsi, questo assicura che l'intervallo di memoria dell'intestazione possa essere sovrascritto in modo sicuro da RGBFIX e che nessun altro venga accidentalmente sovrascritto.

source: It may not be obvious how this `ds` ends up filling that specific memory range. The 3-byte `jp` covers memory addresses $100, $101, and $102. (We start at $100 because that's where the `SECTION` is hardcoded to be.) When RGBASM processes the `ds` directive, `@` (which is a special symbol that evaluates to "the current address") thus has the value $103, so it fills `$150 - $103 = $4D` bytes with zeros, so $103, $104, ..., $14E, $14F.
it: Potrebbe non essere ovvio come questo `ds` finisca per riempire quello specifico intervallo di memoria. Il `jp` a 3 byte copre gli indirizzi di memoria $100, $101 e $102. (Iniziamo da $100 perché è dove si trova la `SECTION` definita manualmente). Quando RGBASM elabora la direttiva `ds`, `@` (che è un simbolo speciale che valuta "l'indirizzo corrente") ha quindi il valore $103, quindi riempie `$150 - $103 = $4D` byte con zeri, quindi $103, $104, ..., $14E, $14F.

source: ## Bonus: the infinite loop
it: ## Bonus: il ciclo infinito

source: (This is not really linked to the header, but I need to explain it somewhere, and here is as good a place as any.)
it: (Questo non è propriamente collegato all'intestazione, ma devo spiegarlo da qualche parte e questo è un posto come un altro).

source: You may also be wondering what the point of the infinite loop at the end of the code is for.
it: Ci si potrebbe anche chiedere a cosa serva il ciclo infinito alla fine del codice.

source: ```rgbasm Done: jp Done ```
it: ``rgbasm Fatto: jp Fatto ````

source: Well, simply enough, the CPU never stops executing instructions; so when our little Hello World is done and there is nothing left to do, we must still give the CPU some busy-work: so we make it do nothing, forever.
it: Semplicemente, la CPU non smette mai di eseguire istruzioni; quindi, quando il nostro piccolo Hello World è finito e non c'è più nulla da fare, dobbiamo comunque dare alla CPU un po' di lavoro: quindi le facciamo fare nulla, per sempre.

source: We cannot let the CPU just run off, as it would then start executing other parts of memory as code, possibly crashing. (See for yourself: remove or comment out these two lines, re-[compile the ROM](hello_world.md), and see what happens!)
it: Non possiamo lasciare che la CPU se ne vada, perché inizierebbe a eseguire altre parti della memoria come codice, con il rischio di bloccarsi. (Per verificare: rimuovete o commentate queste due righe, compilate nuovamente la ROM](hello_world.md) e vedete cosa succede).

source: # Operations & flags
it: # Operazioni e flag

source: Alright, we know how to pass values around, but just copying numbers is no fun; we want to modify them!
it: Va bene, sappiamo come passare i valori, ma copiare semplicemente i numeri non è divertente; vogliamo modificarli!

source: The GB CPU does not provide every operation under the sun (for example, there is no multiplication instruction), but we can just program those ourselves with what we have. Let's talk about some of the operations that it *does* have; I will be omitting some not used in the Hello World for now.
it: La CPU GB non fornisce tutte le operazioni sotto il sole (per esempio, non esiste un'istruzione di moltiplicazione), ma possiamo programmarle da soli con ciò che abbiamo. Parliamo di alcune delle operazioni di cui dispone; per ora ne ometterò alcune non utilizzate in Hello World.

source: ## Arithmetic
it: ## Aritmetica

source: The simplest arithmetic instructions the CPU supports are `inc` and `dec`, which INCrement and DECrement their operand, respectively. (If you aren't sure, "to increment" means "to add 1", and "to decrement" means "to subtract 1".) So for example, the `dec bc` at line 32 of `hello-world.asm` simply subtracts 1 from `bc`.
it: Le istruzioni aritmetiche più semplici supportate dalla CPU sono `inc` e `dec`, che rispettivamente INCrementano e DECrementano il loro operando. (Se non siete sicuri, "incrementare" significa "aggiungere 1" e "decrementare" significa "sottrarre 1"). Quindi, per esempio, il `dec bc` alla riga 32 di `hello-world.asm` sottrae semplicemente 1 da `bc`.

source: Okay, cool! Can we go a bit faster, though? Sure we can, with `add` and `sub`! These respectively ADD and SUBtract arbitrary values (either a constant, or a register). Neither is used in the tutorial, but a sibling of `sub`'s is: have you noticed little `cp` over at line 17? `cp` allows ComParing values. It works the same as `sub`, but it discards the result instead of writing it back. "Wait, so it does nothing?" you may ask; well, it *does* update the **flags**.
it: Ok, bene! Possiamo però andare un po' più veloci? Certo che sì, con `add` e `sub`! Questi rispettivamente aggiungono e sottraggono valori arbitrari (una costante o un registro). Nessuno dei due viene usato nel tutorial, ma c'è un parente di `sub`: avete notato il piccolo `cp` alla riga 17? `cp` permette di confrontare i valori. Funziona come `sub`, ma scarta il risultato invece di riscriverlo. "Aspettate, quindi non fa nulla?", vi chiederete; beh, aggiorna le **flag**.

source: ## Flags
it: ## Flag

source: The time has come to talk about the special-purpose register (remember those?) `f`, for, well, *flags*. The `f` register contains 4 bits, called "flags", which are updated depending on an operation's results. These 4 flags are:
it: È arrivato il momento di parlare del registro speciale (ve lo ricordate?) `f`, per, beh, *flag*. Il registro `f` contiene 4 bit, chiamati "flag", che vengono aggiornati a seconda dei risultati di un'operazione. Questi 4 flag sono:

source: Name | Description -----|--------------------- Z | Zero flag N | Addition/subtraction H | Half-carry C | Carry
it: Nome | Descrizione -----|--------------------- Z | Flag di zero N | Addizione/sottrazione H | Mezzo-carry C | Carry

source: Yes, there is a flag called "C" and a register called "c", and **they are different, unrelated things**. This makes the syntax a bit confusing at the beginning, but they are always used in different contexts, so it's fine.
it: Sì, esiste un flag chiamato "C" e un registro chiamato "c", e **sono cose diverse e non correlate**. Questo rende la sintassi un po' confusa all'inizio, ma vengono sempre usati in contesti diversi, quindi basta farci caso.

source: We will forget about N and H for now; let's focus on Z and C. Z is the simplest flag: it gets set when an operation's result is 0, and gets reset otherwise. C is set when an operation *overflows* or *underflows*.
it: Per ora dimentichiamo N e H; concentriamoci su Z e C. Z è il flag più semplice: viene impostato quando il risultato di un'operazione è 0 e viene azzerato altrimenti. C viene impostato quando un'operazione *sopravanza* (overflow) o *sottoavanza*.

source: What's an overflow? Let's take the simple instruction `add a, 42`. This simply adds 42 to the contents of register `a`, and writes the result back into `a`.
it: Che cos'è un overflow? Prendiamo la semplice istruzione `add a, 42`. Questa istruzione aggiunge semplicemente 42 al contenuto del registro `a` e scrive il risultato in `a`.

source: At the end of this snippet, `a` equals 200 + 42 = 242, great! But what if I write this instead?
it: Alla fine di questo snippet, `a` è uguale a 200 + 42 = 242, fantastico! Ma se invece scrivessi questo?

source: Well, one could think that `a` would be equal to 220 + 42 = 262, but that would be incorrect. Remember, `a` is an 8-bit register, *it can only store eight bits of information*! And if we were to write 262 in binary, we would get %100000110, which requires at least 9 bits... So what happens? Simply, that ninth bit is *lost*, and the value that we end up with is %00000110 = 6. This is called an *overflow*: after **adding**, we get a value **smaller** than what we started with.
it: Si potrebbe pensare che `a` sia uguale a 220 + 42 = 262, ma non sarebbe corretto. Ricordate che `a` è un registro a 8 bit, *può memorizzare solo otto bit di informazione*! E se dovessimo scrivere 262 in binario, otterremmo %100000110, che richiede almeno 9 bit... Quindi cosa succede? Semplicemente, il nono bit viene *perduto* e il valore che otteniamo è %00000110 = 6. Questo si chiama *overflow*. Questo si chiama *overflow*: dopo l'**aggiunta**, otteniamo un valore **più piccolo** di quello con cui abbiamo iniziato.

source: We can also do the opposite with `sub`, and&mdash;for example&mdash;subtract 42 from 6; as we know, for all `X` and `Y`, `X + Y - Y = X`, and we just saw that 220 + 42 = 6 (this is called *modulo 256 arithmetic*, by the way); so, 6 - 42 = (220 + 42) - 42 = 220. This is called an *underflow*: after **subtracting**, we get a value **greater** than what we started with.
it: Possiamo anche fare l'opposto con `sub`, e &mdash;per esempio&mdash; sottrarre 42 da 6; come sappiamo, per tutti gli `X` e `Y`, `X + Y - Y = X`, e abbiamo appena visto che 220 + 42 = 6 (questo è chiamato *modulo 256 aritmetico*, a proposito); quindi, 6 - 42 = (220 + 42) - 42 = 220. Questo si chiama *underflow*: dopo la **sottrazione**, otteniamo un valore **superiore** a quello di partenza.

source: When an operation is performed, it sets the carry flag if an overflow or underflow occurred, and clears it otherwise. (We will see later that not all operations update the carry flag, though.)
it: Quando si esegue un'operazione, si imposta il flag di carry se si è verificato un overflow o un underflow e lo si cancella altrimenti. (Vedremo più avanti che non tutte le operazioni aggiornano il flag di riporto).

source: ::: tip Summary
it: ::: punta Sintesi

source: - We can add and subtract numbers. - The Z flag lets us know if the result was 0. - However, registers can only store a limited range of integers. - Going outside this range is called an **overflow** or **underflow**, for addition and subtraction respectively. - The C flag lets us know if either occurred.
it: - Possiamo sommare e sottrarre numeri. - Il flag Z ci permette di sapere se il risultato è 0. - Tuttavia, i registri possono memorizzare solo un intervallo limitato di numeri interi. - L'uscita da questo intervallo è chiamata **overflow** o **underflow**, rispettivamente per l'addizione e la sottrazione. - Il flag C ci permette di sapere se si è verificato uno dei due casi.

source: ## Comparison
it: ## Confronto

source: Now, let's talk more about how `cp` is used to compare numbers. Here is a refresher: `cp` subtracts its operand from `a` and updates flags accordingly, but doesn't write the result back. We can use flags to check properties about the values being compared, and we will see in the next lesson how to use the flags.
it: Parliamo ora di come `cp` viene utilizzato per confrontare i numeri. Ecco un ripasso: `cp` sottrae il suo operando da `a` e aggiorna i flag di conseguenza, ma non scrive il risultato. Possiamo usare i flag per controllare le proprietà dei valori confrontati e vedremo nella prossima lezione come usarli.

source: The simplest interaction is with the Z flag. If it's set, we know that the subtraction yielded 0, i.e. `a - operand == 0`; therefore, `a == operand`! If it's not set, well, then we know that `a != operand`.
it: L'interazione più semplice è quella con il flag Z. Se è impostato, sappiamo che la sottrazione ha prodotto 0, cioè `a - operando == 0`; quindi, `a == operando`! Se non è impostato, allora sappiamo che `a = operando'.
