Repository: c-fst/gb-asm-tutorial
Catalog: po/*.po
Languages: it

source: Okay, checking for equality is nice, but we may also want to perform *comparisons*. Fret not, for the carry flag is here to do just that! See, when performing a subtraction, the carry flag gets set when the result goes below 0—but that's just a fancy way of saying "becomes negative"!
it: Ok, controllare l'uguaglianza è bello, ma potremmo anche voler eseguire dei *confronti*. Non preoccupatevi, perché il flag di riporto serve proprio a questo! Quando si esegue una sottrazione, il flag di riporto viene impostato quando il risultato scende sotto lo 0, ma è solo un modo elegante per dire "diventa negativo"!

source: So, when the carry flag gets set, we know that `a - operand < 0`, therefore that `a < operand`..! And, conversely, we know that if it's *not* set, `a >= operand`. Great!
it: Quindi, quando il flag di riporto viene impostato, sappiamo che `a - operando < 0`, quindi che `a < operando`...! E, al contrario, sappiamo che se non è impostato, `a >= operando`. Ottimo!

source: ## Instruction summary
it: ## Riassunto dell'istruzione

source: Instruction | Mnemonic | Effect ------------|----------|--------------------------------------------- Add | `add` | Adds values to `a` Subtract | `sub` | Subtracts values from `a` Compare | `cp` | Compares values with what's contained in `a`
it: Istruzione | Mnemonico | Effetto ------------|----------|--------------------------------------------- Add | `add` | Aggiunge valori a `a` Subtract | `sub` | Sottrae valori da `a` Compare | `cp` | Confronta valori con quelli contenuti in `a`

source: # Jumps
it: # salti

source: Once this lesson is done, we will be able to understand all of `CopyTiles`!
it: Una volta terminata questa lezione, saremo in grado di capire tutto di `CopyTiles`!

source: So far, all the code we have seen was linear: it executes top to bottom. But this doesn't scale: sometimes, we need to perform certain actions depending on the result of others ("if the crêpes start sticking, grease the pan again"), and sometimes, we need to perform actions repeatedly ("If there is some batter left, repeat from step 5").
it: Finora tutto il codice che abbiamo visto era lineare: veniva eseguito dall'alto verso il basso. Ma questo non è sufficiente: a volte è necessario eseguire alcune azioni in base al risultato di altre ("se le crêpes iniziano ad attaccarsi, ungi di nuovo la padella"), e a volte è necessario eseguire azioni ripetutamente ("se è rimasta della pastella, ripeti dal passo 5").

source: Both of these imply reading the recipe non-linearly. In assembly, this is achieved using *jumps*.
it: Entrambe le cose implicano una lettura non lineare della ricetta. Nell'assemblaggio, questo si ottiene con i *salti*.

source: The CPU has a special-purpose register called "PC", for Program Counter. It contains the address of the instruction currently being executed[^pc_updates], like how you'd keep in mind the number of the recipe step you're currently doing. PC increases automatically as the CPU reads instructions, so "by default" they are read sequentially; however, jump instructions allow writing a different value to PC, effectively *jumping* to another piece of the program. Hence the name.
it: La CPU dispone di un registro speciale chiamato "PC", che sta per Program Counter. Esso contiene l'indirizzo dell'istruzione in corso di esecuzione[^pc_updates], come se si tenesse a mente il numero del passo della ricetta che si sta eseguendo. Il PC aumenta automaticamente quando la CPU legge le istruzioni, quindi "per impostazione predefinita" vengono lette in sequenza; tuttavia, le istruzioni di salto consentono di scrivere un valore diverso nel PC, saltando di fatto a un'altra parte del programma. Da qui il nome.

source: Okay, so, let's talk about those jump instructions, shall we? There are four of them:
it: Ok, allora parliamo di queste istruzioni di salto, che ne dite? Ce ne sono quattro:

source: Instruction | Mnemonic | Effect --------------|----------|--------------------------------------------- Jump | `jp` | Jump execution to a location Jump Relative | `jr` | Jump to a location close by Call | `call` | Call a subroutine Return | `ret` | Return from a subroutine
it: Istruzione | Mnemonico | Effetto --------------|----------|--------------------------------------------- Jump | `jp` | Salta l'esecuzione a una locazione Jump Relativo | `jr` | Salta a una locazione vicina Call | `call` | Chiama una subroutine Return | `ret` | Ritorna da una subroutine

source: We will focus on `jp` for now. `jp`, such as the one line 5, simply sets PC to its argument, jumping execution there. In other words, after executing `jp EntryPoint` (line 5), the next instruction executed is the one below `EntryPoint` (line <!-- should be 9 + 1 --> 16).
it: Per ora ci concentreremo su `jp`. `jp`, come quello della riga 5, imposta semplicemente PC al suo argomento, saltando l'esecuzione a quel punto. In altre parole, dopo l'esecuzione di `jp EntryPoint` (riga 5), l'istruzione successiva eseguita è quella sotto `EntryPoint` (riga <!-- should be 9 + 1 --> 16).

source: You may be wondering what is the point of that specific `jp`. Don't worry, we will see later why it's required.
it: Ci si potrebbe chiedere a cosa serva questo specifico `jp`. Non preoccupatevi, vedremo più avanti perché è necessario.

source: ## Conditional jumps
it: ## Salti condizionati

source: Now to the *really* interesting part. Let's examine the loop responsible for copying tiles:
it: Passiamo ora alla parte *davvero* interessante. Esaminiamo il ciclo responsabile della copia delle tessere:

source: ```rgbasm,linenos,start=24 ; Copy the tile data ld de, Tiles ld hl, $9000 ld bc, TilesEnd - Tiles CopyTiles: ld a, [de] ld [hli], a inc de dec bc ld a, b or a, c jp nz, CopyTiles ```
it: ``rgbasm,linenos,start=24 ; Copia i dati delle piastrelle ld de, Tiles ld hl, $9000 ld bc, TilesEnd - Tiles CopyTiles: ld a, [de] ld [hli], a inc de dec bc ld a, b or a, c jp nz, CopyTiles ````

source: Don't worry if you don't quite get all the following, as we'll see it live in action in the next lesson. If you're having trouble, try going to the next lesson, watch the code execute step by step; then, coming back here, it should make more sense.
it: Non preoccupatevi se non capite bene quanto segue, perché lo vedremo in azione nella prossima lezione. Se avete problemi, provate ad andare alla prossima lezione e guardate il codice eseguito passo per passo; poi, tornando qui, dovrebbe avere più senso.

source: First, we copy `Tiles`, the address of the first byte of tile data, into `de`. Then, we set `hl` to $9000, which is the address where we will start copying the tile data to. `ld bc, TilesEnd - Tiles` sets `bc` to the length of the tile data: `TilesEnd` is the address of the first byte *after* the tile data, so subtracting `Tiles` to that yields the length.
it: Per prima cosa, copiamo `Tiles`, l'indirizzo del primo byte dei dati delle piastrelle, in `de`. Quindi, impostiamo `hl` a $9000, che è l'indirizzo in cui inizieremo a copiare i dati delle mattonelle. `ld bc, TilesEnd - Tiles` imposta `bc` sulla lunghezza dei dati delle tile: `TilesEnd` è l'indirizzo del primo byte *dopo* i dati delle mattonelle, quindi sottraendo `Tiles` a questo si ottiene la lunghezza.

source: So, basically:
it: Quindi, in pratica:

source: - `de` contains the address where data will be copied from; - `hl` contains the address where data will be copied to; - `bc` contains how many bytes we have to copy.
it: - `de` contiene l'indirizzo da cui verranno copiati i dati; - `hl` contiene l'indirizzo in cui verranno copiati i dati; - `bc` contiene il numero di byte da copiare.

source: Then we arrive at the main loop. We read one byte from the source (line 29), and write it to the destination (line 30). We increment the destination (via the implicit `inc hl` done by `ld [hli], a`) and source pointers (line 31), so the following loop iteration processes the next byte.
it: Arriviamo quindi al ciclo principale. Leggiamo un byte dalla sorgente (riga 29) e lo scriviamo nella destinazione (riga 30). Incrementiamo i puntatori alla destinazione (tramite l'implicito `inc hl` fatto da `ld [hli], a`) e alla sorgente (riga 31), in modo che la successiva iterazione del ciclo elabori il byte successivo.

source: Here's the interesting part: since we've just copied one byte, that means we have one less to go, so we `dec bc`. (We have seen `dec` two lessons ago; as a refresher, it simply decreases the value stored in `bc` by one.) Since `bc` contains the amount of bytes that still need to be copied, it's trivial to see that we should simply repeat the operation if `bc` != 0.
it: Ecco la parte interessante: poiché abbiamo appena copiato un byte, significa che ne abbiamo uno in meno, quindi `dec`. (Abbiamo già visto `dec` due lezioni fa; per rinfrescare la memoria, si tratta semplicemente di diminuire di uno il valore memorizzato in `bc`). Poiché `bc` contiene la quantità di byte che devono ancora essere copiati, è banale capire che dobbiamo semplicemente ripetere l'operazione se `bc` ;= 0.

source: `dec` usually updates flags, but unfortunately `dec bc` doesn't, so we must check if `bc` reached 0 manually.
it: `dec` di solito aggiorna i flag, ma sfortunatamente `dec bc` non lo fa, quindi dobbiamo controllare se `bc` ha raggiunto 0 manualmente.

source: `ld a, b` and `or a, c` "bitwise OR" `b` and `c` together; it's enough to know for now that it leaves 0 in `a` if and only if `bc` == 0. And `or` updates the Z flag! So, after line 34, the Z flag is set if and only if `bc` == 0, that is, if we should exit the loop.
it: `ld a, b` e `or a, c` "OR bitwise" `b` e `c` insieme; per ora è sufficiente sapere che lascia 0 in `a` se e solo se `bc` == 0. E `or` aggiorna il flag Z! Quindi, dopo la riga 34, il flag Z è impostato se e solo se `bc` == 0, cioè se dobbiamo uscire dal ciclo.

source: And this is where conditional jumps come into the picture! See, it's possible to **conditionally** "take" a jump depending on the state of the flags.
it: Ed è qui che entrano in gioco i salti condizionati! È possibile "prendere" incondizionatamente un salto a seconda dello stato dei flag.

source: There are four "conditions":
it: Le "condizioni" sono quattro:

source: Name | Mnemonic | Description ---------|----------|---------------------------------------------------- Zero | `z` | Z is set (last operation had a result of 0) Non-zero | `nz` | Z is not set (last operation had a non-zero result) Carry | `c` | C is set (last operation overflowed) No carry | `nc` | C is not set (last operation did not overflow)
it: Nome | Mnemonico | Descrizione ---------|----------|---------------------------------------------------- Zero | `z` | Z è impostato (l'ultima operazione ha avuto un risultato pari a 0) Non zero | `nz` | Z non è impostato (l'ultima operazione ha avuto un risultato non nullo) Carry | `c` | C è impostato (l'ultima operazione ha traboccato) No carry | `nc` | C non è impostato (l'ultima operazione non ha traboccato)

source: Thus, `jp nz, CopyTiles` can be read as "if the Z flag is not set, then jump to `CopyTiles`". Since we're jumping *backwards*, we will repeat the instructions again: we have just created a **loop**!
it: Quindi, `jp nz, CopyTiles` può essere letto come "se il flag Z non è impostato, allora salta a `CopyTiles`". Poiché stiamo saltando *all'indietro*, ripeteremo di nuovo le istruzioni: abbiamo appena creato un **loop**!

source: Okay, we've been talking about the code a lot, and we have seen it run, but we haven't really seen *how* it runs. Let's watch the magic unfold in slow-motion in the next lesson!
it: Ok, abbiamo parlato molto del codice e lo abbiamo visto girare, ma non abbiamo visto *come* gira. Guardiamo la magia che si svolge al rallentatore nella prossima lezione!

source: [^pc_updates]: Not exactly; instructions may be several bytes long, and PC increments after reading each byte. Notably, this means that when an instruction finishes executing, PC is pointing to the following instruction. Still, it's pretty much "where the CPU is currently reading from", but it's better to keep it simple and avoid mentioning instruction encoding for now.
it: [^pc_updates]: Non esattamente; le istruzioni possono essere lunghe diversi byte e PC si incrementa dopo aver letto ogni byte. In particolare, ciò significa che quando un'istruzione finisce di essere eseguita, PC punta all'istruzione successiva. Comunque, è più o meno "da dove la CPU sta leggendo", ma è meglio mantenere le cose semplici ed evitare di parlare della codifica delle istruzioni per ora.

source: # Tracing
it: # Tracciamento

source: Ever dreamed of being a wizard? Well, this won't give you magical powers, but let's see how emulators can be used to control time!
it: Avete mai sognato di essere un mago? Beh, questo non vi darà poteri magici, ma vediamo come gli emulatori possono essere usati per controllare il tempo!

source: First, make sure to focus the debugger window. Let's first explain the debugger's layout: ![](../assets/img/debugger.png) Top-left is the code viewer, bottom-left is the data viewer, top-right are some registers (as we saw in [the registers lesson](registers.html)), and bottom-right is the stack viewer. What's the stack? We will answer that question a bit later... in Part Ⅱ 😅
it: Per prima cosa, assicuratevi di mettere a fuoco la finestra del debugger. Spieghiamo innanzitutto il layout del debugger: ![](../assets/img/debugger.png) In alto a sinistra c'è il visualizzatore del codice, in basso a sinistra c'è il visualizzatore dei dati, in alto a destra ci sono alcuni registri (come abbiamo visto nella [lezione sui registri](registers.html)) e in basso a destra c'è il visualizzatore dello stack. Che cos'è lo stack? Risponderemo a questa domanda un po' più tardi... nella Parte Ⅱ 😅

source: ## Setup
it: ## Impostazione

source: For now, let's focus on the code viewer. If you focus the debugger while the emulator is running, it will pause, as indicated by the screen window's title changing to `bgb (debugging)`.
it: Per ora concentriamoci sul visualizzatore di codice. Se si mette a fuoco il debugger mentre l'emulatore è in esecuzione, questo viene messo in pausa, come indicato dal titolo della finestra dello schermo che cambia in `bgb (debug)`.

source: Okay, but what's with this weird syntax? Well, there are several syntaxes for Game Boy assembly, and BGB doesn't use RGBDS' by default. We can fix that in the options, which we can access by either: - Right-clicking the screen and selecting "Options" - In the debugger, open the "Window" menu, and select "Options" - Press <kbd><kbd>F11</kbd></kbd> while focusing either the screen or debugger
it: Ok, ma perché questa strana sintassi? Esistono diverse sintassi per l'assemblaggio del Game Boy e BGB non usa RGBDS' per impostazione predefinita. Possiamo risolvere il problema nelle opzioni, a cui si può accedere: - Cliccando con il tasto destro del mouse sullo schermo e selezionando "Opzioni" - Nel debugger, aprire il menu "Finestra" e selezionare "Opzioni" - Premere <kbd><kbd>F11</kbd></kbd> mentre si mette a fuoco lo schermo o il debugger

source: BGB has a *ton* of options, but don't worry, it's got good defaults, so we don't need to look at most of them for now. Select the "Debug" tab, and set "Disasm syntax" to "rgbds". Oh, and check the "Local symbols" box, too. Now, click "OK" to apply the options.
it: BGB ha una *tonnellata* di opzioni, ma non preoccupatevi, ha delle buone impostazioni predefinite, quindi non è necessario esaminarne la maggior parte per ora. Selezionate la scheda "Debug" e impostate "Disasm syntax" su "rgbds". E spuntate anche la casella "Simboli locali". Ora fate clic su "OK" per applicare le opzioni.

source: ![Screenshot of the options window](../assets/img/options.png)
it: ![Schermata della finestra delle opzioni](../assets/img/options.png)

source: You can also customize a lot of key bindings in the options, but I will stick to the default ones for this tutorial for the sake of simplicity.
it: Nelle opzioni è possibile personalizzare molti collegamenti ai tasti, ma in questo tutorial mi atterrò a quelli predefiniti per semplicità.

source: Alright, great! But where are the labels? Well, as we have seen a couple of lessons ago, labels are merely a convenience provided by RGBASM, but they are not part of the ROM itself. It is very much inconvenient to debug without them, and so sym files (for "**sym**bols") have been developed. Let's run RGBLINK to generate a sym file for our ROM:
it: D'accordo, fantastico! Ma dove sono le etichette? Come abbiamo visto un paio di lezioni fa, le etichette sono solo una comodità fornita da RGBASM, ma non fanno parte della ROM stessa. È molto scomodo eseguire il debug senza di esse, quindi sono stati sviluppati i file sym (per "**sym**bols"). Eseguiamo RGBLINK per generare un file sym per la nostra ROM:

source: The file names matter! When looking for a ROM's sym file, BGB takes the ROM's file name, strips the extension (here, `.gb`), replaces it with `.sym`, and looks for a file **in the same directory** with that name.
it: I nomi dei file sono importanti! Quando si cerca il file sym di una ROM, BGB prende il nome del file della ROM, elimina l'estensione (in questo caso, `.gb`), la sostituisce con `.sym` e cerca un file **nella stessa directory** con quel nome.

source: Then, in the debugger, we can go in the "File" menu and select "reload SYM file".
it: Quindi, nel debugger, possiamo andare nel menu "File" e selezionare "ricarica file SYM".

source: ![Screenshot of the debugger showing the labels in the code viewer](../assets/img/labels.png)
it: ![Schermata del debugger che mostra le etichette nel visualizzatore di codice](../assets/img/labels.png)

source: Much better!
it: Molto meglio!

source: If a sym file is loaded, pressing <kbd><kbd>Tab</kbd></kbd> allows toggling whether labels are displayed or not.
it: Se è stato caricato un file sym, premendo <kbd><kbd>Tab</kbd></kbd> si può scegliere se visualizzare o meno le etichette.

source: ## Stepping
it: ## Passo

source: When pausing execution, the debugger will automatically focus on the instruction the CPU is about to execute, as indicated by the line highlighted in blue. ![Screenshot of the debugger showing that the highlighted line corresponds to PC](../assets/img/pc.png)
it: Quando si mette in pausa l'esecuzione, il debugger si concentra automaticamente sull'istruzione che la CPU sta per eseguire, come indicato dalla riga evidenziata in blu. ![Schermata del debugger che mostra che la riga evidenziata corrisponde a PC](../assets/img/pc.png)

source: The instruction highlighted in blue is always what the CPU is *about to execute*, not what it *just executed*. Keep this in mind.
it: L'istruzione evidenziata in blu è sempre quella che la CPU sta per eseguire, non quella che ha appena eseguito. Tenetelo a mente.

source: If we want to watch execution from the beginning, we need to reset the emulator. Go into the debugger's "Run" menu, and select "Reset", or tap your numpad's <kbd><kbd>\*</kbd></kbd> key.
it: Se si desidera osservare l'esecuzione dall'inizio, è necessario resettare l'emulatore. Accedere al menu "Esegui" del debugger e selezionare "Reset", oppure toccare il tasto <kbd><kbd>\*</kbd></kbd> del tastierino numerico.

source: The blue line should automatically move to address $0100[^boot_addr], and now we're ready to trace! All the commands for that are in the "Run" menu.
it: La linea blu dovrebbe spostarsi automaticamente all'indirizzo $0100[^boot_addr] e ora siamo pronti a tracciare! Tutti i comandi per farlo si trovano nel menu "Esegui".

source: - "Run" simply unpauses the emulator. Clicking on the screen also does the same. - "Trace" (more commonly known as "Step Into") and "Step Over" advance the emulator by one instruction. They only really differ on the `call` instruction and interrupts, neither of which we are using here, so we will use "Trace". - The other options are not relevant for now.
it: - "Esegui" semplicemente disattiva l'emulatore. Anche facendo clic sullo schermo si ottiene lo stesso risultato. - "Trace" (più comunemente noto come "Step Into") e "Step Over" fanno avanzare l'emulatore di un'istruzione. Si differenziano solo per l'istruzione `call` e per gli interrupt, che non utilizzeremo in questo caso, quindi useremo "Trace". - Le altre opzioni non sono rilevanti per ora.

source: We will have to "Trace" a bunch of times, so it's a good idea to use the key shortcut. If we press <kbd><kbd>F7</kbd></kbd> once, the `jp EntryPoint` is executed. And if we press it a few more times, can see the instructions being executed, one by one!
it: Dovremo "Tracciare" un sacco di volte, quindi è una buona idea usare la scorciatoia da tastiera. Se premiamo una volta <kbd><kbd>F7</kbd></kbd> , viene eseguito il `jp EntryPoint'. E se lo premiamo altre volte, possiamo vedere l'esecuzione delle istruzioni, una per una!

source: Now, you may notice the `WaitVBlank` loop runs a *lot* of times, but what we are interested in is the `CopyTiles` loop. We can easily skip over it in several ways; this time, we will use a *breakpoint*. We will place the breakpoint on the `ld de, Tiles` at `00:0162`; either double-click on that line, or select it and press <kbd><kbd>F2</kbd></kbd>. The line will turn red:
it: Ora, si può notare che il ciclo `WaitVBlank` viene eseguito *molte* volte, ma ciò che ci interessa è il ciclo `CopyTiles`. Possiamo facilmente saltarlo in diversi modi; questa volta useremo un *breakpoint*. Posizioneremo il punto di interruzione su `ld de, Tiles` a `00:0162`; fate doppio clic su quella riga, oppure selezionatela e premete <kbd><kbd>F2</kbd></kbd>. La riga diventerà rossa:

source: ![Debugger screenshot showcasing the breakpoint](../assets/img/breakpoint.png)
it: ![Schermata del debugger che mostra il punto di interruzione](../assets/img/breakpoint.png)

source: Then you can resume execution either by clicking the screen or pressing <kbd><kbd>F9</kbd></kbd>, and BGB will automatically pause. Whenever BGB is running, and the (emulated) CPU is about to execute an instruction a breakpoint was placed on, it automatically pauses.
it: Quindi è possibile riprendere l'esecuzione facendo clic sullo schermo o premendo <kbd><kbd>F9</kbd></kbd>, e BGB si metterà automaticamente in pausa. Ogni volta che BGB è in esecuzione e la CPU (emulata) sta per eseguire un'istruzione su cui è stato posizionato un breakpoint, si mette automaticamente in pausa.

source: ![Debugger screenshot showcasing execution paused on the breakpoint](../assets/img/bkpt_pause.png)
it: ![Schermata del debugger che mostra l'esecuzione in pausa sul punto di interruzione](../assets/img/bkpt_pause.png)

source: You can see where execution is being paused both from the green arrow and the value of PC.
it: La freccia verde e il valore di PC indicano il punto in cui l'esecuzione è in pausa.

source: If we trace the next three instructions, we can see the three arguments to the `CopyTiles` loop getting loaded into registers.
it: Se tracciamo le tre istruzioni successive, possiamo vedere che i tre argomenti del ciclo `CopyTiles` vengono caricati nei registri.

source: ![The state of some registers at the beginning of the CopyTiles loop](../assets/img/regs_copytiles.png)
it: ![Lo stato di alcuni registri all'inizio del ciclo CopyTiles](../assets/img/regs_copytiles.png)

source: For fun, let's watch the tiles as they're being copied. For that, obviously, we will use the data viewer, and position it at the destination. As we can see from the image above, that would be $9000!
it: Per divertimento, osserviamo le tessere mentre vengono copiate. Per questo, ovviamente, utilizzeremo il visualizzatore di dati e lo posizioneremo sulla destinazione. Come si può vedere dall'immagine qui sopra, si tratta di 9000 dollari!
