Repository: c-fst/gb-asm-tutorial
Catalog: po/*.po
Languages: it

source: Select the data viewer (either click somewhere in it, or use <kbd><kbd>Ctrl</kbd>+<kbd>Tab</kbd></kbd> to switch focus, as indicated by the grey bar on the left), and press Ctrl+G (for "Goto"). In the popup, type the address you wish to go to, in our case `9000` (sans dollar sign!!).
it: Selezionate il visualizzatore di dati (fate clic da qualche parte o usate <kbd><kbd>Ctrl</kbd>+<kbd>Tab</kbd></kbd> per cambiare il focus, come indicato dalla barra grigia a sinistra) e premete Ctrl+G (per "Goto"). Nel popup, digitate l'indirizzo a cui volete andare, nel nostro caso `9000` (senza il segno del dollaro!!).

source: Awesome, right?
it: Fantastico, vero?

source: ## What next?
it: ## E poi?

source: Congrats, you have just learned how to use a debugger! We have only scratched the surface, though; we will use more of BGB's tools to illustrate the next parts. Don't worry, from here on, lessons will go with a lot more images—you've made it through the hardest part!
it: Congratulazioni, avete appena imparato a usare un debugger! Abbiamo però solo scalfito la superficie; utilizzeremo altri strumenti di BGB per illustrare le prossime parti. Non preoccupatevi, da qui in poi le lezioni saranno accompagnate da molte più immagini: avete superato la parte più difficile!

source: [^boot_addr]: Why does execution start at $0100? That's because it's where the [boot ROM](https://gbdev.io/pandocs/Power_Up_Sequence) hands off control to our game once it's done.
it: [^boot_addr]: Perché l'esecuzione inizia da $0100? Perché è il punto in cui la [ROM di avvio](https://gbdev.io/pandocs/Power_Up_Sequence) cede il controllo al nostro gioco una volta terminato.

source: # Tiles
it: # piastrelle

source: "Tiles" were called differently in documentation of yore. They were usually called "patterns" or "characters", the latter giving birth to the "CHR" abbreviation which is sometimes used to refer to tiles.
it: Le "tessere" venivano chiamate in modo diverso nella documentazione di un tempo. Di solito venivano chiamate "schemi" o "caratteri", e quest'ultima abbreviazione ha dato origine all'abbreviazione "CHR" che a volte viene usata per riferirsi alle tessere.

source: For example, on the NES, tile data is usually provided by the cartridge in either [CHR ROM or CHR RAM](http://wiki.nesdev.com/w/index.php/CHR_ROM_vs._CHR_RAM). The term "CHR" is typically not used on the Game Boy, though exchanges between communities cause terms to "leak", so some refer to the area of VRAM where tiles are stored as "CHR RAM" or "CHR VRAM", for example.
it: Ad esempio, sul NES, i dati dei tile sono solitamente forniti dalla cartuccia in [CHR ROM o CHR RAM](http://wiki.nesdev.com/w/index.php/CHR_ROM_vs._CHR_RAM). Il termine "CHR" non è tipicamente utilizzato sul Game Boy, anche se gli scambi tra le comunità fanno sì che i termini "trapelino", per cui alcuni si riferiscono all'area della VRAM in cui sono memorizzati i tile come "CHR RAM" o "CHR VRAM", ad esempio.

source: As with all such jargon whose meaning may depend on who you are talking to, I will stick to "tiles" across this entire tutorial for consistency, being what is the most standard in the GB dev community now.
it: Come per tutti i gerghi di questo tipo, il cui significato può dipendere dall'interlocutore, per coerenza mi atterrò a "piastrelle" in tutto il tutorial, essendo ormai lo standard più diffuso nella comunità degli sviluppatori di GB.

source: Well, copying this data blindly is fine and dandy, but why exactly is the data "graphics"?
it: Copiare questi dati alla cieca va benissimo, ma perché i dati sono "grafici"?

source: <figure> <img src="../assets/img/ah_yes_pixels.png" alt="Screenshot of some tile definitions in the code"> <figcaption><q>Ah, yes, pixels.</q></figcaption> </figure>
it: <figure> <img src="../assets/img/ah_yes_pixels.png" alt="Screenshot of some tile definitions in the code"> <figcaption><q>Ah, sì, i pixel.</q></figcaption> </figure>

source: Let's see about that!
it: Vediamo un po'!

source: ## Helpful hand
it: ## Mano utile

source: Now, figuring out the format with an explanation alone is going to be very confusing; but fortunately, BGB got us covered thanks to its *VRAM viewer*. You can open it either by selecting "Window" then "VRAM viewer", or pressing F5 when the debugger is in focus. It is also in "Other" in the screen's right-click menu.
it: Ora, capire il formato con la sola spiegazione sarà molto confuso; ma fortunatamente, BGB ci ha coperto grazie al suo *VRAM viewer*. È possibile aprirlo selezionando "Finestra" e poi "Visualizzatore VRAM", oppure premendo F5 quando il debugger è in primo piano. Si trova anche in "Altro" nel menu del tasto destro del mouse.

source: ![Screenshot of the VRAM viewer's "Tiles" tab](../assets/img/vram_viewer.png)
it: ![Schermata della scheda "Tiles" del visualizzatore VRAM](../assets/img/vram_viewer.png)

source: By default, it should open on the "Tiles" tab like in the image, but if not, please select that. We will come to the other tabs in due time. This one shows the tiles present in the Game Boy's video memory (or "<abbr title="Video RAM">VRAM</abbr>").
it: Per impostazione predefinita, dovrebbe aprirsi la scheda "Piastrelle" come nell'immagine, ma se non è così, selezionatela. Le altre schede verranno presentate a tempo debito. Questa scheda mostra le piastrelle presenti nella memoria video del Game Boy (o "<abbr title="Video RAM">VRAM</abbr>").

source: I encourage you to experiment with the VRAM viewer, hover over things, tick and untick checkboxes, see by yourself what's what. Any questions you might have will be answered in due time, don't worry! And if what you're seeing later on doesn't match my screenshots, ensure that the checkboxes match mine.
it: Vi invito a sperimentare con il visualizzatore di VRAM, a passare il mouse sulle cose, a spuntare e deselezionare le caselle di controllo, a vedere da soli come stanno le cose. Tutte le domande che vi verranno poste troveranno risposta a tempo debito, non preoccupatevi! E se quello che vedete in seguito non corrisponde alle mie schermate, assicuratevi che le caselle di controllo corrispondano alle mie.

source: Don't mind the "Nintendo" in the top-left; we did not put it there ourselves, and we will see why it's there later. We will also be ignoring the right half of the tile grid, as it is exclusive to the Game Boy Color: we will get there when we get there.
it: Non fate caso alla scritta "Nintendo" in alto a sinistra: non l'abbiamo messa noi, e vedremo più avanti perché si trova lì. Ignoreremo anche la metà destra della griglia delle piastrelle, in quanto esclusiva del Game Boy Color: ci arriveremo quando ci arriveremo.

source: ## Short primer
it: ## Primer breve

source: You may have heard of tiles before, especially as they were really popular in 8-bit and 16-bit systems. That's no coincidence: tiles are very useful. Instead of storing every on-screen pixel (144 × 160 pixels × 2 bits/pixel = 46080 bits = 5760 bytes, compared to the console's 8192 bytes of VRAM), pixels are grouped into tiles, and then tiles are assembled in various ways to produce the final image.
it: Potreste aver già sentito parlare di tiles, soprattutto perché erano molto popolari nei sistemi a 8 e 16 bit. Non è una coincidenza: i tiles sono molto utili. Invece di memorizzare ogni pixel sullo schermo (144 × 160 pixel × 2 bit/pixel = 46080 bit = 5760 byte, rispetto agli 8192 byte di VRAM della console), i pixel vengono raggruppati in tile, che vengono poi assemblati in vari modi per produrre l'immagine finale.

source: In particular, tiles can be reused very easily and at basically no cost, saving a lot of memory! In addition, manipulating whole tiles at once is much cheaper than manipulating the individual pixels, so this spares processing time as well.
it: In particolare, le tessere possono essere riutilizzate molto facilmente e praticamente a costo zero, risparmiando molta memoria! Inoltre, la manipolazione di intere tessere in una sola volta è molto più economica rispetto alla manipolazione dei singoli pixel, e questo fa risparmiare tempo di elaborazione.

source: The concept of a "tile" is very general, but on the Game Boy, tiles are *always* 8 by 8 pixels. Often, hardware tiles are grouped to manipulate them as larger tiles (often 16×16); to avoid the confusion, those are referred to as **meta-tiles**.
it: Il concetto di "piastrella" è molto generico, ma sul Game Boy le piastrelle sono *sempre* di 8 per 8 pixel. Spesso le tessere hardware vengono raggruppate per essere manipolate come tessere più grandi (spesso 16×16); per evitare la confusione, queste vengono chiamate **meta-tessere**.

source: You may be wondering where that "2 bits/pixel" figure earlier came from... This is something called "bit depth".
it: Vi starete chiedendo da dove provenga la cifra di "2 bit/pixel" di cui sopra... Si tratta della cosiddetta "profondità di bit".

source: See, colors are *not* stored in the tiles themselves! Instead, it works like a coloring book: the tile itself contains 8 by 8 *indices*, not colors; you give the hardware a tile and a set of colors—a **palette**—and it colorizes them! (This is also why color swaps were very common back then: you could create enemy variations by storing tiny palettes instead of large different graphics.)
it: I colori non sono memorizzati nelle tessere stesse! Invece, funziona come un libro da colorare: la piastrella stessa contiene *indici* di 8 x 8, non colori; si dà all'hardware una piastrella e un insieme di colori - una **paletta** - e lui li colora! (Questo è anche il motivo per cui gli scambi di colore erano molto comuni all'epoca: si potevano creare variazioni nemiche memorizzando piccole tavolozze invece di grandi grafiche diverse).

source: Anyway, as it is, Game Boy palettes are 4 colors large.[^pal_size] This means that the indices into those palettes, stored in the tiles, can be represented in only *two bits*! This is called "2 bits per pixel", noted "2bpp".
it: In ogni caso, le tavolozze del Game Boy sono grandi 4 colori.[^pal_size] Ciò significa che gli indici di tali tavolozze, memorizzati nelle tessere, possono essere rappresentati con soli *due bit*! Questo è chiamato "2 bit per pixel", noto come "2bpp".

source: With that in mind, we are ready to explain how these bytes turn into pixels!
it: Con queste premesse, siamo pronti a spiegare come questi byte si trasformano in pixel!

source: ## Encoding
it: ## Codifica

source: As I explained, each pixel takes up 2 bits. Since there are 8 bits in a byte, you might expect each byte to contain 4 pixels... and you would be neither entirely right, nor entirely wrong. See, each row of 8 pixels is stored in 2 bytes, but neither of these bytes contains the info for 4 pixels. (Think of it like a 10 € banknote torn in half: neither half is worth anything, but the full bill is worth, well, 10 €.)
it: Come ho spiegato, ogni pixel occupa 2 bit. Poiché ci sono 8 bit in un byte, ci si potrebbe aspettare che ogni byte contenga 4 pixel... e non sarebbe né del tutto giusto né del tutto sbagliato. Ogni riga di 8 pixel è memorizzata in 2 byte, ma nessuno di questi byte contiene le informazioni per 4 pixel. (Pensate a una banconota da 10 € strappata a metà: nessuna delle due metà ha valore, ma la banconota intera vale, beh, 10 €).

source: For each pixel, the least significant bit of its index is stored in the first byte, and the most significant bit is stored in the second byte. Since each byte is a collection of one of the bits for each pixel, it's called a **bitplane**.
it: Per ogni pixel, il bit meno significativo del suo indice è memorizzato nel primo byte, mentre il bit più significativo è memorizzato nel secondo byte. Poiché ogni byte è una raccolta di uno dei bit di ciascun pixel, viene chiamato **bitplane**.

source: The leftmost pixel is stored in the leftmost bit of both bytes, the pixel to its right in the second leftmost bit, and so on. The first pair of bytes stores the topmost row, the second byte the row below that, and so on.
it: Il pixel più a sinistra è memorizzato nel bit più a sinistra di entrambi i byte, il pixel alla sua destra nel secondo bit più a sinistra e così via. La prima coppia di byte memorizza la riga superiore, il secondo byte quella inferiore e così via.

source: Here is a more visual demonstration; note that it's for the SNES, but its 2BPP format is the same as the Game Boy's.
it: Ecco una dimostrazione più visiva; si noti che è per il SNES, ma il suo formato 2BPP è lo stesso del Game Boy.

source: This encoding may seem a little weird at first, and it can be; it's made to be more convenient for the hardware to decode, keeping the circuitry simple and low-power. It even makes a few cool tricks possible, as we will see (much) later!
it: Questa codifica può sembrare un po' strana all'inizio, e può esserlo; è fatta per essere più conveniente per l'hardware da decodificare, mantenendo la circuiteria semplice e a basso consumo. Rende possibili anche alcuni trucchi interessanti, come vedremo (molto) più avanti!

source: You can read up more about the encoding [in the Pan Docs](https://gbdev.io/pandocs/Tile_Data.html) and [ShantyTown's site](https://www.huderlem.com/demos/gameboy2bpp.html).
it: Si possono trovare ulteriori informazioni sulla codifica [nei Pan Docs](https://gbdev.io/pandocs/Tile_Data.html) e [nel sito di ShantyTown](https://www.huderlem.com/demos/gameboy2bpp.html).

source: In the next lesson, we shall see how colors are applied!
it: Nella prossima lezione vedremo come si applicano i colori!

source: [^pal_size]: Other consoles can have varying bit depths; for example, the SNES has 2bpp, 4bpp, and 8bpp depending on the graphics mode and a few other parameters.
it: [^pal_size]: Altre console possono avere profondità di bit diverse; ad esempio, lo SNES ha 2bpp, 4bpp e 8bpp a seconda della modalità grafica e di alcuni altri parametri.

source: # Palettes
it: # Palette

source: In the previous lesson, I briefly mentioned that colors are applied to tiles via *palettes*, but we haven't talked much about those yet.
it: Nella lezione precedente, ho accennato brevemente al fatto che i colori vengono applicati alle piastrelle tramite le *palette*, ma non ne abbiamo ancora parlato molto.

source: The black & white Game Boy has three palettes, one for the background called [`BGP`](https://gbdev.io/pandocs/Palettes.html#ff47---bgp-bg-palette-data-rw---non-cgb-mode-only) ("BackGround Palette"), and two for the objects called [`OBP0`](https://gbdev.io/pandocs/Palettes.html#ff48---obp0-object-palette-0-data-rw---non-cgb-mode-only) and [`OBP1`](https://gbdev.io/pandocs/Palettes.html#ff48---obp1-object-palette-1-data-rw---non-cgb-mode-only) ("OBject Palette 0/1"). If you are wondering what "objects" are, you will have to wait until Part Ⅱ to find out; for now, let's focus on the background.
it: Il Game Boy in bianco e nero ha tre tavolozze, una per lo sfondo chiamata [`BGP`](https://gbdev.io/pandocs/Palettes.html#ff47---bgp-bg-palette-data-rw---non-cgb-mode-only) ("BackGround Palette"), e due per gli oggetti chiamate [`OBP0`](https://gbdev.io/pandocs/Palettes.html#ff48---obp0-object-palette-0-data-rw---non-cgb-mode-only) e [`OBP1`](https://gbdev.io/pandocs/Palettes.html#ff48---obp1-object-palette-1-data-rw---non-cgb-mode-only) ("OBject Palette 0/1"). Se vi state chiedendo cosa siano gli "oggetti", dovrete aspettare la Parte Ⅱ per scoprirlo; per ora, concentriamoci sullo sfondo.

source: The Game Boy Color introduced, obviously, colors, and this was mainly done by reworking the way palettes are handled. We will not talk about Game Boy Color features in Part Ⅰ for the sake of simplicity, but we will do so in later parts.
it: Il Game Boy Color ha introdotto, ovviamente, i colori e questo è stato fatto principalmente rielaborando il modo in cui vengono gestite le tavolozze. Non parleremo delle caratteristiche del Game Boy Color nella Parte Ⅰ per semplicità, ma lo faremo nelle parti successive.

source: Please select the "Palettes" tab of BGB's VRAM viewer.
it: Selezionare la scheda "Palette" del visualizzatore VRAM di BGB.

source: ![Screenshot of the VRAM viewer's Palette tab](../assets/img/pal_viewer.png)
it: ![Schermata della scheda Palette del visualizzatore VRAM](../assets/img/pal_viewer.png)

source: The VRAM viewer's layout may seem weird. As mentioned in the previous tip box, the Game Boy Color changed the way palettes work, and the Super Game Boy throws another wrench into the mix.
it: Il layout del visualizzatore VRAM può sembrare strano. Come accennato nel precedente riquadro, il Game Boy Color ha cambiato il modo in cui funzionano le tavolozze, e il Super Game Boy ha dato un'ulteriore svolta alla situazione.

source: The VRAM viewer uses the same layout for monochrome and Color, leading to this admittedly strange layout.
it: Il visualizzatore VRAM utilizza lo stesso layout per il monocromatico e per il colore, dando origine a questa strana disposizione.

source: We will be taking a look at the "BGP" line. As I explained before, tiles store "color indices" for each pixel, which are used to index into the palette. Color number 0[^numbering_zero] is the leftmost in that line, and number 3 is the rightmost.
it: Daremo un'occhiata alla linea "BGP". Come ho spiegato in precedenza, i riquadri memorizzano gli "indici di colore" per ciascun pixel, che vengono utilizzati per indicizzare la tavolozza. Il colore numero 0[^numerazione_zero] è il più a sinistra in questa riga e il numero 3 è il più a destra.

source: So, in our case, color number 0 is "white", color number 1 is "light gray", number 2 is "dark gray", and number 3 "black". I put air quotes because "black" isn't true black, and "white" isn't true white. Further, note that the original Game Boy had shades of green, but the later Game Boy Pocket's screen produced shades of gray instead. And, even better, the Game Boy Color will automatically colorize games that lack Game Boy Color support!
it: Quindi, nel nostro caso, il colore numero 0 è "bianco", il numero 1 è "grigio chiaro", il numero 2 è "grigio scuro" e il numero 3 "nero". Ho messo le virgolette perché "nero" non è il vero nero e "bianco" non è il vero bianco. Inoltre, si noti che il Game Boy originale aveva sfumature di verde, mentre lo schermo del successivo Game Boy Pocket produceva sfumature di grigio. Inoltre, il Game Boy Color è in grado di colorare automaticamente i giochi che non supportano il Game Boy Color!

source: ![Screenshot of our Hello World, automatically colorized by the Game Boy Color](../assets/img/hello_world_autocolor.png)
it: ![Schermata del nostro Hello World, colorato automaticamente dal Game Boy Color](../assets/img/hello_world_autocolor.png)

source: All this to say, one shouldn't expect specific colors out of a Game Boy game[^console_detection], just four more or less bright colors.
it: Tutto questo per dire che non ci si deve aspettare colori specifici da un gioco per Game Boy[^console_detection], ma solo quattro colori più o meno brillanti.

source: ## Getting our hands dirty
it: ## Sporcarsi le mani

source: Well, so far in this tutorial, besides running the Hello World, we have been pretty passive, watching it unfold. What do you say we start prodding the ROM a bit?
it: Finora in questo tutorial, a parte l'esecuzione di Hello World, siamo stati piuttosto passivi, osservando il suo svolgimento. Che ne dite se iniziamo a smuovere un po' la ROM?

source: In BGB's debugger, select the "Window" menu, and open the "IO map" (or just press <kbd><kbd>F10</kbd></kbd> within the debugger).
it: Nel debugger di BGB, selezionare il menu "Finestra" e aprire la "Mappa IO" (oppure premere semplicemente <kbd><kbd>F10</kbd></kbd> all'interno del debugger).

source: ![Screenshot of the IO map](../assets/img/io_map.png)
it: ![Schermata della mappa IO](../assets/img/io_map.png)

source: While the VRAM viewer offers a visual representation of the palette, the IO map shows the nitty-gritty: how it's encoded. The IO map also lets us modify BGP easily; but to do so, we need to understand *how* values we write are turned into colors.
it: Mentre il visualizzatore di VRAM offre una rappresentazione visiva della tavolozza, la mappa IO mostra il dettaglio: come viene codificata. La mappa IO ci permette anche di modificare facilmente il BGP; ma per farlo, dobbiamo capire *come* i valori che scriviamo vengono trasformati in colori.

source: ### Encoding
it: ### Codifica

source: Fortunately, the encoding is very simple. I will explain it, and at the same time, give an example with the palette we have at hand, $E4.
it: Fortunatamente, la codifica è molto semplice. La spiegherò e allo stesso tempo fornirò un esempio con la tavolozza che abbiamo a portata di mano, $E4.

source: Take the byte, break its 8 bits into 4 groups of 2. ``` [BGP] = $E4 $E4 = %11100100 (refresh your memory in the "Binary and hexadecimal" lesson if needed!) That gets broken down into %11, %10, %01, %00 ```
it: Prendete il byte, suddividete i suoi 8 bit in 4 gruppi di 2. ``` [BGP] = $E4 $E4 = %11100100 (rinfrescate la memoria nella lezione "Binario ed esadecimale" se necessario!) Che viene suddiviso in %11, %10, %01, %00 ```

source: Color number 0 is the rightmost "group", color number 3 is the leftmost one. Simple! And this matches what the VRAM viewer is showing us: color number 0, the rightmost, is the brightest (%00), up to color number 3, the leftmost and the darkest (%11).
it: Il colore numero 0 è il "gruppo" più a destra, il colore numero 3 è quello più a sinistra. Semplice! E questo corrisponde a ciò che ci mostra il visualizzatore VRAM: il colore numero 0, il più a destra, è il più chiaro (%00), fino al colore numero 3, il più a sinistra e il più scuro (%11).

source: ### Lights out
it: ### Luci spente

source: For fun, let's make the screen completely black. We can easily do this by setting all colors in the palette to black (%11). This would be `%11 %11 %11 %11 = $FF`.
it: Per divertimento, rendiamo lo schermo completamente nero. Lo si può fare facilmente impostando tutti i colori della tavolozza sul nero (%11). Questo sarebbe `%11 %11 %11 %11 = $FF`.

source: In the IO map, click the text box left of "BGP", erase the "E4", type "FF", and hit Enter. BGP immediately updates, turning the screen black!
it: Nella mappa IO, fare clic sulla casella di testo a sinistra di "BGP", cancellare "E4", digitare "FF" e premere Invio. BGP si aggiorna immediatamente, facendo diventare lo schermo nero!

source: <figure> <img src="../assets/img/pal_viewer_black.png" alt="Screenshot of the palette viewer with the BGP line entirely black"> <figcaption>Observe how the BGP line is entirely black now. Also, I could have shown a screenshot of the black screen, but that would have been silly.</figcaption> </figure>
it: <figure> <img src="../assets/img/pal_viewer_black.png" alt="Screenshot of the palette viewer with the BGP line entirely black"> <figcaption>Osservate come la linea BGP sia ora completamente nera. Inoltre, avrei potuto mostrare un'immagine della schermata nera, ma sarebbe stato stupido.</figcaption> </figure>

source: What if we wanted to take the original palette, but invert it? %11 would become %00, %01 would become %10, %10 would become %01, and %00 would become %11. We would get thus:
it: E se volessimo prendere la tavolozza originale, ma invertirla? %11 diventerebbe %00, %01 diventerebbe %10, %10 diventerebbe %01, e %00 diventerebbe %11. Otterremmo così:

source: (I'm not giving the value in hexadecimal, use this as an opportunity to exercise your bin-to-hex conversions!)
it: (Non fornirò il valore in esadecimale, ma lo userò come un'opportunità per esercitare le vostre conversioni da bin a esadecimale).
