Repository: c-fst/gb-asm-tutorial
Catalog: po/*.po
Languages: it

source: <figure> <img src="../assets/img/hello_world_inv.png" alt="Screenshot of the color-inverted Hello World"> <figcaption>If you got it right, it should look like this!</figcaption> </figure>
it: <figure> <img src="../assets/img/hello_world_inv.png" alt="Screenshot of the color-inverted Hello World"> <figcaption>Se avete fatto bene, dovrebbe apparire così!</figcaption> </figure>

source: If you go to the Tile Viewer and uncheck the "show paletted" checkbox, you will notice that the tile data stays the same regardless of how the palette is modified! This is an advantage of using palettes: fading the screen in and out is very cheap, just modifying a single byte, instead of having to update every single on-screen pixel.
it: Se andate nel Tile Viewer e deselezionate la casella di controllo "show paletted", noterete che i dati delle piastrelle rimangono invariati indipendentemente dalla modifica della tavolozza! Questo è un vantaggio dell'uso delle tavolozze: la dissolvenza dello schermo è molto economica, basta modificare un singolo byte, invece di dover aggiornare ogni singolo pixel sullo schermo.

source: Got all that? Then let's take a look at the last missing puzzle piece in the Hello World's rendering process, the **tilemap**!
it: Avete capito tutto questo? Allora diamo un'occhiata all'ultimo pezzo mancante del puzzle nel processo di rendering di Hello World, la **tilemap**!

source: [^numbering_zero]: Numbering often starts at 0 when working with computers. We will understand why later, but for now, please bear with it!
it: [^numbering_zero]: La numerazione inizia spesso da 0 quando si lavora con i computer. Capiremo il perché più avanti, ma per il momento, per favore, sopportate!

source: [^console_detection]: Well, it is possible to detect these different models and account for them, but this would require taking plenty of corner cases into consideration, so it's probably not worth the effort.
it: [^console_detection]: È possibile rilevare questi diversi modelli e tenerne conto, ma ciò richiederebbe di prendere in considerazione molti casi particolari, quindi probabilmente non ne vale la pena.

source: Some spell them "tile map", some "tilemap". I will be using the latter by preference, but I also stay consistent with it in the code (`Tilemap` and not `TileMap`), as well as later when we will talk about attribute maps ("attrmap" and `Attrmap` instead of `AttrMap`).
it: Alcuni li chiamano "tile map", altri "tilemap". Io userò quest'ultimo di preferenza, ma lo userò anche nel codice (`Tilemap` e non `TileMap`), così come più avanti quando parleremo di mappe di attributi ("attrmap" e `Attrmap` invece di `AttrMap`).

source: We are *almost* there. We have seen how graphics on the Game Boy are composed of 8×8 "tiles", and we have seen how color is added into the mix.
it: Ci siamo quasi. Abbiamo visto come la grafica del Game Boy sia composta da "piastrelle" 8×8 e come il colore venga aggiunto al mix.

source: But we have not seen yet how those tiles are arranged into a final picture!
it: Ma non abbiamo ancora visto come queste tessere vengono disposte in un'immagine finale!

source: Tiles are basically a grid of pixels; well, the tilemaps are basically a grid of tiles! To allow for cheap reuse, tiles aren't stored in the tilemap directly; instead, tiles are referred to by an *ID*, which you can see in BGB's VRAM viewer.
it: Le piastrelle sono fondamentalmente una griglia di pixel; beh, le tilemaps sono fondamentalmente una griglia di piastrelle! Per consentire un riutilizzo economico, le piastrelle non sono memorizzate direttamente nella tilemap; invece, le piastrelle sono indicate da un *ID*, che si può vedere nel visualizzatore VRAM di BGB.

source: <figure> <img src="../assets/img/tile_id.png" alt="Screenshot highlighting where a tile's ID can be seen"> <figcaption> The ID is displayed in hexadecimal without a prefix, so this is tile number $10, aka 16. As you may have noticed, the tiles are displayed in rows of 16, so it's easier to locate them by hexadecimal ID. Nifty! </figcaption> </figure>
it: <figure> <img src="../assets/img/tile_id.png" alt="Screenshot highlighting where a tile's ID can be seen"> <figcaption> L'ID è visualizzato in esadecimale senza prefisso, quindi questa è la tessera numero 10$, ovvero 16. Come avrete notato, le tessere sono visualizzate in file da 16, così è più facile individuarle in base all'ID esadecimale. Fantastico! </figcaption> </figure>

source: Now, of course, tile IDs are numbers, like everything that computers deal with. IDs are stored in bytes, so there are 256 possible tile IDs. However, the astute reader will have noticed that there are 384 tiles in total[^tile_blocks]! By virtue of the [pigeonhole principle](https://en.wikipedia.org/wiki/Pigeonhole_principle), this means that some IDs refer to several tiles at the same time.
it: Naturalmente gli ID delle tessere sono numeri, come tutti i computer. Gli ID sono memorizzati in byte, quindi ci sono 256 possibili ID di piastrelle. Tuttavia, il lettore più attento avrà notato che ci sono 384 tessere in totale[^blocchi_di_tile]! In virtù del [principio della piccionaia](https://en.wikipedia.org/wiki/Pigeonhole_principle), ciò significa che alcuni ID si riferiscono a più piastrelle contemporaneamente.

source: Indeed, BGB reports that the first 128 tiles have the same IDs as the last 128. There exists a mechanism to select whether IDs 0–127 reference the first or last 128 tiles, but for simplicity's sake, we will overlook this for now, so please ignore the first (topmost) 128 tiles for the time being.
it: In effetti, BGB riporta che le prime 128 tessere hanno gli stessi ID delle ultime 128. Esiste un meccanismo per selezionare se gli ID 0-127 si riferiscono alle prime o alle ultime 128 tessere. Esiste un meccanismo che permette di scegliere se gli ID 0-127 si riferiscono alle prime o alle ultime 128 tessere, ma per semplicità per il momento lo trascuriamo, quindi per il momento ignoriamo le prime 128 tessere (quelle più in alto).

source: Now, please turn your attention to the "BG map" tab of BGB's VRAM viewer, pictured below.
it: Ora, rivolgete la vostra attenzione alla scheda "BG map" del visualizzatore di VRAM di BGB, illustrata qui sotto.

source: ![Screenshot of the tilemap viewer](../assets/img/tilemap_viewer.png)
it: ![Schermata del visualizzatore di mappe di piastrelle](../assets/img/tilemap_viewer.png)

source: You may notice that the image shown is larger than what is displayed on-screen. Only part of the tilemap, outlined by a thicker border in the VRAM viewer, is displayed on-screen at a given time. We will explain this in more detail in Part Ⅱ.
it: Si può notare che l'immagine mostrata è più grande di quella visualizzata sullo schermo. Solo una parte della mappa di piastrelle, delineata da un bordo più spesso nel visualizzatore VRAM, viene visualizzata sullo schermo in un determinato momento. Questo aspetto sarà spiegato più dettagliatamente nella Parte Ⅱ.

source: Here we will be able to see the power of tile reuse in full force. As a convenience and a refresher, here are the tiles our Hello World loads into VRAM:
it: Qui potremo vedere la potenza del riutilizzo dei tile in tutta la sua forza. Per comodità e per rinfrescare la memoria, ecco le tessere che il nostro Hello World carica nella VRAM:

source: ![Enlarged view of the tiles loaded in VRAM](../assets/img/hello_world_tiles.png)
it: ![Vista ingrandita delle tessere caricate nella VRAM](../assets/img/hello_world_tiles.png)

source: You can see that we only loaded a single "blank" tile ($00, the first aka. top-left one), but it can be repeated to cover the whole background at no extra cost!
it: Si può notare che abbiamo caricato una sola tessera "vuota" ($00, la prima a sinistra in alto), ma può essere ripetuta per coprire l'intero sfondo senza costi aggiuntivi!

source: Repetition can be more subtle: for example, tile $01 is used for the top-left corner of the H, E, L, L, and W (red lines below)! The R, L, and D also both share their top-left tile ($2D, blue lines below); and so on. You can confirm this by hovering over tiles in the BG map tab, which shows the ID of the tile at that position.
it: La ripetizione può essere più sottile: ad esempio, la tessera $01 è utilizzata per l'angolo superiore sinistro di H, E, L, L e W (linee rosse in basso)! Anche la R, la L e la D condividono la loro tessera in alto a sinistra ($2D, linee blu in basso); e così via. È possibile confermarlo passando il mouse sulle tessere nella scheda BG map, che mostra l'ID della tessera in quella posizione.

source: <figure> <img src="../assets/img/hello_world_mappings.svg" alt="Diagram of some tile mappings"> <figcaption> Here are some examples of tile reuse. Not everything is drawn, as it would become a mess. </figcaption> </figure>
it: <figure> <img src="../assets/img/hello_world_mappings.svg" alt="Diagram of some tile mappings"> <figcaption> Ecco alcuni esempi di riutilizzo delle piastrelle. Non tutto è disegnato, perché diventerebbe un pasticcio. </figcaption> </figure>

source: All in all, we can surmise that displaying graphics on the Game Boy consists of loading "patterns" (the tiles), and then telling the console which tile to display for each given location.
it: Tutto sommato, possiamo dedurre che la visualizzazione della grafica sul Game Boy consiste nel caricare i "modelli" (le tessere) e nel dire alla console quale tessera visualizzare per ciascuna posizione.

source: [^tile_blocks]: The even more astute (astuter?) reader will have noticed that 384 = 3 × 128. Thus, tiles are often conceptually grouped into three "blocks" of 128 tiles each, which BGB shows as separated by thicker horizontal lines.
it: [^tile_blocks]: Il lettore ancora più astuto (astuto?) avrà notato che 384 = 3 × 128. Pertanto, le tessere sono spesso raggruppate concettualmente in tre "blocchi" di 128 tessere ciascuno, che BGB mostra separati da linee orizzontali più spesse.

source: # Wrapping up
it: # concludere

source: Congrats! You have made it through the first part of this tutorial. By this point, you have a basic enough understanding of the console that you know how to display a picture. And hey, that doesn't sound like much, but consider everything you have seen so far—there *is* a lot that goes into it!
it: Congratulazioni! Avete superato la prima parte di questa esercitazione. A questo punto, avete una conoscenza di base della console tale da sapere come visualizzare un'immagine. Non sembra molto, ma considerate tutto ciò che avete visto finora: c'è molto da fare!

source: Honestly, congrats on coming this far—many people have given up earlier than this. So you can give yourself a pat on the back, you honestly deserve it! **Now may also be a good time to take a break** if you are reading all this in a single trait. I encourage you to give it a little time to sink in, and maybe go back to the lessons you struggled on the most. Maybe a second read can help.
it: Sinceramente, congratulazioni per essere arrivati fino a questo punto: molte persone si sono arrese prima. Quindi potete darvi una pacca sulla spalla, ve la meritate davvero! **Se state leggendo tutto questo in un solo tratto, potrebbe essere un buon momento per fare una pausa. Vi incoraggio a dare un po' di tempo per assimilare il tutto e magari a tornare alle lezioni su cui avete fatto più fatica. Forse una seconda lettura può aiutarvi.

source: And yes, you could simply have let a library handle all that. However, the details always leak through eventually, so knowing about them is helpful, if only for debugging.
it: E sì, si poteva semplicemente lasciare che fosse una libreria a gestire tutto questo. Tuttavia, i dettagli trapelano sempre alla fine, quindi conoscerli è utile, anche solo per il debug.

source: Plus, understanding what's really going on under the hood makes you a better programmer, even if you don't end up using ASM in the long run. Amusingly, even modern systems work similarly to older ones in unexpected places, so some things you just learned will carry over! Trust me, everything you have learned and will learn is worth it! ✊
it: Inoltre, capire cosa succede davvero sotto il cofano vi renderà un programmatore migliore, anche se alla fine non userete ASM. È divertente notare che anche i sistemi moderni funzionano in modo simile a quelli più vecchi in punti inaspettati, quindi alcune cose che avete appena imparato si ripeteranno! Fidatevi di me, tutto ciò che avete imparato e imparerete ne vale la pena! ✊

source: That said, right now, you may have a lot of questions. - Why do we turn off the LCD? - We know how to make a static picture, but how to we add motion into the mix? - Also, how do I get input from the player? - The code mentions shutting down audio, but how do I play some of those famed beeps and bloops? - Writing graphics in that way sound tedious, is there no other way? - Actually, wait, how do we make a game out of all this??
it: Detto questo, in questo momento potreste avere molte domande. - Perché spegnere l'LCD? - Sappiamo come creare un'immagine statica, ma come aggiungere il movimento al mix? - Inoltre, come si ottiene l'input dal lettore? - Il codice menziona l'interruzione dell'audio, ma come faccio a riprodurre alcuni di quei famosi bip e bloop? - Scrivere la grafica in questo modo sembra noioso, non c'è altro modo? - Anzi, aspettate, come facciamo a fare un gioco con tutto questo?

source: ... All of that answered, and more, in Part Ⅱ! 👀
it: ... Tutte queste risposte, e altre ancora, nella Parte Ⅱ! 👀

source: # Getting started
it: # Iniziare

source: In this lesson, we will start a new project from scratch. We will make a [Breakout](https://en.wikipedia.org/wiki/Breakout_%28video_game%29) / [Arkanoid](https://en.wikipedia.org/wiki/Arkanoid) clone, which we'll call "Unbricked"! (Though you are free to give it any other name you like, as it will be *your* project.)
it: In questa lezione inizieremo un nuovo progetto da zero. Creeremo un clone di [Breakout](https://en.wikipedia.org/wiki/Breakout_%28video_game%29) / [Arkanoid](https://en.wikipedia.org/wiki/Arkanoid), che chiameremo "Unbricked"! (Anche se siete liberi di dargli qualsiasi altro nome, perché sarà il *vostro* progetto).

source: Open a terminal and make a new directory (`mkdir unbricked`), and then enter it (`cd unbricked`), just like you did for ["Hello, world!"](../part1/hello_world.md).
it: Aprire un terminale e creare una nuova directory (`mkdir unbricked`), quindi entrarvi (`cd unbricked`), proprio come si è fatto per ["Hello, world!"](../part1/hello_world.md).

source: Start by creating a file called `main.asm`, and include `hardware.inc` in your code.
it: Si inizia creando un file chiamato `main.asm` e si include `hardware.inc` nel codice.

source: ```rgbasm,linenos,start=1 INCLUDE "hardware.inc" ``` You may be wondering what purpose `hardware.inc` serves. Well, the code we write only really affects the CPU, but does not do anything with the rest of the console (not directly, anyway). To interact with other components (like the graphics system, say), [Memory-Mapped <abbr title="Input/Output">I/O</abbr>](https://en.wikipedia.org/wiki/Memory-mapped_I/O) (MMIO) is used: basically, [memory](../part1/memory.md) in a certain range (addresses $FF00–FF7F) does special things when accessed.
it: ``rgbasm,linenos,start=1 INCLUDE "hardware.inc" ``` Vi starete chiedendo a cosa serva `hardware.inc`. Beh, il codice che scriviamo influisce solo sulla CPU, ma non fa nulla con il resto della console (non direttamente, comunque). Per interagire con altri componenti (come il sistema grafico, per esempio), si usa [Memory-Mapped <abbr title="Input/Output">I/O</abbr>](https://en.wikipedia.org/wiki/Memory-mapped_I/O) (MMIO): in pratica, [memory](../part1/memory.md) in un certo intervallo (indirizzi $FF00-FF7F) fa cose speciali quando vi si accede.

source: These bytes of memory being interfaces to the hardware, they are called *hardware registers* (not to be mistaken with [the CPU registers](../part1/registers.md)). For example, the "PPU status" register is located at address $FF41. Reading from that address reports various bits of info regarding the graphics system, and writing to it allows changing some parameters. But, having to remember all the numbers ([non-exhaustive list](https://gbdev.io/pandocs/Power_Up_Sequence.html#hardware-registers)) would be very tedious—and this is where `hardware.inc` comes into play! `hardware.inc` defines one constant for each of these registers (for example, `rSTAT` for the aforementioned "PPU status" register), plus some additional constants for values read from or written to these registers.
it: Essendo questi byte di memoria interfacce per l'hardware, sono chiamati *registri hardware* (da non confondere con [i registri della CPU](../part1/registers.md)). Ad esempio, il registro "stato PPU" si trova all'indirizzo $FF41. La lettura di questo indirizzo riporta varie informazioni sul sistema grafico e la scrittura consente di modificare alcuni parametri. Ma dover ricordare tutti i numeri ([elenco non esaustivo](https://gbdev.io/pandocs/Power_Up_Sequence.html#hardware-registers)) sarebbe molto noioso, ed è qui che entra in gioco `hardware.inc`! `hardware.inc` definisce una costante per ciascuno di questi registri (per esempio, `rSTAT` per il già citato registro "stato della PPU"), più alcune costanti aggiuntive per i valori letti o scritti in questi registri.

source: Don't worry if this flew over your head, we'll see an example below with `rLCDC` and `LCDCF_ON`.
it: Non preoccupatevi se tutto questo vi è sfuggito di mano: di seguito vedremo un esempio con `rLCDC` e `LCDCF_ON`.

source: By the way, the `r` stands for "register", and the `F` in `LCDCF` stands for "flag".
it: A proposito, la `r` sta per "registro" e la `F` in `LCDCF` sta per "flag".

source: Next, make room for the header. [Remember from Part Ⅰ](../part1/header.md) that the header is where some information that the Game Boy relies on is stored, so you don't want to accidentally leave it out.
it: Quindi, fare spazio per l'intestazione. [Ricordiamo dalla Parte Ⅰ](../part1/header.md) che l'intestazione è il luogo in cui vengono memorizzate alcune informazioni su cui il Game Boy fa affidamento, quindi non bisogna lasciarla fuori per sbaglio.

source: The header jumps to `EntryPoint`, so let's write that now:
it: L'intestazione salta a `EntryPoint`, quindi scriviamola ora:

source: ```rgbasm,linenos,start=9 EntryPoint: ; Do not turn the LCD off outside of VBlank WaitVBlank: ld a, [rLY] cp 144 jp c, WaitVBlank
it: ``rgbasm,linenos,start=9 EntryPoint: ; Non spegnere l'LCD al di fuori di VBlank WaitVBlank: ld a, [rLY] cp 144 jp c, WaitVBlank

source: ; Turn the LCD off ld a, 0 ld [rLCDC], a ```
it: ; Spegnere l'LCD ld a, 0 ld [rLCDC], a ````

source: The next few lines wait until "VBlank", which is the only time you can safely turn off the screen (doing so at the wrong time could damage a real Game Boy, so this is very crucial). We'll explain what VBlank is and talk about it more later in the tutorial.
it: Le righe successive attendono fino a "VBlank", che è l'unico momento in cui è possibile spegnere lo schermo in modo sicuro (farlo nel momento sbagliato potrebbe danneggiare un vero Game Boy, quindi è molto importante). Spiegheremo cos'è il VBlank e ne parleremo più avanti nel corso dell'esercitazione.

source: Turning off the screen is important because loading new tiles while the screen is on is tricky—we'll touch on how to do that in Part 3.
it: Spegnere lo schermo è importante perché il caricamento di nuove tessere a schermo acceso è complicato, come vedremo nella terza parte.

source: Speaking of tiles, we're going to load some into VRAM next, using the following code:
it: A proposito di tessere, ora ne caricheremo alcune nella VRAM, utilizzando il seguente codice:

source: ```rgbasm,linenos,start=20 ; Copy the tile data ld de, Tiles ld hl, $9000 ld bc, TilesEnd - Tiles CopyTiles: ld a, [de] ld [hli], a inc de dec bc ld a, b or a, c jp nz, CopyTiles ```
it: ``rgbasm,linenos,start=20 ; Copia i dati delle piastrelle ld de, Tiles ld hl, $9000 ld bc, TilesEnd - Tiles CopyTiles: ld a, [de] ld [hli], a inc de dec bc ld a, b or a, c jp nz, CopyTiles ````

source: This loop might be [reminiscent of part Ⅰ](../part1/jumps.md#conditional-jumps). It copies starting at `Tiles` to `$9000` onwards, which is the part of VRAM where our [tiles](../part1/tiles.md) are going to be stored. Recall that `$9000` is where the data of background tile $00 lies, and the data of subsequent tiles follows right after. To get the number of bytes to copy, we will do just like in Part Ⅰ: using another label at the end, called `TilesEnd`, the difference between it (= the address after the last byte of tile data) and `Tiles` (= the address of the first byte) will be exactly that length.
it: Questo ciclo potrebbe essere [che ricorda la parte Ⅰ](../part1/jumps.md#conditional-jumps). Copia a partire da `Tiles` fino a `$9000`, che è la parte di VRAM in cui verrà memorizzato il nostro [tiles](../part1/tiles.md). Ricordiamo che `$9000` è il luogo in cui si trovano i dati del tile di sfondo $00, e i dati dei tile successivi seguono subito dopo. Per ottenere il numero di byte da copiare, faremo come nella parte Ⅰ: usando un'altra etichetta alla fine, chiamata `TilesEnd`, la differenza tra questa (= l'indirizzo dopo l'ultimo byte dei dati delle tile) e `Tiles` (= l'indirizzo del primo byte) sarà esattamente quella lunghezza.

source: That said, we haven't written `Tiles` nor any of the related data yet. We'll get to that later!
it: Detto questo, non abbiamo ancora scritto `Tiles` né i relativi dati. Ci arriveremo più tardi!

source: Almost done now—next, write another loop, this time for copying [the tilemap](../part1/tilemap.md).
it: Quasi finito ora - il prossimo, scrivere un altro ciclo, questa volta per copiare [la mappa delle piastrelle](../part1/tilemap.md).

source: ```rgbasm,linenos,start=33 ; Copy the tilemap ld de, Tilemap ld hl, $9800 ld bc, TilemapEnd - Tilemap CopyTilemap: ld a, [de] ld [hli], a inc de dec bc ld a, b or a, c jp nz, CopyTilemap ```
it: ``rgbasm,linenos,start=33 ; Copia la tilemap ld de, Tilemap ld hl, $9800 ld bc, TilemapEnd - Tilemap CopyTilemap: ld a, [de] ld [hli], a inc de dec bc ld a, b o a, c jp nz, CopyTilemap ````

source: Note that while this loop's body is exactly the same as `CopyTiles`'s, the 3 values loaded into `de`, `hl`, and `bc` are different. These determine the source, destination, and size of the copy, respectively.
it: Si noti che, mentre il corpo di questo ciclo è esattamente lo stesso di `CopyTiles`, i 3 valori caricati in `de`, `hl` e `bc` sono diversi. Questi determinano rispettivamente l'origine, la destinazione e la dimensione della copia.

source: ::: tip "[<abbr title="Don't Repeat Yourself">DRY</abbr>](https://en.wikipedia.org/wiki/Don't_Repeat_Yourself)"
it: ::: suggerimento "[<abbr title="Don't Repeat Yourself">DRY</abbr>](https://en.wikipedia.org/wiki/Don't_Repeat_Yourself)".

source: If you think that this is super redundant, you are not wrong, and we will see later how to write actual, reusable *functions*. But there is more to them than meets the eye, so we will start tackling them much later.
it: Se pensate che tutto ciò sia superfluo, non avete torto: vedremo più avanti come scrivere delle vere e proprie *funzioni* riutilizzabili. Ma c'è molto di più di quello che sembra, quindi inizieremo ad affrontarle molto più avanti.
